/**
 * Loader generated by glad 2.0.8 on -
 *
 * SPDX-License-Identifier: (WTFPL OR CC0-1.0) AND Apache-2.0
 *
 * Generator: C/C++
 * Specification: egl
 * Extensions: 224
 *
 * APIs:
 *  - egl=1.5
 *
 * Options:
 *  - ALIAS = True
 *  - HEADER_ONLY = False
 *  - LOADER = True
 *  - MX = True
 *  - MX_GLOBAL = True
 *
 * Commandline:

#define EGL_WRITE_SURFACE_BIT_KHR 0x0002
#define EGL_X11_VISUAL_ID_ANGLE 0x33A3
#define EGL_X_AXIS_NV 0x336F
#define EGL_YUV_BUFFER_EXT 0x3300
#define EGL_YUV_CHROMA_HORIZONTAL_SITING_HINT_EXT 0x327D
#define EGL_YUV_CHROMA_SITING_0_5_EXT 0x3285
#define EGL_YUV_CHROMA_SITING_0_EXT 0x3284
#define EGL_YUV_CHROMA_VERTICAL_SITING_HINT_EXT 0x327E
#define EGL_YUV_COLOR_SPACE_HINT_EXT 0x327B
#define EGL_YUV_CSC_STANDARD_2020_EXT 0x330D
#define EGL_YUV_CSC_STANDARD_601_EXT 0x330B
#define EGL_YUV_CSC_STANDARD_709_EXT 0x330C
#define EGL_YUV_CSC_STANDARD_EXT 0x330A
#define EGL_YUV_DEPTH_RANGE_EXT 0x3317
#define EGL_YUV_DEPTH_RANGE_FULL_EXT 0x3319
#define EGL_YUV_DEPTH_RANGE_LIMITED_EXT 0x3318
#define EGL_YUV_FULL_RANGE_EXT 0x3282
#define EGL_YUV_NARROW_RANGE_EXT 0x3283
#define EGL_YUV_NUMBER_OF_PLANES_EXT 0x3311
#define EGL_YUV_ORDER_AYUV_EXT 0x3308
#define EGL_YUV_ORDER_EXT 0x3301
#define EGL_YUV_ORDER_UYVY_EXT 0x3305
#define EGL_YUV_ORDER_VYUY_EXT 0x3307
#define EGL_YUV_ORDER_YUV_EXT 0x3302
#define EGL_YUV_ORDER_YUYV_EXT 0x3304
#define EGL_YUV_ORDER_YVU_EXT 0x3303
#define EGL_YUV_ORDER_YVYU_EXT 0x3306
#define EGL_YUV_PLANE0_TEXTURE_UNIT_NV 0x332C
#define EGL_YUV_PLANE1_TEXTURE_UNIT_NV 0x332D
#define EGL_YUV_PLANE2_TEXTURE_UNIT_NV 0x332E
#define EGL_YUV_PLANE_BPP_0_EXT 0x331B
#define EGL_YUV_PLANE_BPP_10_EXT 0x331D
#define EGL_YUV_PLANE_BPP_8_EXT 0x331C
#define EGL_YUV_PLANE_BPP_EXT 0x331A
#define EGL_YUV_SUBSAMPLE_4_2_0_EXT 0x3313
#define EGL_YUV_SUBSAMPLE_4_2_2_EXT 0x3314
#define EGL_YUV_SUBSAMPLE_4_4_4_EXT 0x3315
#define EGL_YUV_SUBSAMPLE_EXT 0x3312
#define EGL_Y_AXIS_NV 0x3370
#define EGL_Y_INVERTED_NOK 0x307F


#include <KHR/khrplatform.h>
#include <EGL/eglplatform.h>











struct AHardwareBuffer;
struct wl_buffer;
struct wl_display;
struct wl_resource;

typedef unsigned int EGLBoolean;
typedef unsigned int EGLenum;
typedef intptr_t EGLAttribKHR;
typedef intptr_t EGLAttrib;
typedef void *EGLClientBuffer;
typedef void *EGLConfig;
typedef void *EGLContext;
typedef void *EGLDeviceEXT;
typedef void *EGLDisplay;
typedef void *EGLImage;
typedef void *EGLImageKHR;
typedef void *EGLLabelKHR;
typedef void *EGLObjectKHR;
typedef void *EGLOutputLayerEXT;
typedef void *EGLOutputPortEXT;
typedef void *EGLStreamKHR;
typedef void *EGLSurface;
typedef void *EGLSync;
typedef void *EGLSyncKHR;
typedef void *EGLSyncNV;
typedef void (*__eglMustCastToProperFunctionPointerType)(void);
typedef khronos_utime_nanoseconds_t EGLTimeKHR;
typedef khronos_utime_nanoseconds_t EGLTime;
typedef khronos_utime_nanoseconds_t EGLTimeNV;
typedef khronos_utime_nanoseconds_t EGLuint64NV;
typedef khronos_uint64_t EGLuint64KHR;
typedef khronos_stime_nanoseconds_t EGLnsecsANDROID;
typedef int EGLNativeFileDescriptorKHR;
typedef khronos_ssize_t EGLsizeiANDROID;
typedef void (*EGLSetBlobFuncANDROID) (const void *key, EGLsizeiANDROID keySize, const void *value, EGLsizeiANDROID valueSize);
typedef EGLsizeiANDROID (*EGLGetBlobFuncANDROID) (const void *key, EGLsizeiANDROID keySize, void *value, EGLsizeiANDROID valueSize);
struct EGLClientPixmapHI {
    void  *pData;
    EGLint iWidth;
    EGLint iHeight;
    EGLint iStride;
};
typedef void (GLAD_API_PTR *EGLDEBUGPROCKHR)(EGLenum error,const char *command,EGLint messageType,EGLLabelKHR threadLabel,EGLLabelKHR objectLabel,const char* message);
#define PFNEGLBINDWAYLANDDISPLAYWL PFNEGLBINDWAYLANDDISPLAYWLPROC
#define PFNEGLUNBINDWAYLANDDISPLAYWL PFNEGLUNBINDWAYLANDDISPLAYWLPROC
#define PFNEGLQUERYWAYLANDBUFFERWL PFNEGLQUERYWAYLANDBUFFERWLPROC
#define PFNEGLCREATEWAYLANDBUFFERFROMIMAGEWL PFNEGLCREATEWAYLANDBUFFERFROMIMAGEWLPROC
typedef khronos_uint64_t EGLFrameTokenANGLE;


#define EGL_VERSION_1_0 1
#define EGL_VERSION_1_1 1
#define EGL_VERSION_1_2 1
#define EGL_VERSION_1_3 1
#define EGL_VERSION_1_4 1
#define EGL_VERSION_1_5 1
#define EGL_ANDROID_GLES_layers 1
#define EGL_ANDROID_blob_cache 1
#define EGL_ANDROID_create_native_client_buffer 1
#define EGL_ANDROID_framebuffer_target 1
#define EGL_ANDROID_front_buffer_auto_refresh 1
#define EGL_ANDROID_get_frame_timestamps 1
#define EGL_ANDROID_get_native_client_buffer 1
#define EGL_ANDROID_image_native_buffer 1
#define EGL_ANDROID_native_fence_sync 1
#define EGL_ANDROID_presentation_time 1
#define EGL_ANDROID_recordable 1
#define EGL_ANDROID_telemetry_hint 1
#define EGL_ANGLE_colorspace_attribute_passthrough 1
#define EGL_ANGLE_context_virtualization 1
#define EGL_ANGLE_create_context_backwards_compatible 1
#define EGL_ANGLE_create_context_client_arrays 1
#define EGL_ANGLE_create_context_extensions_enabled 1
#define EGL_ANGLE_create_context_webgl_compatibility 1
#define EGL_ANGLE_create_surface_swap_interval 1
#define EGL_ANGLE_d3d_share_handle_client_buffer 1
#define EGL_ANGLE_d3d_texture_client_buffer 1
#define EGL_ANGLE_device_cgl 1
#define EGL_ANGLE_device_creation 1
#define EGL_ANGLE_device_d3d 1
#define EGL_ANGLE_device_d3d11 1
#define EGL_ANGLE_device_d3d9 1
#define EGL_ANGLE_device_eagl 1
#define EGL_ANGLE_device_metal 1
#define EGL_ANGLE_device_vulkan 1
#define EGL_ANGLE_direct_composition 1
#define EGL_ANGLE_display_power_preference 1
#define EGL_ANGLE_display_semaphore_share_group 1
#define EGL_ANGLE_display_texture_share_group 1
#define EGL_ANGLE_experimental_present_path 1
#define EGL_ANGLE_external_context_and_surface 1
#define EGL_ANGLE_feature_control 1
#define EGL_ANGLE_ggp_stream_descriptor 1
#define EGL_ANGLE_global_fence_sync 1
#define EGL_ANGLE_iosurface_client_buffer 1
#define EGL_ANGLE_keyed_mutex 1
#define EGL_ANGLE_memory_usage_report 1
#define EGL_ANGLE_metal_create_context_ownership_identity 1
#define EGL_ANGLE_metal_shared_event_sync 1
#define EGL_ANGLE_metal_texture_client_buffer 1
#define EGL_ANGLE_no_error 1
#define EGL_ANGLE_platform_angle 1
#define EGL_ANGLE_platform_angle_d3d 1
#define EGL_ANGLE_platform_angle_d3d11on12 1
#define EGL_ANGLE_platform_angle_d3d_luid 1
#define EGL_ANGLE_platform_angle_device_context_volatile_cgl 1
#define EGL_ANGLE_platform_angle_device_context_volatile_eagl 1
#define EGL_ANGLE_platform_angle_device_id 1
#define EGL_ANGLE_platform_angle_device_type_egl 1
#define EGL_ANGLE_platform_angle_device_type_swiftshader 1
#define EGL_ANGLE_platform_angle_metal 1
#define EGL_ANGLE_platform_angle_null 1
#define EGL_ANGLE_platform_angle_opengl 1
#define EGL_ANGLE_platform_angle_vulkan 1
#define EGL_ANGLE_platform_angle_vulkan_device_uuid 1
#define EGL_ANGLE_platform_angle_webgpu 1
#define EGL_ANGLE_power_preference 1
#define EGL_ANGLE_prepare_swap_buffers 1
#define EGL_ANGLE_program_cache_control 1
#define EGL_ANGLE_query_surface_pointer 1
#define EGL_ANGLE_robust_resource_initialization 1
#define EGL_ANGLE_stream_producer_d3d_texture 1
#define EGL_ANGLE_surface_d3d_texture_2d_share_handle 1
#define EGL_ANGLE_surface_orientation 1
#define EGL_ANGLE_swap_with_frame_token 1
#define EGL_ANGLE_sync_control_rate 1
#define EGL_ANGLE_vulkan_display 1
#define EGL_ANGLE_vulkan_image 1
#define EGL_ANGLE_wait_until_work_scheduled 1
#define EGL_ANGLE_window_fixed_size 1
#define EGL_ANGLE_x11_visual 1
#define EGL_ARM_image_format 1
#define EGL_ARM_implicit_external_sync 1
#define EGL_ARM_pixmap_multisample_discard 1
#define EGL_CHROMIUM_sync_control 1
#define EGL_EXT_bind_to_front 1
#define EGL_EXT_buffer_age 1
#define EGL_EXT_client_extensions 1
#define EGL_EXT_client_sync 1
#define EGL_EXT_compositor 1
#define EGL_EXT_config_select_group 1
#define EGL_EXT_create_context_robustness 1
#define EGL_EXT_device_base 1
#define EGL_EXT_device_drm 1
#define EGL_EXT_device_drm_render_node 1
#define EGL_EXT_device_enumeration 1
#define EGL_EXT_device_openwf 1
#define EGL_EXT_device_persistent_id 1
#define EGL_EXT_device_query 1
#define EGL_EXT_device_query_name 1
#define EGL_EXT_display_alloc 1
#define EGL_EXT_explicit_device 1
#define EGL_EXT_gl_colorspace_bt2020_hlg 1
#define EGL_EXT_gl_colorspace_bt2020_linear 1
#define EGL_EXT_gl_colorspace_bt2020_pq 1
#define EGL_EXT_gl_colorspace_display_p3 1
#define EGL_EXT_gl_colorspace_display_p3_linear 1
#define EGL_EXT_gl_colorspace_display_p3_passthrough 1
#define EGL_EXT_gl_colorspace_scrgb 1
#define EGL_EXT_gl_colorspace_scrgb_linear 1
#define EGL_EXT_image_dma_buf_import 1
#define EGL_EXT_image_dma_buf_import_modifiers 1
#define EGL_EXT_image_gl_colorspace 1
#define EGL_EXT_image_implicit_sync_control 1
#define EGL_EXT_multiview_window 1
#define EGL_EXT_output_base 1
#define EGL_EXT_output_drm 1
#define EGL_EXT_output_openwf 1
#define EGL_EXT_pixel_format_float 1
#define EGL_EXT_platform_base 1
#define EGL_EXT_platform_device 1
#define EGL_EXT_platform_wayland 1
#define EGL_EXT_platform_x11 1
#define EGL_EXT_platform_xcb 1
#define EGL_EXT_present_opaque 1
#define EGL_EXT_protected_content 1
#define EGL_EXT_protected_surface 1
#define EGL_EXT_query_reset_notification_strategy 1
#define EGL_EXT_stream_consumer_egloutput 1
#define EGL_EXT_surface_CTA861_3_metadata 1
#define EGL_EXT_surface_SMPTE2086_metadata 1
#define EGL_EXT_surface_compression 1
#define EGL_EXT_swap_buffers_with_damage 1
#define EGL_EXT_sync_reuse 1
#define EGL_EXT_yuv_surface 1
#define EGL_HI_clientpixmap 1
#define EGL_HI_colorformats 1
#define EGL_IMG_context_priority 1
#define EGL_IMG_image_plane_attribs 1
#define EGL_KHR_cl_event 1
#define EGL_KHR_cl_event2 1
#define EGL_KHR_client_get_all_proc_addresses 1
#define EGL_KHR_config_attribs 1
#define EGL_KHR_context_flush_control 1
#define EGL_KHR_create_context 1
#define EGL_KHR_create_context_no_error 1
#define EGL_KHR_debug 1
#define EGL_KHR_display_reference 1
#define EGL_KHR_fence_sync 1
#define EGL_KHR_get_all_proc_addresses 1
#define EGL_KHR_gl_colorspace 1
#define EGL_KHR_gl_renderbuffer_image 1
#define EGL_KHR_gl_texture_2D_image 1
#define EGL_KHR_gl_texture_3D_image 1
#define EGL_KHR_gl_texture_cubemap_image 1
#define EGL_KHR_image 1
#define EGL_KHR_image_base 1
#define EGL_KHR_image_pixmap 1
#define EGL_KHR_lock_surface 1
#define EGL_KHR_lock_surface2 1
#define EGL_KHR_lock_surface3 1
#define EGL_KHR_mutable_render_buffer 1
#define EGL_KHR_no_config_context 1
#define EGL_KHR_partial_update 1
#define EGL_KHR_platform_android 1
#define EGL_KHR_platform_gbm 1
#define EGL_KHR_platform_wayland 1
#define EGL_KHR_platform_x11 1
#define EGL_KHR_reusable_sync 1
#define EGL_KHR_stream 1
#define EGL_KHR_stream_attrib 1
#define EGL_KHR_stream_consumer_gltexture 1
#define EGL_KHR_stream_cross_process_fd 1
#define EGL_KHR_stream_fifo 1
#define EGL_KHR_stream_producer_aldatalocator 1
#define EGL_KHR_stream_producer_eglsurface 1
#define EGL_KHR_surfaceless_context 1
#define EGL_KHR_swap_buffers_with_damage 1
#define EGL_KHR_vg_parent_image 1
#define EGL_KHR_wait_sync 1
#define EGL_MESA_drm_image 1
#define EGL_MESA_image_dma_buf_export 1
#define EGL_MESA_platform_gbm 1
#define EGL_MESA_platform_surfaceless 1
#define EGL_MESA_query_driver 1
#define EGL_NOK_swap_region 1
#define EGL_NOK_swap_region2 1
#define EGL_NOK_texture_from_pixmap 1
#define EGL_NV_3dvision_surface 1
#define EGL_NV_context_priority_realtime 1
#define EGL_NV_coverage_sample 1
#define EGL_NV_coverage_sample_resolve 1
#define EGL_NV_cuda_event 1
#define EGL_NV_depth_nonlinear 1
#define EGL_NV_device_cuda 1
#define EGL_NV_native_query 1
#define EGL_NV_post_convert_rounding 1
#define EGL_NV_post_sub_buffer 1
#define EGL_NV_quadruple_buffer 1
#define EGL_NV_robustness_video_memory_purge 1
#define EGL_NV_stream_consumer_eglimage 1
#define EGL_NV_stream_consumer_eglimage_use_scanout_attrib 1
#define EGL_NV_stream_consumer_gltexture_yuv 1
#define EGL_NV_stream_cross_display 1
#define EGL_NV_stream_cross_object 1
#define EGL_NV_stream_cross_partition 1
#define EGL_NV_stream_cross_process 1
#define EGL_NV_stream_cross_system 1
#define EGL_NV_stream_dma 1
#define EGL_NV_stream_fifo_next 1
#define EGL_NV_stream_fifo_synchronous 1
#define EGL_NV_stream_flush 1
#define EGL_NV_stream_frame_limits 1
#define EGL_NV_stream_metadata 1
#define EGL_NV_stream_origin 1
#define EGL_NV_stream_remote 1
#define EGL_NV_stream_reset 1
#define EGL_NV_stream_socket 1
#define EGL_NV_stream_socket_inet 1
#define EGL_NV_stream_socket_unix 1
#define EGL_NV_stream_sync 1
#define EGL_NV_sync 1
#define EGL_NV_system_time 1
#define EGL_NV_triple_buffer 1
#define EGL_QNX_image_native_buffer 1
#define EGL_QNX_platform_screen 1
#define EGL_TIZEN_image_native_buffer 1
#define EGL_TIZEN_image_native_surface 1
#define EGL_WL_bind_wayland_display 1
#define EGL_WL_create_wayland_buffer_from_image 1



typedef void (GLAD_API_PTR *PFNEGLACQUIREEXTERNALCONTEXTANGLEPROC)(EGLDisplay dpy, EGLSurface drawAndRead);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLBINDAPIPROC)(EGLenum api);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLBINDTEXIMAGEPROC)(EGLDisplay dpy, EGLSurface surface, EGLint buffer);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLBINDWAYLANDDISPLAYWLPROC)(EGLDisplay dpy, struct wl_display * display);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLCHOOSECONFIGPROC)(EGLDisplay dpy, const EGLint * attrib_list, EGLConfig * configs, EGLint config_size, EGLint * num_config);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLCLIENTSIGNALSYNCEXTPROC)(EGLDisplay dpy, EGLSync sync, const EGLAttrib * attrib_list);
typedef EGLint (GLAD_API_PTR *PFNEGLCLIENTWAITSYNCPROC)(EGLDisplay dpy, EGLSync sync, EGLint flags, EGLTime timeout);
typedef EGLint (GLAD_API_PTR *PFNEGLCLIENTWAITSYNCKHRPROC)(EGLDisplay dpy, EGLSyncKHR sync, EGLint flags, EGLTimeKHR timeout);
typedef EGLint (GLAD_API_PTR *PFNEGLCLIENTWAITSYNCNVPROC)(EGLSyncNV sync, EGLint flags, EGLTimeNV timeout);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLCOMPOSITORBINDTEXWINDOWEXTPROC)(EGLint external_win_id);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLCOMPOSITORSETCONTEXTATTRIBUTESEXTPROC)(EGLint external_ref_id, const EGLint * context_attributes, EGLint num_entries);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLCOMPOSITORSETCONTEXTLISTEXTPROC)(const EGLint * external_ref_ids, EGLint num_entries);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLCOMPOSITORSETSIZEEXTPROC)(EGLint external_win_id, EGLint width, EGLint height);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLCOMPOSITORSETWINDOWATTRIBUTESEXTPROC)(EGLint external_win_id, const EGLint * window_attributes, EGLint num_entries);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLCOMPOSITORSETWINDOWLISTEXTPROC)(EGLint external_ref_id, const EGLint * external_win_ids, EGLint num_entries);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLCOMPOSITORSWAPPOLICYEXTPROC)(EGLint external_win_id, EGLint policy);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLCOPYBUFFERSPROC)(EGLDisplay dpy, EGLSurface surface, EGLNativePixmapType target);
typedef void * (GLAD_API_PTR *PFNEGLCOPYMETALSHAREDEVENTANGLEPROC)(EGLDisplay dpy, EGLSyncKHR sync);
typedef EGLContext (GLAD_API_PTR *PFNEGLCREATECONTEXTPROC)(EGLDisplay dpy, EGLConfig config, EGLContext share_context, const EGLint * attrib_list);
typedef EGLImageKHR (GLAD_API_PTR *PFNEGLCREATEDRMIMAGEMESAPROC)(EGLDisplay dpy, const EGLint * attrib_list);
typedef EGLDeviceEXT (GLAD_API_PTR *PFNEGLCREATEDEVICEANGLEPROC)(EGLint device_type, void * native_device, const EGLAttrib * attrib_list);
typedef EGLSyncNV (GLAD_API_PTR *PFNEGLCREATEFENCESYNCNVPROC)(EGLDisplay dpy, EGLenum condition, const EGLint * attrib_list);
typedef EGLImage (GLAD_API_PTR *PFNEGLCREATEIMAGEPROC)(EGLDisplay dpy, EGLContext ctx, EGLenum target, EGLClientBuffer buffer, const EGLAttrib * attrib_list);
typedef EGLImageKHR (GLAD_API_PTR *PFNEGLCREATEIMAGEKHRPROC)(EGLDisplay dpy, EGLContext ctx, EGLenum target, EGLClientBuffer buffer, const EGLint * attrib_list);
typedef EGLClientBuffer (GLAD_API_PTR *PFNEGLCREATENATIVECLIENTBUFFERANDROIDPROC)(const EGLint * attrib_list);
typedef EGLSurface (GLAD_API_PTR *PFNEGLCREATEPBUFFERFROMCLIENTBUFFERPROC)(EGLDisplay dpy, EGLenum buftype, EGLClientBuffer buffer, EGLConfig config, const EGLint * attrib_list);
typedef EGLSurface (GLAD_API_PTR *PFNEGLCREATEPBUFFERSURFACEPROC)(EGLDisplay dpy, EGLConfig config, const EGLint * attrib_list);
typedef EGLSurface (GLAD_API_PTR *PFNEGLCREATEPIXMAPSURFACEPROC)(EGLDisplay dpy, EGLConfig config, EGLNativePixmapType pixmap, const EGLint * attrib_list);
typedef EGLSurface (GLAD_API_PTR *PFNEGLCREATEPIXMAPSURFACEHIPROC)(EGLDisplay dpy, EGLConfig config, struct EGLClientPixmapHI * pixmap);
typedef EGLSurface (GLAD_API_PTR *PFNEGLCREATEPLATFORMPIXMAPSURFACEPROC)(EGLDisplay dpy, EGLConfig config, void * native_pixmap, const EGLAttrib * attrib_list);
typedef EGLSurface (GLAD_API_PTR *PFNEGLCREATEPLATFORMPIXMAPSURFACEEXTPROC)(EGLDisplay dpy, EGLConfig config, void * native_pixmap, const EGLint * attrib_list);
typedef EGLSurface (GLAD_API_PTR *PFNEGLCREATEPLATFORMWINDOWSURFACEPROC)(EGLDisplay dpy, EGLConfig config, void * native_window, const EGLAttrib * attrib_list);
typedef EGLSurface (GLAD_API_PTR *PFNEGLCREATEPLATFORMWINDOWSURFACEEXTPROC)(EGLDisplay dpy, EGLConfig config, void * native_window, const EGLint * attrib_list);
typedef EGLStreamKHR (GLAD_API_PTR *PFNEGLCREATESTREAMATTRIBKHRPROC)(EGLDisplay dpy, const EGLAttrib * attrib_list);
typedef EGLStreamKHR (GLAD_API_PTR *PFNEGLCREATESTREAMFROMFILEDESCRIPTORKHRPROC)(EGLDisplay dpy, EGLNativeFileDescriptorKHR file_descriptor);
typedef EGLStreamKHR (GLAD_API_PTR *PFNEGLCREATESTREAMKHRPROC)(EGLDisplay dpy, const EGLint * attrib_list);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLCREATESTREAMPRODUCERD3DTEXTUREANGLEPROC)(EGLDisplay dpy, EGLStreamKHR stream, const EGLAttrib * attrib_list);
typedef EGLSurface (GLAD_API_PTR *PFNEGLCREATESTREAMPRODUCERSURFACEKHRPROC)(EGLDisplay dpy, EGLConfig config, EGLStreamKHR stream, const EGLint * attrib_list);
typedef EGLSyncKHR (GLAD_API_PTR *PFNEGLCREATESTREAMSYNCNVPROC)(EGLDisplay dpy, EGLStreamKHR stream, EGLenum type, const EGLint * attrib_list);
typedef EGLSync (GLAD_API_PTR *PFNEGLCREATESYNCPROC)(EGLDisplay dpy, EGLenum type, const EGLAttrib * attrib_list);
typedef EGLSyncKHR (GLAD_API_PTR *PFNEGLCREATESYNC64KHRPROC)(EGLDisplay dpy, EGLenum type, const EGLAttribKHR * attrib_list);
typedef EGLSyncKHR (GLAD_API_PTR *PFNEGLCREATESYNCKHRPROC)(EGLDisplay dpy, EGLenum type, const EGLint * attrib_list);
typedef struct wl_buffer * (GLAD_API_PTR *PFNEGLCREATEWAYLANDBUFFERFROMIMAGEWLPROC)(EGLDisplay dpy, EGLImageKHR image);
typedef EGLSurface (GLAD_API_PTR *PFNEGLCREATEWINDOWSURFACEPROC)(EGLDisplay dpy, EGLConfig config, EGLNativeWindowType win, const EGLint * attrib_list);
typedef EGLint (GLAD_API_PTR *PFNEGLDEBUGMESSAGECONTROLKHRPROC)(EGLDEBUGPROCKHR callback, const EGLAttrib * attrib_list);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLDESTROYCONTEXTPROC)(EGLDisplay dpy, EGLContext ctx);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLDESTROYDISPLAYEXTPROC)(EGLDisplay dpy);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLDESTROYIMAGEPROC)(EGLDisplay dpy, EGLImage image);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLDESTROYIMAGEKHRPROC)(EGLDisplay dpy, EGLImageKHR image);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLDESTROYSTREAMKHRPROC)(EGLDisplay dpy, EGLStreamKHR stream);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLDESTROYSURFACEPROC)(EGLDisplay dpy, EGLSurface surface);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLDESTROYSYNCPROC)(EGLDisplay dpy, EGLSync sync);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLDESTROYSYNCKHRPROC)(EGLDisplay dpy, EGLSyncKHR sync);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLDESTROYSYNCNVPROC)(EGLSyncNV sync);
typedef EGLint (GLAD_API_PTR *PFNEGLDUPNATIVEFENCEFDANDROIDPROC)(EGLDisplay dpy, EGLSyncKHR sync);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLEXPORTDMABUFIMAGEMESAPROC)(EGLDisplay dpy, EGLImageKHR image, int * fds, EGLint * strides, EGLint * offsets);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLEXPORTDMABUFIMAGEQUERYMESAPROC)(EGLDisplay dpy, EGLImageKHR image, int * fourcc, int * num_planes, EGLuint64KHR * modifiers);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLEXPORTDRMIMAGEMESAPROC)(EGLDisplay dpy, EGLImageKHR image, EGLint * name, EGLint * handle, EGLint * stride);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLEXPORTVKIMAGEANGLEPROC)(EGLDisplay dpy, EGLImage image, void * vk_image, void * vk_image_create_info);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLFENCENVPROC)(EGLSyncNV sync);
typedef void (GLAD_API_PTR *PFNEGLFORCEGPUSWITCHANGLEPROC)(EGLDisplay dpy, EGLint gpuIDHigh, EGLint gpuIDLow);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLGETCOMPOSITORTIMINGANDROIDPROC)(EGLDisplay dpy, EGLSurface surface, EGLint numTimestamps, const EGLint * names, EGLnsecsANDROID * values);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLGETCOMPOSITORTIMINGSUPPORTEDANDROIDPROC)(EGLDisplay dpy, EGLSurface surface, EGLint name);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLGETCONFIGATTRIBPROC)(EGLDisplay dpy, EGLConfig config, EGLint attribute, EGLint * value);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLGETCONFIGSPROC)(EGLDisplay dpy, EGLConfig * configs, EGLint config_size, EGLint * num_config);
typedef EGLContext (GLAD_API_PTR *PFNEGLGETCURRENTCONTEXTPROC)(void);
typedef EGLDisplay (GLAD_API_PTR *PFNEGLGETCURRENTDISPLAYPROC)(void);
typedef EGLSurface (GLAD_API_PTR *PFNEGLGETCURRENTSURFACEPROC)(EGLint readdraw);
typedef EGLDisplay (GLAD_API_PTR *PFNEGLGETDISPLAYPROC)(EGLNativeDisplayType display_id);
typedef char * (GLAD_API_PTR *PFNEGLGETDISPLAYDRIVERCONFIGPROC)(EGLDisplay dpy);
typedef const char * (GLAD_API_PTR *PFNEGLGETDISPLAYDRIVERNAMEPROC)(EGLDisplay dpy);
typedef EGLint (GLAD_API_PTR *PFNEGLGETERRORPROC)(void);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLGETFRAMETIMESTAMPSUPPORTEDANDROIDPROC)(EGLDisplay dpy, EGLSurface surface, EGLint timestamp);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLGETFRAMETIMESTAMPSANDROIDPROC)(EGLDisplay dpy, EGLSurface surface, EGLuint64KHR frameId, EGLint numTimestamps, const EGLint * timestamps, EGLnsecsANDROID * values);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLGETMSCRATEANGLEPROC)(EGLDisplay dpy, EGLSurface surface, EGLint * numerator, EGLint * denominator);
typedef EGLClientBuffer (GLAD_API_PTR *PFNEGLGETNATIVECLIENTBUFFERANDROIDPROC)(const struct AHardwareBuffer * buffer);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLGETNEXTFRAMEIDANDROIDPROC)(EGLDisplay dpy, EGLSurface surface, EGLuint64KHR * frameId);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLGETOUTPUTLAYERSEXTPROC)(EGLDisplay dpy, const EGLAttrib * attrib_list, EGLOutputLayerEXT * layers, EGLint max_layers, EGLint * num_layers);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLGETOUTPUTPORTSEXTPROC)(EGLDisplay dpy, const EGLAttrib * attrib_list, EGLOutputPortEXT * ports, EGLint max_ports, EGLint * num_ports);
typedef EGLDisplay (GLAD_API_PTR *PFNEGLGETPLATFORMDISPLAYPROC)(EGLenum platform, void * native_display, const EGLAttrib * attrib_list);
typedef EGLDisplay (GLAD_API_PTR *PFNEGLGETPLATFORMDISPLAYEXTPROC)(EGLenum platform, void * native_display, const EGLint * attrib_list);
typedef __eglMustCastToProperFunctionPointerType (GLAD_API_PTR *PFNEGLGETPROCADDRESSPROC)(const char * procname);
typedef EGLNativeFileDescriptorKHR (GLAD_API_PTR *PFNEGLGETSTREAMFILEDESCRIPTORKHRPROC)(EGLDisplay dpy, EGLStreamKHR stream);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLGETSYNCATTRIBPROC)(EGLDisplay dpy, EGLSync sync, EGLint attribute, EGLAttrib * value);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLGETSYNCATTRIBKHRPROC)(EGLDisplay dpy, EGLSyncKHR sync, EGLint attribute, EGLint * value);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLGETSYNCATTRIBNVPROC)(EGLSyncNV sync, EGLint attribute, EGLint * value);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLGETSYNCVALUESCHROMIUMPROC)(EGLDisplay dpy, EGLSurface surface, EGLuint64KHR * ust, EGLuint64KHR * msc, EGLuint64KHR * sbc);
typedef EGLuint64NV (GLAD_API_PTR *PFNEGLGETSYSTEMTIMEFREQUENCYNVPROC)(void);
typedef EGLuint64NV (GLAD_API_PTR *PFNEGLGETSYSTEMTIMENVPROC)(void);
typedef void (GLAD_API_PTR *PFNEGLHANDLEGPUSWITCHANGLEPROC)(EGLDisplay dpy);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLINITIALIZEPROC)(EGLDisplay dpy, EGLint * major, EGLint * minor);
typedef EGLint (GLAD_API_PTR *PFNEGLLABELOBJECTKHRPROC)(EGLDisplay display, EGLenum objectType, EGLObjectKHR object, EGLLabelKHR label);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLLOCKSURFACEKHRPROC)(EGLDisplay dpy, EGLSurface surface, const EGLint * attrib_list);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLMAKECURRENTPROC)(EGLDisplay dpy, EGLSurface draw, EGLSurface read, EGLContext ctx);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLOUTPUTLAYERATTRIBEXTPROC)(EGLDisplay dpy, EGLOutputLayerEXT layer, EGLint attribute, EGLAttrib value);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLOUTPUTPORTATTRIBEXTPROC)(EGLDisplay dpy, EGLOutputPortEXT port, EGLint attribute, EGLAttrib value);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLPOSTSUBBUFFERNVPROC)(EGLDisplay dpy, EGLSurface surface, EGLint x, EGLint y, EGLint width, EGLint height);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLPREPARESWAPBUFFERSANGLEPROC)(EGLDisplay dpy, EGLSurface surface);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLPRESENTATIONTIMEANDROIDPROC)(EGLDisplay dpy, EGLSurface surface, EGLnsecsANDROID time);
typedef EGLint (GLAD_API_PTR *PFNEGLPROGRAMCACHEGETATTRIBANGLEPROC)(EGLDisplay dpy, EGLenum attrib);
typedef void (GLAD_API_PTR *PFNEGLPROGRAMCACHEPOPULATEANGLEPROC)(EGLDisplay dpy, const void * key, EGLint keysize, const void * binary, EGLint binarysize);
typedef void (GLAD_API_PTR *PFNEGLPROGRAMCACHEQUERYANGLEPROC)(EGLDisplay dpy, EGLint index, void * key, EGLint * keysize, void * binary, EGLint * binarysize);
typedef EGLint (GLAD_API_PTR *PFNEGLPROGRAMCACHERESIZEANGLEPROC)(EGLDisplay dpy, EGLint limit, EGLint mode);
typedef EGLenum (GLAD_API_PTR *PFNEGLQUERYAPIPROC)(void);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYCONTEXTPROC)(EGLDisplay dpy, EGLContext ctx, EGLint attribute, EGLint * value);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYDEBUGKHRPROC)(EGLint attribute, EGLAttrib * value);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYDEVICEATTRIBEXTPROC)(EGLDeviceEXT device, EGLint attribute, EGLAttrib * value);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYDEVICEBINARYEXTPROC)(EGLDeviceEXT device, EGLint name, EGLint max_size, void * value, EGLint * size);
typedef const char * (GLAD_API_PTR *PFNEGLQUERYDEVICESTRINGEXTPROC)(EGLDeviceEXT device, EGLint name);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYDEVICESEXTPROC)(EGLint max_devices, EGLDeviceEXT * devices, EGLint * num_devices);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYDISPLAYATTRIBANGLEPROC)(EGLDisplay dpy, EGLint attribute, EGLAttrib * value);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYDISPLAYATTRIBEXTPROC)(EGLDisplay dpy, EGLint attribute, EGLAttrib * value);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYDISPLAYATTRIBKHRPROC)(EGLDisplay dpy, EGLint name, EGLAttrib * value);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYDISPLAYATTRIBNVPROC)(EGLDisplay dpy, EGLint attribute, EGLAttrib * value);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYDMABUFFORMATSEXTPROC)(EGLDisplay dpy, EGLint max_formats, EGLint * formats, EGLint * num_formats);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYDMABUFMODIFIERSEXTPROC)(EGLDisplay dpy, EGLint format, EGLint max_modifiers, EGLuint64KHR * modifiers, EGLBoolean * external_only, EGLint * num_modifiers);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYNATIVEDISPLAYNVPROC)(EGLDisplay dpy, EGLNativeDisplayType * display_id);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYNATIVEPIXMAPNVPROC)(EGLDisplay dpy, EGLSurface surf, EGLNativePixmapType * pixmap);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYNATIVEWINDOWNVPROC)(EGLDisplay dpy, EGLSurface surf, EGLNativeWindowType * window);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYOUTPUTLAYERATTRIBEXTPROC)(EGLDisplay dpy, EGLOutputLayerEXT layer, EGLint attribute, EGLAttrib * value);
typedef const char * (GLAD_API_PTR *PFNEGLQUERYOUTPUTLAYERSTRINGEXTPROC)(EGLDisplay dpy, EGLOutputLayerEXT layer, EGLint name);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYOUTPUTPORTATTRIBEXTPROC)(EGLDisplay dpy, EGLOutputPortEXT port, EGLint attribute, EGLAttrib * value);
typedef const char * (GLAD_API_PTR *PFNEGLQUERYOUTPUTPORTSTRINGEXTPROC)(EGLDisplay dpy, EGLOutputPortEXT port, EGLint name);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYSTREAMATTRIBKHRPROC)(EGLDisplay dpy, EGLStreamKHR stream, EGLenum attribute, EGLAttrib * value);
typedef EGLint (GLAD_API_PTR *PFNEGLQUERYSTREAMCONSUMEREVENTNVPROC)(EGLDisplay dpy, EGLStreamKHR stream, EGLTime timeout, EGLenum * event, EGLAttrib * aux);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYSTREAMKHRPROC)(EGLDisplay dpy, EGLStreamKHR stream, EGLenum attribute, EGLint * value);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYSTREAMMETADATANVPROC)(EGLDisplay dpy, EGLStreamKHR stream, EGLenum name, EGLint n, EGLint offset, EGLint size, void * data);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYSTREAMTIMEKHRPROC)(EGLDisplay dpy, EGLStreamKHR stream, EGLenum attribute, EGLTimeKHR * value);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYSTREAMU64KHRPROC)(EGLDisplay dpy, EGLStreamKHR stream, EGLenum attribute, EGLuint64KHR * value);
typedef const char * (GLAD_API_PTR *PFNEGLQUERYSTRINGPROC)(EGLDisplay dpy, EGLint name);
typedef const char * (GLAD_API_PTR *PFNEGLQUERYSTRINGIANGLEPROC)(EGLDisplay dpy, EGLint name, EGLint index);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYSUPPORTEDCOMPRESSIONRATESEXTPROC)(EGLDisplay dpy, EGLConfig config, const EGLAttrib * attrib_list, EGLint * rates, EGLint rate_size, EGLint * num_rates);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYSURFACEPROC)(EGLDisplay dpy, EGLSurface surface, EGLint attribute, EGLint * value);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYSURFACE64KHRPROC)(EGLDisplay dpy, EGLSurface surface, EGLint attribute, EGLAttribKHR * value);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYSURFACEPOINTERANGLEPROC)(EGLDisplay dpy, EGLSurface surface, EGLint attribute, void ** value);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLQUERYWAYLANDBUFFERWLPROC)(EGLDisplay dpy, struct wl_resource * buffer, EGLint attribute, EGLint * value);
typedef void (GLAD_API_PTR *PFNEGLREACQUIREHIGHPOWERGPUANGLEPROC)(EGLDisplay dpy, EGLContext ctx);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLRELEASEDEVICEANGLEPROC)(EGLDeviceEXT device);
typedef void (GLAD_API_PTR *PFNEGLRELEASEEXTERNALCONTEXTANGLEPROC)(EGLDisplay dpy);
typedef void (GLAD_API_PTR *PFNEGLRELEASEHIGHPOWERGPUANGLEPROC)(EGLDisplay dpy, EGLContext ctx);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLRELEASETEXIMAGEPROC)(EGLDisplay dpy, EGLSurface surface, EGLint buffer);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLRELEASETHREADPROC)(void);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLRESETSTREAMNVPROC)(EGLDisplay dpy, EGLStreamKHR stream);
typedef void (GLAD_API_PTR *PFNEGLSETBLOBCACHEFUNCSANDROIDPROC)(EGLDisplay dpy, EGLSetBlobFuncANDROID set, EGLGetBlobFuncANDROID get);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSETDAMAGEREGIONKHRPROC)(EGLDisplay dpy, EGLSurface surface, EGLint * rects, EGLint n_rects);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSETSTREAMATTRIBKHRPROC)(EGLDisplay dpy, EGLStreamKHR stream, EGLenum attribute, EGLAttrib value);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSETSTREAMMETADATANVPROC)(EGLDisplay dpy, EGLStreamKHR stream, EGLint n, EGLint offset, EGLint size, const void * data);
typedef void (GLAD_API_PTR *PFNEGLSETVALIDATIONENABLEDANGLEPROC)(EGLBoolean validationState);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSIGNALSYNCKHRPROC)(EGLDisplay dpy, EGLSyncKHR sync, EGLenum mode);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSIGNALSYNCNVPROC)(EGLSyncNV sync, EGLenum mode);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSTREAMACQUIREIMAGENVPROC)(EGLDisplay dpy, EGLStreamKHR stream, EGLImage * pImage, EGLSync sync);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSTREAMATTRIBKHRPROC)(EGLDisplay dpy, EGLStreamKHR stream, EGLenum attribute, EGLint value);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSTREAMCONSUMERACQUIREATTRIBKHRPROC)(EGLDisplay dpy, EGLStreamKHR stream, const EGLAttrib * attrib_list);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSTREAMCONSUMERACQUIREKHRPROC)(EGLDisplay dpy, EGLStreamKHR stream);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSTREAMCONSUMERGLTEXTUREEXTERNALATTRIBSNVPROC)(EGLDisplay dpy, EGLStreamKHR stream, const EGLAttrib * attrib_list);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSTREAMCONSUMERGLTEXTUREEXTERNALKHRPROC)(EGLDisplay dpy, EGLStreamKHR stream);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSTREAMCONSUMEROUTPUTEXTPROC)(EGLDisplay dpy, EGLStreamKHR stream, EGLOutputLayerEXT layer);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSTREAMCONSUMERRELEASEATTRIBKHRPROC)(EGLDisplay dpy, EGLStreamKHR stream, const EGLAttrib * attrib_list);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSTREAMCONSUMERRELEASEKHRPROC)(EGLDisplay dpy, EGLStreamKHR stream);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSTREAMFLUSHNVPROC)(EGLDisplay dpy, EGLStreamKHR stream);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSTREAMIMAGECONSUMERCONNECTNVPROC)(EGLDisplay dpy, EGLStreamKHR stream, EGLint num_modifiers, const EGLuint64KHR * modifiers, const EGLAttrib * attrib_list);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSTREAMPOSTD3DTEXTUREANGLEPROC)(EGLDisplay dpy, EGLStreamKHR stream, void * texture, const EGLAttrib * attrib_list);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSTREAMRELEASEIMAGENVPROC)(EGLDisplay dpy, EGLStreamKHR stream, EGLImage image, EGLSync sync);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSURFACEATTRIBPROC)(EGLDisplay dpy, EGLSurface surface, EGLint attribute, EGLint value);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSWAPBUFFERSPROC)(EGLDisplay dpy, EGLSurface surface);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSWAPBUFFERSREGION2NOKPROC)(EGLDisplay dpy, EGLSurface surface, EGLint numRects, const EGLint * rects);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSWAPBUFFERSREGIONNOKPROC)(EGLDisplay dpy, EGLSurface surface, EGLint numRects, const EGLint * rects);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSWAPBUFFERSWITHDAMAGEEXTPROC)(EGLDisplay dpy, EGLSurface surface, const EGLint * rects, EGLint n_rects);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSWAPBUFFERSWITHDAMAGEKHRPROC)(EGLDisplay dpy, EGLSurface surface, const EGLint * rects, EGLint n_rects);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSWAPBUFFERSWITHFRAMETOKENANGLEPROC)(EGLDisplay dpy, EGLSurface surface, EGLFrameTokenANGLE frametoken);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLSWAPINTERVALPROC)(EGLDisplay dpy, EGLint interval);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLTERMINATEPROC)(EGLDisplay dpy);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLUNBINDWAYLANDDISPLAYWLPROC)(EGLDisplay dpy, struct wl_display * display);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLUNLOCKSURFACEKHRPROC)(EGLDisplay dpy, EGLSurface surface);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLUNSIGNALSYNCEXTPROC)(EGLDisplay dpy, EGLSync sync, const EGLAttrib * attrib_list);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLWAITCLIENTPROC)(void);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLWAITGLPROC)(void);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLWAITNATIVEPROC)(EGLint engine);
typedef EGLBoolean (GLAD_API_PTR *PFNEGLWAITSYNCPROC)(EGLDisplay dpy, EGLSync sync, EGLint flags);
typedef EGLint (GLAD_API_PTR *PFNEGLWAITSYNCKHRPROC)(EGLDisplay dpy, EGLSyncKHR sync, EGLint flags);
typedef void (GLAD_API_PTR *PFNEGLWAITUNTILWORKSCHEDULEDANGLEPROC)(EGLDisplay dpy);

typedef struct GladEGLContext {
    void* userptr;

    unsigned char VERSION_1_0;
    unsigned char VERSION_1_1;
    unsigned char VERSION_1_2;
    unsigned char VERSION_1_3;
    unsigned char VERSION_1_4;
    unsigned char VERSION_1_5;

    union {
        unsigned char extArray[224];
        struct {
        /*    0 */ unsigned char ANDROID_GLES_layers;
        /*    1 */ unsigned char ANDROID_blob_cache;
        /*    2 */ unsigned char ANDROID_create_native_client_buffer;
        /*    3 */ unsigned char ANDROID_framebuffer_target;
        /*    4 */ unsigned char ANDROID_front_buffer_auto_refresh;
        /*    5 */ unsigned char ANDROID_get_frame_timestamps;
        /*    6 */ unsigned char ANDROID_get_native_client_buffer;
        /*    7 */ unsigned char ANDROID_image_native_buffer;
        /*    8 */ unsigned char ANDROID_native_fence_sync;
        /*    9 */ unsigned char ANDROID_presentation_time;
        /*   10 */ unsigned char ANDROID_recordable;
        /*   11 */ unsigned char ANDROID_telemetry_hint;
        /*   12 */ unsigned char ANGLE_colorspace_attribute_passthrough;
        /*   13 */ unsigned char ANGLE_context_virtualization;
        /*   14 */ unsigned char ANGLE_create_context_backwards_compatible;
        /*   15 */ unsigned char ANGLE_create_context_client_arrays;
        /*   16 */ unsigned char ANGLE_create_context_extensions_enabled;
        /*   17 */ unsigned char ANGLE_create_context_webgl_compatibility;
        /*   18 */ unsigned char ANGLE_create_surface_swap_interval;
        /*   19 */ unsigned char ANGLE_d3d_share_handle_client_buffer;
        /*   20 */ unsigned char ANGLE_d3d_texture_client_buffer;
        /*   21 */ unsigned char ANGLE_device_cgl;
        /*   22 */ unsigned char ANGLE_device_creation;
        /*   23 */ unsigned char ANGLE_device_d3d;
        /*   24 */ unsigned char ANGLE_device_d3d11;
        /*   25 */ unsigned char ANGLE_device_d3d9;
        /*   26 */ unsigned char ANGLE_device_eagl;
        /*   27 */ unsigned char ANGLE_device_metal;
        /*   28 */ unsigned char ANGLE_device_vulkan;
        /*   29 */ unsigned char ANGLE_direct_composition;
        /*   30 */ unsigned char ANGLE_display_power_preference;
        /*   31 */ unsigned char ANGLE_display_semaphore_share_group;
        /*   32 */ unsigned char ANGLE_display_texture_share_group;
        /*   33 */ unsigned char ANGLE_experimental_present_path;
        /*   34 */ unsigned char ANGLE_external_context_and_surface;
        /*   35 */ unsigned char ANGLE_feature_control;
        /*   36 */ unsigned char ANGLE_ggp_stream_descriptor;
        /*   37 */ unsigned char ANGLE_global_fence_sync;
        /*   38 */ unsigned char ANGLE_iosurface_client_buffer;
        /*   39 */ unsigned char ANGLE_keyed_mutex;
        /*   40 */ unsigned char ANGLE_memory_usage_report;
        /*   41 */ unsigned char ANGLE_metal_create_context_ownership_identity;
        /*   42 */ unsigned char ANGLE_metal_shared_event_sync;
        /*   43 */ unsigned char ANGLE_metal_texture_client_buffer;
        /*   44 */ unsigned char ANGLE_no_error;
        /*   45 */ unsigned char ANGLE_platform_angle;
        /*   46 */ unsigned char ANGLE_platform_angle_d3d;
        /*   47 */ unsigned char ANGLE_platform_angle_d3d11on12;
        /*   48 */ unsigned char ANGLE_platform_angle_d3d_luid;
        /*   49 */ unsigned char ANGLE_platform_angle_device_context_volatile_cgl;
        /*   50 */ unsigned char ANGLE_platform_angle_device_context_volatile_eagl;
        /*   51 */ unsigned char ANGLE_platform_angle_device_id;
        /*   52 */ unsigned char ANGLE_platform_angle_device_type_egl;
        /*   53 */ unsigned char ANGLE_platform_angle_device_type_swiftshader;
        /*   54 */ unsigned char ANGLE_platform_angle_metal;
        /*   55 */ unsigned char ANGLE_platform_angle_null;
        /*   56 */ unsigned char ANGLE_platform_angle_opengl;
        /*   57 */ unsigned char ANGLE_platform_angle_vulkan;
        /*   58 */ unsigned char ANGLE_platform_angle_vulkan_device_uuid;
        /*   59 */ unsigned char ANGLE_platform_angle_webgpu;
        /*   60 */ unsigned char ANGLE_power_preference;
        /*   61 */ unsigned char ANGLE_prepare_swap_buffers;
        /*   62 */ unsigned char ANGLE_program_cache_control;
        /*   63 */ unsigned char ANGLE_query_surface_pointer;
        /*   64 */ unsigned char ANGLE_robust_resource_initialization;
        /*   65 */ unsigned char ANGLE_stream_producer_d3d_texture;
        /*   66 */ unsigned char ANGLE_surface_d3d_texture_2d_share_handle;
        /*   67 */ unsigned char ANGLE_surface_orientation;
        /*   68 */ unsigned char ANGLE_swap_with_frame_token;
        /*   69 */ unsigned char ANGLE_sync_control_rate;
        /*   70 */ unsigned char ANGLE_vulkan_display;
        /*   71 */ unsigned char ANGLE_vulkan_image;
        /*   72 */ unsigned char ANGLE_wait_until_work_scheduled;
        /*   73 */ unsigned char ANGLE_window_fixed_size;
        /*   74 */ unsigned char ANGLE_x11_visual;
        /*   75 */ unsigned char ARM_image_format;
        /*   76 */ unsigned char ARM_implicit_external_sync;
        /*   77 */ unsigned char ARM_pixmap_multisample_discard;
        /*   78 */ unsigned char CHROMIUM_sync_control;
        /*   79 */ unsigned char EXT_bind_to_front;
        /*   80 */ unsigned char EXT_buffer_age;
        /*   81 */ unsigned char EXT_client_extensions;
        /*   82 */ unsigned char EXT_client_sync;
        /*   83 */ unsigned char EXT_compositor;
        /*   84 */ unsigned char EXT_config_select_group;
        /*   85 */ unsigned char EXT_create_context_robustness;
        /*   86 */ unsigned char EXT_device_base;
        /*   87 */ unsigned char EXT_device_drm;
        /*   88 */ unsigned char EXT_device_drm_render_node;
        /*   89 */ unsigned char EXT_device_enumeration;
        /*   90 */ unsigned char EXT_device_openwf;
        /*   91 */ unsigned char EXT_device_persistent_id;
        /*   92 */ unsigned char EXT_device_query;
        /*   93 */ unsigned char EXT_device_query_name;
        /*   94 */ unsigned char EXT_display_alloc;
        /*   95 */ unsigned char EXT_explicit_device;
        /*   96 */ unsigned char EXT_gl_colorspace_bt2020_hlg;
        /*   97 */ unsigned char EXT_gl_colorspace_bt2020_linear;
        /*   98 */ unsigned char EXT_gl_colorspace_bt2020_pq;
        /*   99 */ unsigned char EXT_gl_colorspace_display_p3;
        /*  100 */ unsigned char EXT_gl_colorspace_display_p3_linear;
        /*  101 */ unsigned char EXT_gl_colorspace_display_p3_passthrough;
        /*  102 */ unsigned char EXT_gl_colorspace_scrgb;
        /*  103 */ unsigned char EXT_gl_colorspace_scrgb_linear;
        /*  104 */ unsigned char EXT_image_dma_buf_import;
        /*  105 */ unsigned char EXT_image_dma_buf_import_modifiers;
        /*  106 */ unsigned char EXT_image_gl_colorspace;
        /*  107 */ unsigned char EXT_image_implicit_sync_control;
        /*  108 */ unsigned char EXT_multiview_window;
        /*  109 */ unsigned char EXT_output_base;
        /*  110 */ unsigned char EXT_output_drm;
        /*  111 */ unsigned char EXT_output_openwf;
        /*  112 */ unsigned char EXT_pixel_format_float;
        /*  113 */ unsigned char EXT_platform_base;
        /*  114 */ unsigned char EXT_platform_device;
        /*  115 */ unsigned char EXT_platform_wayland;
        /*  116 */ unsigned char EXT_platform_x11;
        /*  117 */ unsigned char EXT_platform_xcb;
        /*  118 */ unsigned char EXT_present_opaque;
        /*  119 */ unsigned char EXT_protected_content;
        /*  120 */ unsigned char EXT_protected_surface;
        /*  121 */ unsigned char EXT_query_reset_notification_strategy;
        /*  122 */ unsigned char EXT_stream_consumer_egloutput;
        /*  123 */ unsigned char EXT_surface_CTA861_3_metadata;
        /*  124 */ unsigned char EXT_surface_SMPTE2086_metadata;
        /*  125 */ unsigned char EXT_surface_compression;
        /*  126 */ unsigned char EXT_swap_buffers_with_damage;
        /*  127 */ unsigned char EXT_sync_reuse;
        /*  128 */ unsigned char EXT_yuv_surface;
        /*  129 */ unsigned char HI_clientpixmap;
        /*  130 */ unsigned char HI_colorformats;
        /*  131 */ unsigned char IMG_context_priority;
        /*  132 */ unsigned char IMG_image_plane_attribs;
        /*  133 */ unsigned char KHR_cl_event;
        /*  134 */ unsigned char KHR_cl_event2;
        /*  135 */ unsigned char KHR_client_get_all_proc_addresses;
        /*  136 */ unsigned char KHR_config_attribs;
        /*  137 */ unsigned char KHR_context_flush_control;
        /*  138 */ unsigned char KHR_create_context;
        /*  139 */ unsigned char KHR_create_context_no_error;
        /*  140 */ unsigned char KHR_debug;
        /*  141 */ unsigned char KHR_display_reference;
        /*  142 */ unsigned char KHR_fence_sync;
        /*  143 */ unsigned char KHR_get_all_proc_addresses;
        /*  144 */ unsigned char KHR_gl_colorspace;
        /*  145 */ unsigned char KHR_gl_renderbuffer_image;
        /*  146 */ unsigned char KHR_gl_texture_2D_image;
        /*  147 */ unsigned char KHR_gl_texture_3D_image;
        /*  148 */ unsigned char KHR_gl_texture_cubemap_image;
        /*  149 */ unsigned char KHR_image;
        /*  150 */ unsigned char KHR_image_base;
        /*  151 */ unsigned char KHR_image_pixmap;
        /*  152 */ unsigned char KHR_lock_surface;
        /*  153 */ unsigned char KHR_lock_surface2;
        /*  154 */ unsigned char KHR_lock_surface3;
        /*  155 */ unsigned char KHR_mutable_render_buffer;
        /*  156 */ unsigned char KHR_no_config_context;
        /*  157 */ unsigned char KHR_partial_update;
        /*  158 */ unsigned char KHR_platform_android;
        /*  159 */ unsigned char KHR_platform_gbm;
        /*  160 */ unsigned char KHR_platform_wayland;
        /*  161 */ unsigned char KHR_platform_x11;
        /*  162 */ unsigned char KHR_reusable_sync;
        /*  163 */ unsigned char KHR_stream;
        /*  164 */ unsigned char KHR_stream_attrib;
        /*  165 */ unsigned char KHR_stream_consumer_gltexture;
        /*  166 */ unsigned char KHR_stream_cross_process_fd;
        /*  167 */ unsigned char KHR_stream_fifo;
        /*  168 */ unsigned char KHR_stream_producer_aldatalocator;
        /*  169 */ unsigned char KHR_stream_producer_eglsurface;
        /*  170 */ unsigned char KHR_surfaceless_context;
        /*  171 */ unsigned char KHR_swap_buffers_with_damage;
        /*  172 */ unsigned char KHR_vg_parent_image;
        /*  173 */ unsigned char KHR_wait_sync;
        /*  174 */ unsigned char MESA_drm_image;
        /*  175 */ unsigned char MESA_image_dma_buf_export;
        /*  176 */ unsigned char MESA_platform_gbm;
        /*  177 */ unsigned char MESA_platform_surfaceless;
        /*  178 */ unsigned char MESA_query_driver;
        /*  179 */ unsigned char NOK_swap_region;
        /*  180 */ unsigned char NOK_swap_region2;
        /*  181 */ unsigned char NOK_texture_from_pixmap;
        /*  182 */ unsigned char NV_3dvision_surface;
        /*  183 */ unsigned char NV_context_priority_realtime;
        /*  184 */ unsigned char NV_coverage_sample;
        /*  185 */ unsigned char NV_coverage_sample_resolve;
        /*  186 */ unsigned char NV_cuda_event;
        /*  187 */ unsigned char NV_depth_nonlinear;
        /*  188 */ unsigned char NV_device_cuda;
        /*  189 */ unsigned char NV_native_query;
        /*  190 */ unsigned char NV_post_convert_rounding;
        /*  191 */ unsigned char NV_post_sub_buffer;
        /*  192 */ unsigned char NV_quadruple_buffer;
        /*  193 */ unsigned char NV_robustness_video_memory_purge;
        /*  194 */ unsigned char NV_stream_consumer_eglimage;
        /*  195 */ unsigned char NV_stream_consumer_eglimage_use_scanout_attrib;
        /*  196 */ unsigned char NV_stream_consumer_gltexture_yuv;
        /*  197 */ unsigned char NV_stream_cross_display;
        /*  198 */ unsigned char NV_stream_cross_object;
        /*  199 */ unsigned char NV_stream_cross_partition;
        /*  200 */ unsigned char NV_stream_cross_process;
        /*  201 */ unsigned char NV_stream_cross_system;
        /*  202 */ unsigned char NV_stream_dma;
        /*  203 */ unsigned char NV_stream_fifo_next;
        /*  204 */ unsigned char NV_stream_fifo_synchronous;
        /*  205 */ unsigned char NV_stream_flush;
        /*  206 */ unsigned char NV_stream_frame_limits;
        /*  207 */ unsigned char NV_stream_metadata;
        /*  208 */ unsigned char NV_stream_origin;
        /*  209 */ unsigned char NV_stream_remote;
        /*  210 */ unsigned char NV_stream_reset;
        /*  211 */ unsigned char NV_stream_socket;
        /*  212 */ unsigned char NV_stream_socket_inet;
        /*  213 */ unsigned char NV_stream_socket_unix;
        /*  214 */ unsigned char NV_stream_sync;
        /*  215 */ unsigned char NV_sync;
        /*  216 */ unsigned char NV_system_time;
        /*  217 */ unsigned char NV_triple_buffer;
        /*  218 */ unsigned char QNX_image_native_buffer;
        /*  219 */ unsigned char QNX_platform_screen;
        /*  220 */ unsigned char TIZEN_image_native_buffer;
        /*  221 */ unsigned char TIZEN_image_native_surface;
        /*  222 */ unsigned char WL_bind_wayland_display;
        /*  223 */ unsigned char WL_create_wayland_buffer_from_image;
        };
    };

    union {
        void *pfnArray[181];
        struct {
        /*    0 */ PFNEGLACQUIREEXTERNALCONTEXTANGLEPROC AcquireExternalContextANGLE;
        /*    1 */ PFNEGLBINDAPIPROC BindAPI;
        /*    2 */ PFNEGLBINDTEXIMAGEPROC BindTexImage;
        /*    3 */ PFNEGLBINDWAYLANDDISPLAYWLPROC BindWaylandDisplayWL;
        /*    4 */ PFNEGLCHOOSECONFIGPROC ChooseConfig;
        /*    5 */ PFNEGLCLIENTSIGNALSYNCEXTPROC ClientSignalSyncEXT;
        /*    6 */ PFNEGLCLIENTWAITSYNCPROC ClientWaitSync;
        /*    7 */ PFNEGLCLIENTWAITSYNCKHRPROC ClientWaitSyncKHR;
        /*    8 */ PFNEGLCLIENTWAITSYNCNVPROC ClientWaitSyncNV;
        /*    9 */ PFNEGLCOMPOSITORBINDTEXWINDOWEXTPROC CompositorBindTexWindowEXT;
        /*   10 */ PFNEGLCOMPOSITORSETCONTEXTATTRIBUTESEXTPROC CompositorSetContextAttributesEXT;
        /*   11 */ PFNEGLCOMPOSITORSETCONTEXTLISTEXTPROC CompositorSetContextListEXT;
        /*   12 */ PFNEGLCOMPOSITORSETSIZEEXTPROC CompositorSetSizeEXT;
        /*   13 */ PFNEGLCOMPOSITORSETWINDOWATTRIBUTESEXTPROC CompositorSetWindowAttributesEXT;
        /*   14 */ PFNEGLCOMPOSITORSETWINDOWLISTEXTPROC CompositorSetWindowListEXT;
        /*   15 */ PFNEGLCOMPOSITORSWAPPOLICYEXTPROC CompositorSwapPolicyEXT;
        /*   16 */ PFNEGLCOPYBUFFERSPROC CopyBuffers;
        /*   17 */ PFNEGLCOPYMETALSHAREDEVENTANGLEPROC CopyMetalSharedEventANGLE;
        /*   18 */ PFNEGLCREATECONTEXTPROC CreateContext;
        /*   19 */ PFNEGLCREATEDRMIMAGEMESAPROC CreateDRMImageMESA;
        /*   20 */ PFNEGLCREATEDEVICEANGLEPROC CreateDeviceANGLE;
        /*   21 */ PFNEGLCREATEFENCESYNCNVPROC CreateFenceSyncNV;
        /*   22 */ PFNEGLCREATEIMAGEPROC CreateImage;
        /*   23 */ PFNEGLCREATEIMAGEKHRPROC CreateImageKHR;
        /*   24 */ PFNEGLCREATENATIVECLIENTBUFFERANDROIDPROC CreateNativeClientBufferANDROID;
        /*   25 */ PFNEGLCREATEPBUFFERFROMCLIENTBUFFERPROC CreatePbufferFromClientBuffer;
        /*   26 */ PFNEGLCREATEPBUFFERSURFACEPROC CreatePbufferSurface;
        /*   27 */ PFNEGLCREATEPIXMAPSURFACEPROC CreatePixmapSurface;
        /*   28 */ PFNEGLCREATEPIXMAPSURFACEHIPROC CreatePixmapSurfaceHI;
        /*   29 */ PFNEGLCREATEPLATFORMPIXMAPSURFACEPROC CreatePlatformPixmapSurface;
        /*   30 */ PFNEGLCREATEPLATFORMPIXMAPSURFACEEXTPROC CreatePlatformPixmapSurfaceEXT;
        /*   31 */ PFNEGLCREATEPLATFORMWINDOWSURFACEPROC CreatePlatformWindowSurface;
        /*   32 */ PFNEGLCREATEPLATFORMWINDOWSURFACEEXTPROC CreatePlatformWindowSurfaceEXT;
        /*   33 */ PFNEGLCREATESTREAMATTRIBKHRPROC CreateStreamAttribKHR;
        /*   34 */ PFNEGLCREATESTREAMFROMFILEDESCRIPTORKHRPROC CreateStreamFromFileDescriptorKHR;
        /*   35 */ PFNEGLCREATESTREAMKHRPROC CreateStreamKHR;
        /*   36 */ PFNEGLCREATESTREAMPRODUCERD3DTEXTUREANGLEPROC CreateStreamProducerD3DTextureANGLE;
        /*   37 */ PFNEGLCREATESTREAMPRODUCERSURFACEKHRPROC CreateStreamProducerSurfaceKHR;
        /*   38 */ PFNEGLCREATESTREAMSYNCNVPROC CreateStreamSyncNV;
        /*   39 */ PFNEGLCREATESYNCPROC CreateSync;
        /*   40 */ PFNEGLCREATESYNC64KHRPROC CreateSync64KHR;
        /*   41 */ PFNEGLCREATESYNCKHRPROC CreateSyncKHR;
        /*   42 */ PFNEGLCREATEWAYLANDBUFFERFROMIMAGEWLPROC CreateWaylandBufferFromImageWL;
        /*   43 */ PFNEGLCREATEWINDOWSURFACEPROC CreateWindowSurface;
        /*   44 */ PFNEGLDEBUGMESSAGECONTROLKHRPROC DebugMessageControlKHR;
        /*   45 */ PFNEGLDESTROYCONTEXTPROC DestroyContext;
        /*   46 */ PFNEGLDESTROYDISPLAYEXTPROC DestroyDisplayEXT;
        /*   47 */ PFNEGLDESTROYIMAGEPROC DestroyImage;
        /*   48 */ PFNEGLDESTROYIMAGEKHRPROC DestroyImageKHR;
        /*   49 */ PFNEGLDESTROYSTREAMKHRPROC DestroyStreamKHR;
        /*   50 */ PFNEGLDESTROYSURFACEPROC DestroySurface;
        /*   51 */ PFNEGLDESTROYSYNCPROC DestroySync;
        /*   52 */ PFNEGLDESTROYSYNCKHRPROC DestroySyncKHR;
        /*   53 */ PFNEGLDESTROYSYNCNVPROC DestroySyncNV;
        /*   54 */ PFNEGLDUPNATIVEFENCEFDANDROIDPROC DupNativeFenceFDANDROID;
        /*   55 */ PFNEGLEXPORTDMABUFIMAGEMESAPROC ExportDMABUFImageMESA;
        /*   56 */ PFNEGLEXPORTDMABUFIMAGEQUERYMESAPROC ExportDMABUFImageQueryMESA;
        /*   57 */ PFNEGLEXPORTDRMIMAGEMESAPROC ExportDRMImageMESA;
        /*   58 */ PFNEGLEXPORTVKIMAGEANGLEPROC ExportVkImageANGLE;
        /*   59 */ PFNEGLFENCENVPROC FenceNV;
        /*   60 */ PFNEGLFORCEGPUSWITCHANGLEPROC ForceGPUSwitchANGLE;
        /*   61 */ PFNEGLGETCOMPOSITORTIMINGANDROIDPROC GetCompositorTimingANDROID;
        /*   62 */ PFNEGLGETCOMPOSITORTIMINGSUPPORTEDANDROIDPROC GetCompositorTimingSupportedANDROID;
        /*   63 */ PFNEGLGETCONFIGATTRIBPROC GetConfigAttrib;
        /*   64 */ PFNEGLGETCONFIGSPROC GetConfigs;
        /*   65 */ PFNEGLGETCURRENTCONTEXTPROC GetCurrentContext;
        /*   66 */ PFNEGLGETCURRENTDISPLAYPROC GetCurrentDisplay;
        /*   67 */ PFNEGLGETCURRENTSURFACEPROC GetCurrentSurface;
        /*   68 */ PFNEGLGETDISPLAYPROC GetDisplay;
        /*   69 */ PFNEGLGETDISPLAYDRIVERCONFIGPROC GetDisplayDriverConfig;
        /*   70 */ PFNEGLGETDISPLAYDRIVERNAMEPROC GetDisplayDriverName;
        /*   71 */ PFNEGLGETERRORPROC GetError;
        /*   72 */ PFNEGLGETFRAMETIMESTAMPSUPPORTEDANDROIDPROC GetFrameTimestampSupportedANDROID;
        /*   73 */ PFNEGLGETFRAMETIMESTAMPSANDROIDPROC GetFrameTimestampsANDROID;
        /*   74 */ PFNEGLGETMSCRATEANGLEPROC GetMscRateANGLE;
        /*   75 */ PFNEGLGETNATIVECLIENTBUFFERANDROIDPROC GetNativeClientBufferANDROID;
        /*   76 */ PFNEGLGETNEXTFRAMEIDANDROIDPROC GetNextFrameIdANDROID;
        /*   77 */ PFNEGLGETOUTPUTLAYERSEXTPROC GetOutputLayersEXT;
        /*   78 */ PFNEGLGETOUTPUTPORTSEXTPROC GetOutputPortsEXT;
        /*   79 */ PFNEGLGETPLATFORMDISPLAYPROC GetPlatformDisplay;
        /*   80 */ PFNEGLGETPLATFORMDISPLAYEXTPROC GetPlatformDisplayEXT;
        /*   81 */ PFNEGLGETPROCADDRESSPROC GetProcAddress;
        /*   82 */ PFNEGLGETSTREAMFILEDESCRIPTORKHRPROC GetStreamFileDescriptorKHR;
        /*   83 */ PFNEGLGETSYNCATTRIBPROC GetSyncAttrib;
        /*   84 */ PFNEGLGETSYNCATTRIBKHRPROC GetSyncAttribKHR;
        /*   85 */ PFNEGLGETSYNCATTRIBNVPROC GetSyncAttribNV;
        /*   86 */ PFNEGLGETSYNCVALUESCHROMIUMPROC GetSyncValuesCHROMIUM;
        /*   87 */ PFNEGLGETSYSTEMTIMEFREQUENCYNVPROC GetSystemTimeFrequencyNV;
        /*   88 */ PFNEGLGETSYSTEMTIMENVPROC GetSystemTimeNV;
        /*   89 */ PFNEGLHANDLEGPUSWITCHANGLEPROC HandleGPUSwitchANGLE;
        /*   90 */ PFNEGLINITIALIZEPROC Initialize;
        /*   91 */ PFNEGLLABELOBJECTKHRPROC LabelObjectKHR;
        /*   92 */ PFNEGLLOCKSURFACEKHRPROC LockSurfaceKHR;
        /*   93 */ PFNEGLMAKECURRENTPROC MakeCurrent;
        /*   94 */ PFNEGLOUTPUTLAYERATTRIBEXTPROC OutputLayerAttribEXT;
        /*   95 */ PFNEGLOUTPUTPORTATTRIBEXTPROC OutputPortAttribEXT;
        /*   96 */ PFNEGLPOSTSUBBUFFERNVPROC PostSubBufferNV;
        /*   97 */ PFNEGLPREPARESWAPBUFFERSANGLEPROC PrepareSwapBuffersANGLE;
        /*   98 */ PFNEGLPRESENTATIONTIMEANDROIDPROC PresentationTimeANDROID;
        /*   99 */ PFNEGLPROGRAMCACHEGETATTRIBANGLEPROC ProgramCacheGetAttribANGLE;
        /*  100 */ PFNEGLPROGRAMCACHEPOPULATEANGLEPROC ProgramCachePopulateANGLE;
        /*  101 */ PFNEGLPROGRAMCACHEQUERYANGLEPROC ProgramCacheQueryANGLE;
        /*  102 */ PFNEGLPROGRAMCACHERESIZEANGLEPROC ProgramCacheResizeANGLE;
        /*  103 */ PFNEGLQUERYAPIPROC QueryAPI;
        /*  104 */ PFNEGLQUERYCONTEXTPROC QueryContext;
        /*  105 */ PFNEGLQUERYDEBUGKHRPROC QueryDebugKHR;
        /*  106 */ PFNEGLQUERYDEVICEATTRIBEXTPROC QueryDeviceAttribEXT;
        /*  107 */ PFNEGLQUERYDEVICEBINARYEXTPROC QueryDeviceBinaryEXT;
        /*  108 */ PFNEGLQUERYDEVICESTRINGEXTPROC QueryDeviceStringEXT;
        /*  109 */ PFNEGLQUERYDEVICESEXTPROC QueryDevicesEXT;
        /*  110 */ PFNEGLQUERYDISPLAYATTRIBANGLEPROC QueryDisplayAttribANGLE;
        /*  111 */ PFNEGLQUERYDISPLAYATTRIBEXTPROC QueryDisplayAttribEXT;
        /*  112 */ PFNEGLQUERYDISPLAYATTRIBKHRPROC QueryDisplayAttribKHR;
        /*  113 */ PFNEGLQUERYDISPLAYATTRIBNVPROC QueryDisplayAttribNV;
        /*  114 */ PFNEGLQUERYDMABUFFORMATSEXTPROC QueryDmaBufFormatsEXT;
        /*  115 */ PFNEGLQUERYDMABUFMODIFIERSEXTPROC QueryDmaBufModifiersEXT;
        /*  116 */ PFNEGLQUERYNATIVEDISPLAYNVPROC QueryNativeDisplayNV;
        /*  117 */ PFNEGLQUERYNATIVEPIXMAPNVPROC QueryNativePixmapNV;
        /*  118 */ PFNEGLQUERYNATIVEWINDOWNVPROC QueryNativeWindowNV;
        /*  119 */ PFNEGLQUERYOUTPUTLAYERATTRIBEXTPROC QueryOutputLayerAttribEXT;
        /*  120 */ PFNEGLQUERYOUTPUTLAYERSTRINGEXTPROC QueryOutputLayerStringEXT;
        /*  121 */ PFNEGLQUERYOUTPUTPORTATTRIBEXTPROC QueryOutputPortAttribEXT;
        /*  122 */ PFNEGLQUERYOUTPUTPORTSTRINGEXTPROC QueryOutputPortStringEXT;
        /*  123 */ PFNEGLQUERYSTREAMATTRIBKHRPROC QueryStreamAttribKHR;
        /*  124 */ PFNEGLQUERYSTREAMCONSUMEREVENTNVPROC QueryStreamConsumerEventNV;
        /*  125 */ PFNEGLQUERYSTREAMKHRPROC QueryStreamKHR;
        /*  126 */ PFNEGLQUERYSTREAMMETADATANVPROC QueryStreamMetadataNV;
        /*  127 */ PFNEGLQUERYSTREAMTIMEKHRPROC QueryStreamTimeKHR;
        /*  128 */ PFNEGLQUERYSTREAMU64KHRPROC QueryStreamu64KHR;
        /*  129 */ PFNEGLQUERYSTRINGPROC QueryString;
        /*  130 */ PFNEGLQUERYSTRINGIANGLEPROC QueryStringiANGLE;
        /*  131 */ PFNEGLQUERYSUPPORTEDCOMPRESSIONRATESEXTPROC QuerySupportedCompressionRatesEXT;
        /*  132 */ PFNEGLQUERYSURFACEPROC QuerySurface;
        /*  133 */ PFNEGLQUERYSURFACE64KHRPROC QuerySurface64KHR;
        /*  134 */ PFNEGLQUERYSURFACEPOINTERANGLEPROC QuerySurfacePointerANGLE;
        /*  135 */ PFNEGLQUERYWAYLANDBUFFERWLPROC QueryWaylandBufferWL;
        /*  136 */ PFNEGLREACQUIREHIGHPOWERGPUANGLEPROC ReacquireHighPowerGPUANGLE;
        /*  137 */ PFNEGLRELEASEDEVICEANGLEPROC ReleaseDeviceANGLE;
        /*  138 */ PFNEGLRELEASEEXTERNALCONTEXTANGLEPROC ReleaseExternalContextANGLE;
        /*  139 */ PFNEGLRELEASEHIGHPOWERGPUANGLEPROC ReleaseHighPowerGPUANGLE;
        /*  140 */ PFNEGLRELEASETEXIMAGEPROC ReleaseTexImage;
        /*  141 */ PFNEGLRELEASETHREADPROC ReleaseThread;
        /*  142 */ PFNEGLRESETSTREAMNVPROC ResetStreamNV;
        /*  143 */ PFNEGLSETBLOBCACHEFUNCSANDROIDPROC SetBlobCacheFuncsANDROID;
        /*  144 */ PFNEGLSETDAMAGEREGIONKHRPROC SetDamageRegionKHR;
        /*  145 */ PFNEGLSETSTREAMATTRIBKHRPROC SetStreamAttribKHR;
        /*  146 */ PFNEGLSETSTREAMMETADATANVPROC SetStreamMetadataNV;
        /*  147 */ PFNEGLSETVALIDATIONENABLEDANGLEPROC SetValidationEnabledANGLE;
        /*  148 */ PFNEGLSIGNALSYNCKHRPROC SignalSyncKHR;
        /*  149 */ PFNEGLSIGNALSYNCNVPROC SignalSyncNV;
        /*  150 */ PFNEGLSTREAMACQUIREIMAGENVPROC StreamAcquireImageNV;
        /*  151 */ PFNEGLSTREAMATTRIBKHRPROC StreamAttribKHR;
        /*  152 */ PFNEGLSTREAMCONSUMERACQUIREATTRIBKHRPROC StreamConsumerAcquireAttribKHR;
        /*  153 */ PFNEGLSTREAMCONSUMERACQUIREKHRPROC StreamConsumerAcquireKHR;
        /*  154 */ PFNEGLSTREAMCONSUMERGLTEXTUREEXTERNALATTRIBSNVPROC StreamConsumerGLTextureExternalAttribsNV;
        /*  155 */ PFNEGLSTREAMCONSUMERGLTEXTUREEXTERNALKHRPROC StreamConsumerGLTextureExternalKHR;
        /*  156 */ PFNEGLSTREAMCONSUMEROUTPUTEXTPROC StreamConsumerOutputEXT;
        /*  157 */ PFNEGLSTREAMCONSUMERRELEASEATTRIBKHRPROC StreamConsumerReleaseAttribKHR;
        /*  158 */ PFNEGLSTREAMCONSUMERRELEASEKHRPROC StreamConsumerReleaseKHR;
        /*  159 */ PFNEGLSTREAMFLUSHNVPROC StreamFlushNV;
        /*  160 */ PFNEGLSTREAMIMAGECONSUMERCONNECTNVPROC StreamImageConsumerConnectNV;
        /*  161 */ PFNEGLSTREAMPOSTD3DTEXTUREANGLEPROC StreamPostD3DTextureANGLE;
        /*  162 */ PFNEGLSTREAMRELEASEIMAGENVPROC StreamReleaseImageNV;
        /*  163 */ PFNEGLSURFACEATTRIBPROC SurfaceAttrib;
        /*  164 */ PFNEGLSWAPBUFFERSPROC SwapBuffers;
        /*  165 */ PFNEGLSWAPBUFFERSREGION2NOKPROC SwapBuffersRegion2NOK;
        /*  166 */ PFNEGLSWAPBUFFERSREGIONNOKPROC SwapBuffersRegionNOK;
        /*  167 */ PFNEGLSWAPBUFFERSWITHDAMAGEEXTPROC SwapBuffersWithDamageEXT;
        /*  168 */ PFNEGLSWAPBUFFERSWITHDAMAGEKHRPROC SwapBuffersWithDamageKHR;
        /*  169 */ PFNEGLSWAPBUFFERSWITHFRAMETOKENANGLEPROC SwapBuffersWithFrameTokenANGLE;
        /*  170 */ PFNEGLSWAPINTERVALPROC SwapInterval;
        /*  171 */ PFNEGLTERMINATEPROC Terminate;
        /*  172 */ PFNEGLUNBINDWAYLANDDISPLAYWLPROC UnbindWaylandDisplayWL;
        /*  173 */ PFNEGLUNLOCKSURFACEKHRPROC UnlockSurfaceKHR;
        /*  174 */ PFNEGLUNSIGNALSYNCEXTPROC UnsignalSyncEXT;
        /*  175 */ PFNEGLWAITCLIENTPROC WaitClient;
        /*  176 */ PFNEGLWAITGLPROC WaitGL;
        /*  177 */ PFNEGLWAITNATIVEPROC WaitNative;
        /*  178 */ PFNEGLWAITSYNCPROC WaitSync;
        /*  179 */ PFNEGLWAITSYNCKHRPROC WaitSyncKHR;
        /*  180 */ PFNEGLWAITUNTILWORKSCHEDULEDANGLEPROC WaitUntilWorkScheduledANGLE;
        };
    };

    void* glad_loader_handle;
} GladEGLContext;

GLAD_API_CALL GladEGLContext glad_egl_context;

#define GLAD_EGL_VERSION_1_0 (glad_egl_context.VERSION_1_0)
#define GLAD_EGL_VERSION_1_1 (glad_egl_context.VERSION_1_1)
#define GLAD_EGL_VERSION_1_2 (glad_egl_context.VERSION_1_2)
#define GLAD_EGL_VERSION_1_3 (glad_egl_context.VERSION_1_3)
#define GLAD_EGL_VERSION_1_4 (glad_egl_context.VERSION_1_4)
#define GLAD_EGL_VERSION_1_5 (glad_egl_context.VERSION_1_5)
#define GLAD_EGL_ANDROID_GLES_layers (glad_egl_context.ANDROID_GLES_layers)
#define GLAD_EGL_ANDROID_blob_cache (glad_egl_context.ANDROID_blob_cache)
#define GLAD_EGL_ANDROID_create_native_client_buffer (glad_egl_context.ANDROID_create_native_client_buffer)
#define GLAD_EGL_ANDROID_framebuffer_target (glad_egl_context.ANDROID_framebuffer_target)
