/**
 * Loader generated by glad 2.0.4 on -
 *
 * SPDX-License-Identifier: (WTFPL OR CC0-1.0) AND Apache-2.0
 *
 * Generator: C/C++
 * Specification: gl
 * Extensions: 55
 *
 * APIs:
 *  - gl:compatibility=1.2
 *  - gles2=3.2
 *
 * Options:
 *  - ALIAS = True
 *  - HEADER_ONLY = False
 *  - LOADER = True
 *  - MX = True
 *  - MX_GLOBAL = True
 *
 * Commandline:

typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIB1FVPROC)(GLuint index, const GLfloat * v);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIB2FPROC)(GLuint index, GLfloat x, GLfloat y);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIB2FVPROC)(GLuint index, const GLfloat * v);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIB3FPROC)(GLuint index, GLfloat x, GLfloat y, GLfloat z);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIB3FVPROC)(GLuint index, const GLfloat * v);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIB4FPROC)(GLuint index, GLfloat x, GLfloat y, GLfloat z, GLfloat w);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIB4FVPROC)(GLuint index, const GLfloat * v);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBBINDINGPROC)(GLuint attribindex, GLuint bindingindex);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBDIVISORPROC)(GLuint index, GLuint divisor);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBDIVISORANGLEPROC)(GLuint index, GLuint divisor);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBDIVISOREXTPROC)(GLuint index, GLuint divisor);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBDIVISORNVPROC)(GLuint index, GLuint divisor);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBFORMATPROC)(GLuint attribindex, GLint size, GLenum type, GLboolean normalized, GLuint relativeoffset);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBI4IPROC)(GLuint index, GLint x, GLint y, GLint z, GLint w);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBI4IVPROC)(GLuint index, const GLint * v);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBI4UIPROC)(GLuint index, GLuint x, GLuint y, GLuint z, GLuint w);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBI4UIVPROC)(GLuint index, const GLuint * v);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBIFORMATPROC)(GLuint attribindex, GLint size, GLenum type, GLuint relativeoffset);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBIPOINTERPROC)(GLuint index, GLint size, GLenum type, GLsizei stride, const void * pointer);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBPOINTERPROC)(GLuint index, GLint size, GLenum type, GLboolean normalized, GLsizei stride, const void * pointer);
typedef void (GLAD_API_PTR *PFNGLVERTEXBINDINGDIVISORPROC)(GLuint bindingindex, GLuint divisor);
typedef void (GLAD_API_PTR *PFNGLVIEWPORTARRAYVNVPROC)(GLuint first, GLsizei count, const GLfloat * v);
typedef void (GLAD_API_PTR *PFNGLVIEWPORTARRAYVOESPROC)(GLuint first, GLsizei count, const GLfloat * v);
typedef void (GLAD_API_PTR *PFNGLVIEWPORTINDEXEDFNVPROC)(GLuint index, GLfloat x, GLfloat y, GLfloat w, GLfloat h);
typedef void (GLAD_API_PTR *PFNGLVIEWPORTINDEXEDFOESPROC)(GLuint index, GLfloat x, GLfloat y, GLfloat w, GLfloat h);
typedef void (GLAD_API_PTR *PFNGLVIEWPORTINDEXEDFVNVPROC)(GLuint index, const GLfloat * v);
typedef void (GLAD_API_PTR *PFNGLVIEWPORTINDEXEDFVOESPROC)(GLuint index, const GLfloat * v);
typedef void (GLAD_API_PTR *PFNGLWAITSYNCPROC)(GLsync sync, GLbitfield flags, GLuint64 timeout);
typedef void (GLAD_API_PTR *PFNGLWAITSYNCAPPLEPROC)(GLsync sync, GLbitfield flags, GLuint64 timeout);

typedef struct GladGLContext {
    void* userptr;

    unsigned char VERSION_1_0;
    unsigned char VERSION_1_1;
    unsigned char VERSION_1_2;
    unsigned char ES_VERSION_2_0;
    unsigned char ES_VERSION_3_0;
    unsigned char ES_VERSION_3_1;
    unsigned char ES_VERSION_3_2;

    union {
        unsigned char extArray[55];
        struct {
        /*    0 */ unsigned char ANGLE_instanced_arrays;
        /*    1 */ unsigned char APPLE_sync;
        /*    2 */ unsigned char ARB_buffer_storage;
        /*    3 */ unsigned char ARB_debug_output;
        /*    4 */ unsigned char ARB_vertex_buffer_object;
        /*    5 */ unsigned char EXT_copy_image;
        /*    6 */ unsigned char EXT_copy_texture;
        /*    7 */ unsigned char EXT_direct_state_access;
        /*    8 */ unsigned char EXT_disjoint_timer_query;
        /*    9 */ unsigned char EXT_draw_buffers;
        /*   10 */ unsigned char EXT_draw_buffers_indexed;
        /*   11 */ unsigned char EXT_draw_elements_base_vertex;
        /*   12 */ unsigned char EXT_draw_instanced;
        /*   13 */ unsigned char EXT_draw_range_elements;
        /*   14 */ unsigned char EXT_geometry_shader;
        /*   15 */ unsigned char EXT_instanced_arrays;
        /*   16 */ unsigned char EXT_map_buffer_range;
        /*   17 */ unsigned char EXT_multisampled_render_to_texture;
        /*   18 */ unsigned char EXT_primitive_bounding_box;
        /*   19 */ unsigned char EXT_robustness;
        /*   20 */ unsigned char EXT_separate_shader_objects;
        /*   21 */ unsigned char EXT_subtexture;
        /*   22 */ unsigned char EXT_tessellation_shader;
        /*   23 */ unsigned char EXT_texture3D;
        /*   24 */ unsigned char EXT_texture_border_clamp;
        /*   25 */ unsigned char EXT_texture_buffer;
        /*   26 */ unsigned char EXT_texture_object;
        /*   27 */ unsigned char EXT_texture_storage;
        /*   28 */ unsigned char EXT_vertex_array;
        /*   29 */ unsigned char KHR_blend_equation_advanced;
        /*   30 */ unsigned char KHR_debug;
        /*   31 */ unsigned char KHR_robustness;
        /*   32 */ unsigned char MESA_sampler_objects;
        /*   33 */ unsigned char NV_blend_equation_advanced;
        /*   34 */ unsigned char NV_copy_buffer;
        /*   35 */ unsigned char NV_draw_instanced;
        /*   36 */ unsigned char NV_framebuffer_blit;
        /*   37 */ unsigned char NV_framebuffer_multisample;
        /*   38 */ unsigned char NV_instanced_arrays;
        /*   39 */ unsigned char NV_non_square_matrices;
        /*   40 */ unsigned char NV_viewport_array;
        /*   41 */ unsigned char OES_copy_image;
        /*   42 */ unsigned char OES_draw_buffers_indexed;
        /*   43 */ unsigned char OES_draw_elements_base_vertex;
        /*   44 */ unsigned char OES_geometry_shader;
        /*   45 */ unsigned char OES_get_program_binary;
        /*   46 */ unsigned char OES_mapbuffer;
        /*   47 */ unsigned char OES_primitive_bounding_box;
        /*   48 */ unsigned char OES_sample_shading;
        /*   49 */ unsigned char OES_tessellation_shader;
        /*   50 */ unsigned char OES_texture_border_clamp;
        /*   51 */ unsigned char OES_texture_buffer;
        /*   52 */ unsigned char OES_texture_storage_multisample_2d_array;
        /*   53 */ unsigned char OES_vertex_array_object;
        /*   54 */ unsigned char OES_viewport_array;
        };
    };

    union {
        void *pfnArray[1103];
        struct {
        /*    0 */ PFNGLACCUMPROC Accum;
        /*    1 */ PFNGLALPHAFUNCPROC AlphaFunc;
        /*    2 */ PFNGLARETEXTURESRESIDENTPROC AreTexturesResident;
        /*    3 */ PFNGLARETEXTURESRESIDENTEXTPROC AreTexturesResidentEXT;
        /*    4 */ PFNGLARRAYELEMENTPROC ArrayElement;
        /*    5 */ PFNGLARRAYELEMENTEXTPROC ArrayElementEXT;
        /*    6 */ PFNGLBEGINPROC Begin;
        /*    7 */ PFNGLBINDBUFFERARBPROC BindBufferARB;
        /*    8 */ PFNGLBINDMULTITEXTUREEXTPROC BindMultiTextureEXT;
        /*    9 */ PFNGLBINDTEXTUREPROC BindTexture;
        /*   10 */ PFNGLBINDTEXTUREEXTPROC BindTextureEXT;
        /*   11 */ PFNGLBITMAPPROC Bitmap;
        /*   12 */ PFNGLBLENDFUNCPROC BlendFunc;
        /*   13 */ PFNGLBUFFERDATAARBPROC BufferDataARB;
        /*   14 */ PFNGLBUFFERSTORAGEPROC BufferStorage;
        /*   15 */ PFNGLBUFFERSUBDATAARBPROC BufferSubDataARB;
        /*   16 */ PFNGLCALLLISTPROC CallList;
        /*   17 */ PFNGLCALLLISTSPROC CallLists;
        /*   18 */ PFNGLCHECKNAMEDFRAMEBUFFERSTATUSEXTPROC CheckNamedFramebufferStatusEXT;
        /*   19 */ PFNGLCLEARPROC Clear;
        /*   20 */ PFNGLCLEARACCUMPROC ClearAccum;
        /*   21 */ PFNGLCLEARCOLORPROC ClearColor;
        /*   22 */ PFNGLCLEARDEPTHPROC ClearDepth;
        /*   23 */ PFNGLCLEARINDEXPROC ClearIndex;
        /*   24 */ PFNGLCLEARNAMEDBUFFERDATAEXTPROC ClearNamedBufferDataEXT;
        /*   25 */ PFNGLCLEARNAMEDBUFFERSUBDATAEXTPROC ClearNamedBufferSubDataEXT;
        /*   26 */ PFNGLCLEARSTENCILPROC ClearStencil;
        /*   27 */ PFNGLCLIENTATTRIBDEFAULTEXTPROC ClientAttribDefaultEXT;
        /*   28 */ PFNGLCLIPPLANEPROC ClipPlane;
        /*   29 */ PFNGLCOLOR3BPROC Color3b;
        /*   30 */ PFNGLCOLOR3BVPROC Color3bv;
        /*   31 */ PFNGLCOLOR3DPROC Color3d;
        /*   32 */ PFNGLCOLOR3DVPROC Color3dv;
        /*   33 */ PFNGLCOLOR3FPROC Color3f;
        /*   34 */ PFNGLCOLOR3FVPROC Color3fv;
        /*   35 */ PFNGLCOLOR3IPROC Color3i;
        /*   36 */ PFNGLCOLOR3IVPROC Color3iv;
        /*   37 */ PFNGLCOLOR3SPROC Color3s;
        /*   38 */ PFNGLCOLOR3SVPROC Color3sv;
        /*   39 */ PFNGLCOLOR3UBPROC Color3ub;
        /*   40 */ PFNGLCOLOR3UBVPROC Color3ubv;
        /*   41 */ PFNGLCOLOR3UIPROC Color3ui;
        /*   42 */ PFNGLCOLOR3UIVPROC Color3uiv;
        /*   43 */ PFNGLCOLOR3USPROC Color3us;
        /*   44 */ PFNGLCOLOR3USVPROC Color3usv;
        /*   45 */ PFNGLCOLOR4BPROC Color4b;
        /*   46 */ PFNGLCOLOR4BVPROC Color4bv;
        /*   47 */ PFNGLCOLOR4DPROC Color4d;
        /*   48 */ PFNGLCOLOR4DVPROC Color4dv;
        /*   49 */ PFNGLCOLOR4FPROC Color4f;
        /*   50 */ PFNGLCOLOR4FVPROC Color4fv;
        /*   51 */ PFNGLCOLOR4IPROC Color4i;
        /*   52 */ PFNGLCOLOR4IVPROC Color4iv;
        /*   53 */ PFNGLCOLOR4SPROC Color4s;
        /*   54 */ PFNGLCOLOR4SVPROC Color4sv;
        /*   55 */ PFNGLCOLOR4UBPROC Color4ub;
        /*   56 */ PFNGLCOLOR4UBVPROC Color4ubv;
        /*   57 */ PFNGLCOLOR4UIPROC Color4ui;
        /*   58 */ PFNGLCOLOR4UIVPROC Color4uiv;
        /*   59 */ PFNGLCOLOR4USPROC Color4us;
        /*   60 */ PFNGLCOLOR4USVPROC Color4usv;
        /*   61 */ PFNGLCOLORMASKPROC ColorMask;
        /*   62 */ PFNGLCOLORMATERIALPROC ColorMaterial;
        /*   63 */ PFNGLCOLORPOINTERPROC ColorPointer;
        /*   64 */ PFNGLCOLORPOINTEREXTPROC ColorPointerEXT;
        /*   65 */ PFNGLCOMPRESSEDMULTITEXIMAGE1DEXTPROC CompressedMultiTexImage1DEXT;
        /*   66 */ PFNGLCOMPRESSEDMULTITEXIMAGE2DEXTPROC CompressedMultiTexImage2DEXT;
        /*   67 */ PFNGLCOMPRESSEDMULTITEXIMAGE3DEXTPROC CompressedMultiTexImage3DEXT;
        /*   68 */ PFNGLCOMPRESSEDMULTITEXSUBIMAGE1DEXTPROC CompressedMultiTexSubImage1DEXT;
        /*   69 */ PFNGLCOMPRESSEDMULTITEXSUBIMAGE2DEXTPROC CompressedMultiTexSubImage2DEXT;
        /*   70 */ PFNGLCOMPRESSEDMULTITEXSUBIMAGE3DEXTPROC CompressedMultiTexSubImage3DEXT;
        /*   71 */ PFNGLCOMPRESSEDTEXTUREIMAGE1DEXTPROC CompressedTextureImage1DEXT;
        /*   72 */ PFNGLCOMPRESSEDTEXTUREIMAGE2DEXTPROC CompressedTextureImage2DEXT;
        /*   73 */ PFNGLCOMPRESSEDTEXTUREIMAGE3DEXTPROC CompressedTextureImage3DEXT;
        /*   74 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE1DEXTPROC CompressedTextureSubImage1DEXT;
        /*   75 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE2DEXTPROC CompressedTextureSubImage2DEXT;
        /*   76 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE3DEXTPROC CompressedTextureSubImage3DEXT;
        /*   77 */ PFNGLCOPYMULTITEXIMAGE1DEXTPROC CopyMultiTexImage1DEXT;
        /*   78 */ PFNGLCOPYMULTITEXIMAGE2DEXTPROC CopyMultiTexImage2DEXT;
        /*   79 */ PFNGLCOPYMULTITEXSUBIMAGE1DEXTPROC CopyMultiTexSubImage1DEXT;
        /*   80 */ PFNGLCOPYMULTITEXSUBIMAGE2DEXTPROC CopyMultiTexSubImage2DEXT;
        /*   81 */ PFNGLCOPYMULTITEXSUBIMAGE3DEXTPROC CopyMultiTexSubImage3DEXT;
        /*   82 */ PFNGLCOPYPIXELSPROC CopyPixels;
        /*   83 */ PFNGLCOPYTEXIMAGE1DPROC CopyTexImage1D;
        /*   84 */ PFNGLCOPYTEXIMAGE1DEXTPROC CopyTexImage1DEXT;
        /*   85 */ PFNGLCOPYTEXIMAGE2DPROC CopyTexImage2D;
        /*   86 */ PFNGLCOPYTEXIMAGE2DEXTPROC CopyTexImage2DEXT;
        /*   87 */ PFNGLCOPYTEXSUBIMAGE1DPROC CopyTexSubImage1D;
        /*   88 */ PFNGLCOPYTEXSUBIMAGE1DEXTPROC CopyTexSubImage1DEXT;
        /*   89 */ PFNGLCOPYTEXSUBIMAGE2DPROC CopyTexSubImage2D;
        /*   90 */ PFNGLCOPYTEXSUBIMAGE2DEXTPROC CopyTexSubImage2DEXT;
        /*   91 */ PFNGLCOPYTEXSUBIMAGE3DPROC CopyTexSubImage3D;
        /*   92 */ PFNGLCOPYTEXSUBIMAGE3DEXTPROC CopyTexSubImage3DEXT;
        /*   93 */ PFNGLCOPYTEXTUREIMAGE1DEXTPROC CopyTextureImage1DEXT;
        /*   94 */ PFNGLCOPYTEXTUREIMAGE2DEXTPROC CopyTextureImage2DEXT;
        /*   95 */ PFNGLCOPYTEXTURESUBIMAGE1DEXTPROC CopyTextureSubImage1DEXT;
        /*   96 */ PFNGLCOPYTEXTURESUBIMAGE2DEXTPROC CopyTextureSubImage2DEXT;
        /*   97 */ PFNGLCOPYTEXTURESUBIMAGE3DEXTPROC CopyTextureSubImage3DEXT;
        /*   98 */ PFNGLCULLFACEPROC CullFace;
        /*   99 */ PFNGLDEBUGMESSAGECALLBACKPROC DebugMessageCallback;
        /*  100 */ PFNGLDEBUGMESSAGECALLBACKARBPROC DebugMessageCallbackARB;
        /*  101 */ PFNGLDEBUGMESSAGECONTROLPROC DebugMessageControl;
        /*  102 */ PFNGLDEBUGMESSAGECONTROLARBPROC DebugMessageControlARB;
        /*  103 */ PFNGLDEBUGMESSAGEINSERTPROC DebugMessageInsert;
        /*  104 */ PFNGLDEBUGMESSAGEINSERTARBPROC DebugMessageInsertARB;
        /*  105 */ PFNGLDELETEBUFFERSARBPROC DeleteBuffersARB;
        /*  106 */ PFNGLDELETELISTSPROC DeleteLists;
        /*  107 */ PFNGLDELETETEXTURESPROC DeleteTextures;
        /*  108 */ PFNGLDELETETEXTURESEXTPROC DeleteTexturesEXT;
        /*  109 */ PFNGLDEPTHFUNCPROC DepthFunc;
        /*  110 */ PFNGLDEPTHMASKPROC DepthMask;
        /*  111 */ PFNGLDEPTHRANGEPROC DepthRange;
        /*  112 */ PFNGLDISABLEPROC Disable;
        /*  113 */ PFNGLDISABLECLIENTSTATEPROC DisableClientState;
        /*  114 */ PFNGLDISABLECLIENTSTATEINDEXEDEXTPROC DisableClientStateIndexedEXT;
        /*  115 */ PFNGLDISABLECLIENTSTATEIEXTPROC DisableClientStateiEXT;
        /*  116 */ PFNGLDISABLEINDEXEDEXTPROC DisableIndexedEXT;
        /*  117 */ PFNGLDISABLEVERTEXARRAYATTRIBEXTPROC DisableVertexArrayAttribEXT;
        /*  118 */ PFNGLDISABLEVERTEXARRAYEXTPROC DisableVertexArrayEXT;
        /*  119 */ PFNGLDRAWARRAYSPROC DrawArrays;
        /*  120 */ PFNGLDRAWARRAYSEXTPROC DrawArraysEXT;
        /*  121 */ PFNGLDRAWBUFFERPROC DrawBuffer;
        /*  122 */ PFNGLDRAWELEMENTSPROC DrawElements;
        /*  123 */ PFNGLDRAWPIXELSPROC DrawPixels;
        /*  124 */ PFNGLDRAWRANGEELEMENTSPROC DrawRangeElements;
        /*  125 */ PFNGLDRAWRANGEELEMENTSEXTPROC DrawRangeElementsEXT;
        /*  126 */ PFNGLEDGEFLAGPROC EdgeFlag;
        /*  127 */ PFNGLEDGEFLAGPOINTERPROC EdgeFlagPointer;
        /*  128 */ PFNGLEDGEFLAGPOINTEREXTPROC EdgeFlagPointerEXT;
        /*  129 */ PFNGLEDGEFLAGVPROC EdgeFlagv;
        /*  130 */ PFNGLENABLEPROC Enable;
        /*  131 */ PFNGLENABLECLIENTSTATEPROC EnableClientState;
        /*  132 */ PFNGLENABLECLIENTSTATEINDEXEDEXTPROC EnableClientStateIndexedEXT;
        /*  133 */ PFNGLENABLECLIENTSTATEIEXTPROC EnableClientStateiEXT;
        /*  134 */ PFNGLENABLEINDEXEDEXTPROC EnableIndexedEXT;
        /*  135 */ PFNGLENABLEVERTEXARRAYATTRIBEXTPROC EnableVertexArrayAttribEXT;
        /*  136 */ PFNGLENABLEVERTEXARRAYEXTPROC EnableVertexArrayEXT;
        /*  137 */ PFNGLENDPROC End;
        /*  138 */ PFNGLENDLISTPROC EndList;
        /*  139 */ PFNGLEVALCOORD1DPROC EvalCoord1d;
        /*  140 */ PFNGLEVALCOORD1DVPROC EvalCoord1dv;
        /*  141 */ PFNGLEVALCOORD1FPROC EvalCoord1f;
        /*  142 */ PFNGLEVALCOORD1FVPROC EvalCoord1fv;
        /*  143 */ PFNGLEVALCOORD2DPROC EvalCoord2d;
        /*  144 */ PFNGLEVALCOORD2DVPROC EvalCoord2dv;
        /*  145 */ PFNGLEVALCOORD2FPROC EvalCoord2f;
        /*  146 */ PFNGLEVALCOORD2FVPROC EvalCoord2fv;
        /*  147 */ PFNGLEVALMESH1PROC EvalMesh1;
        /*  148 */ PFNGLEVALMESH2PROC EvalMesh2;
        /*  149 */ PFNGLEVALPOINT1PROC EvalPoint1;
        /*  150 */ PFNGLEVALPOINT2PROC EvalPoint2;
        /*  151 */ PFNGLFEEDBACKBUFFERPROC FeedbackBuffer;
        /*  152 */ PFNGLFINISHPROC Finish;
        /*  153 */ PFNGLFLUSHPROC Flush;
        /*  154 */ PFNGLFLUSHMAPPEDNAMEDBUFFERRANGEEXTPROC FlushMappedNamedBufferRangeEXT;
        /*  155 */ PFNGLFOGFPROC Fogf;
        /*  156 */ PFNGLFOGFVPROC Fogfv;
        /*  157 */ PFNGLFOGIPROC Fogi;
        /*  158 */ PFNGLFOGIVPROC Fogiv;
        /*  159 */ PFNGLFRAMEBUFFERDRAWBUFFEREXTPROC FramebufferDrawBufferEXT;
        /*  160 */ PFNGLFRAMEBUFFERDRAWBUFFERSEXTPROC FramebufferDrawBuffersEXT;
        /*  161 */ PFNGLFRAMEBUFFERREADBUFFEREXTPROC FramebufferReadBufferEXT;
        /*  162 */ PFNGLFRONTFACEPROC FrontFace;
        /*  163 */ PFNGLFRUSTUMPROC Frustum;
        /*  164 */ PFNGLGENBUFFERSARBPROC GenBuffersARB;
        /*  165 */ PFNGLGENLISTSPROC GenLists;
        /*  166 */ PFNGLGENTEXTURESPROC GenTextures;
        /*  167 */ PFNGLGENTEXTURESEXTPROC GenTexturesEXT;
        /*  168 */ PFNGLGENERATEMULTITEXMIPMAPEXTPROC GenerateMultiTexMipmapEXT;
        /*  169 */ PFNGLGENERATETEXTUREMIPMAPEXTPROC GenerateTextureMipmapEXT;
        /*  170 */ PFNGLGETBOOLEANINDEXEDVEXTPROC GetBooleanIndexedvEXT;
        /*  171 */ PFNGLGETBOOLEANVPROC GetBooleanv;
        /*  172 */ PFNGLGETBUFFERPARAMETERIVARBPROC GetBufferParameterivARB;
        /*  173 */ PFNGLGETBUFFERPOINTERVARBPROC GetBufferPointervARB;
        /*  174 */ PFNGLGETBUFFERSUBDATAARBPROC GetBufferSubDataARB;
        /*  175 */ PFNGLGETCLIPPLANEPROC GetClipPlane;
        /*  176 */ PFNGLGETCOMPRESSEDMULTITEXIMAGEEXTPROC GetCompressedMultiTexImageEXT;
        /*  177 */ PFNGLGETCOMPRESSEDTEXTUREIMAGEEXTPROC GetCompressedTextureImageEXT;
        /*  178 */ PFNGLGETDEBUGMESSAGELOGPROC GetDebugMessageLog;
        /*  179 */ PFNGLGETDEBUGMESSAGELOGARBPROC GetDebugMessageLogARB;
        /*  180 */ PFNGLGETDOUBLEINDEXEDVEXTPROC GetDoubleIndexedvEXT;
        /*  181 */ PFNGLGETDOUBLEI_VEXTPROC GetDoublei_vEXT;
        /*  182 */ PFNGLGETDOUBLEVPROC GetDoublev;
        /*  183 */ PFNGLGETERRORPROC GetError;
        /*  184 */ PFNGLGETFLOATINDEXEDVEXTPROC GetFloatIndexedvEXT;
        /*  185 */ PFNGLGETFLOATI_VEXTPROC GetFloati_vEXT;
        /*  186 */ PFNGLGETFLOATVPROC GetFloatv;
        /*  187 */ PFNGLGETFRAMEBUFFERPARAMETERIVEXTPROC GetFramebufferParameterivEXT;
        /*  188 */ PFNGLGETINTEGERINDEXEDVEXTPROC GetIntegerIndexedvEXT;
        /*  189 */ PFNGLGETINTEGERVPROC GetIntegerv;
        /*  190 */ PFNGLGETLIGHTFVPROC GetLightfv;
        /*  191 */ PFNGLGETLIGHTIVPROC GetLightiv;
        /*  192 */ PFNGLGETMAPDVPROC GetMapdv;
        /*  193 */ PFNGLGETMAPFVPROC GetMapfv;
        /*  194 */ PFNGLGETMAPIVPROC GetMapiv;
        /*  195 */ PFNGLGETMATERIALFVPROC GetMaterialfv;
        /*  196 */ PFNGLGETMATERIALIVPROC GetMaterialiv;
        /*  197 */ PFNGLGETMULTITEXENVFVEXTPROC GetMultiTexEnvfvEXT;
        /*  198 */ PFNGLGETMULTITEXENVIVEXTPROC GetMultiTexEnvivEXT;
        /*  199 */ PFNGLGETMULTITEXGENDVEXTPROC GetMultiTexGendvEXT;
        /*  200 */ PFNGLGETMULTITEXGENFVEXTPROC GetMultiTexGenfvEXT;
        /*  201 */ PFNGLGETMULTITEXGENIVEXTPROC GetMultiTexGenivEXT;
        /*  202 */ PFNGLGETMULTITEXIMAGEEXTPROC GetMultiTexImageEXT;
        /*  203 */ PFNGLGETMULTITEXLEVELPARAMETERFVEXTPROC GetMultiTexLevelParameterfvEXT;
        /*  204 */ PFNGLGETMULTITEXLEVELPARAMETERIVEXTPROC GetMultiTexLevelParameterivEXT;
        /*  205 */ PFNGLGETMULTITEXPARAMETERIIVEXTPROC GetMultiTexParameterIivEXT;
        /*  206 */ PFNGLGETMULTITEXPARAMETERIUIVEXTPROC GetMultiTexParameterIuivEXT;
        /*  207 */ PFNGLGETMULTITEXPARAMETERFVEXTPROC GetMultiTexParameterfvEXT;
        /*  208 */ PFNGLGETMULTITEXPARAMETERIVEXTPROC GetMultiTexParameterivEXT;
        /*  209 */ PFNGLGETNAMEDBUFFERPARAMETERIVEXTPROC GetNamedBufferParameterivEXT;
        /*  210 */ PFNGLGETNAMEDBUFFERPOINTERVEXTPROC GetNamedBufferPointervEXT;
        /*  211 */ PFNGLGETNAMEDBUFFERSUBDATAEXTPROC GetNamedBufferSubDataEXT;
        /*  212 */ PFNGLGETNAMEDFRAMEBUFFERATTACHMENTPARAMETERIVEXTPROC GetNamedFramebufferAttachmentParameterivEXT;
        /*  213 */ PFNGLGETNAMEDFRAMEBUFFERPARAMETERIVEXTPROC GetNamedFramebufferParameterivEXT;
        /*  214 */ PFNGLGETNAMEDPROGRAMLOCALPARAMETERIIVEXTPROC GetNamedProgramLocalParameterIivEXT;
        /*  215 */ PFNGLGETNAMEDPROGRAMLOCALPARAMETERIUIVEXTPROC GetNamedProgramLocalParameterIuivEXT;
        /*  216 */ PFNGLGETNAMEDPROGRAMLOCALPARAMETERDVEXTPROC GetNamedProgramLocalParameterdvEXT;
        /*  217 */ PFNGLGETNAMEDPROGRAMLOCALPARAMETERFVEXTPROC GetNamedProgramLocalParameterfvEXT;
        /*  218 */ PFNGLGETNAMEDPROGRAMSTRINGEXTPROC GetNamedProgramStringEXT;
        /*  219 */ PFNGLGETNAMEDPROGRAMIVEXTPROC GetNamedProgramivEXT;
        /*  220 */ PFNGLGETNAMEDRENDERBUFFERPARAMETERIVEXTPROC GetNamedRenderbufferParameterivEXT;
        /*  221 */ PFNGLGETOBJECTLABELPROC GetObjectLabel;
        /*  222 */ PFNGLGETOBJECTPTRLABELPROC GetObjectPtrLabel;
        /*  223 */ PFNGLGETPIXELMAPFVPROC GetPixelMapfv;
        /*  224 */ PFNGLGETPIXELMAPUIVPROC GetPixelMapuiv;
        /*  225 */ PFNGLGETPIXELMAPUSVPROC GetPixelMapusv;
        /*  226 */ PFNGLGETPOINTERINDEXEDVEXTPROC GetPointerIndexedvEXT;
        /*  227 */ PFNGLGETPOINTERI_VEXTPROC GetPointeri_vEXT;
        /*  228 */ PFNGLGETPOINTERVPROC GetPointerv;
        /*  229 */ PFNGLGETPOINTERVEXTPROC GetPointervEXT;
        /*  230 */ PFNGLGETPOLYGONSTIPPLEPROC GetPolygonStipple;
        /*  231 */ PFNGLGETSTRINGPROC GetString;
        /*  232 */ PFNGLGETTEXENVFVPROC GetTexEnvfv;
        /*  233 */ PFNGLGETTEXENVIVPROC GetTexEnviv;
        /*  234 */ PFNGLGETTEXGENDVPROC GetTexGendv;
        /*  235 */ PFNGLGETTEXGENFVPROC GetTexGenfv;
        /*  236 */ PFNGLGETTEXGENIVPROC GetTexGeniv;
        /*  237 */ PFNGLGETTEXIMAGEPROC GetTexImage;
        /*  238 */ PFNGLGETTEXLEVELPARAMETERFVPROC GetTexLevelParameterfv;
        /*  239 */ PFNGLGETTEXLEVELPARAMETERIVPROC GetTexLevelParameteriv;
        /*  240 */ PFNGLGETTEXPARAMETERFVPROC GetTexParameterfv;
        /*  241 */ PFNGLGETTEXPARAMETERIVPROC GetTexParameteriv;
        /*  242 */ PFNGLGETTEXTUREIMAGEEXTPROC GetTextureImageEXT;
        /*  243 */ PFNGLGETTEXTURELEVELPARAMETERFVEXTPROC GetTextureLevelParameterfvEXT;
        /*  244 */ PFNGLGETTEXTURELEVELPARAMETERIVEXTPROC GetTextureLevelParameterivEXT;
        /*  245 */ PFNGLGETTEXTUREPARAMETERIIVEXTPROC GetTextureParameterIivEXT;
        /*  246 */ PFNGLGETTEXTUREPARAMETERIUIVEXTPROC GetTextureParameterIuivEXT;
        /*  247 */ PFNGLGETTEXTUREPARAMETERFVEXTPROC GetTextureParameterfvEXT;
        /*  248 */ PFNGLGETTEXTUREPARAMETERIVEXTPROC GetTextureParameterivEXT;
        /*  249 */ PFNGLGETVERTEXARRAYINTEGERI_VEXTPROC GetVertexArrayIntegeri_vEXT;
        /*  250 */ PFNGLGETVERTEXARRAYINTEGERVEXTPROC GetVertexArrayIntegervEXT;
        /*  251 */ PFNGLGETVERTEXARRAYPOINTERI_VEXTPROC GetVertexArrayPointeri_vEXT;
        /*  252 */ PFNGLGETVERTEXARRAYPOINTERVEXTPROC GetVertexArrayPointervEXT;
        /*  253 */ PFNGLHINTPROC Hint;
        /*  254 */ PFNGLINDEXMASKPROC IndexMask;
        /*  255 */ PFNGLINDEXPOINTERPROC IndexPointer;
        /*  256 */ PFNGLINDEXPOINTEREXTPROC IndexPointerEXT;
        /*  257 */ PFNGLINDEXDPROC Indexd;
        /*  258 */ PFNGLINDEXDVPROC Indexdv;
        /*  259 */ PFNGLINDEXFPROC Indexf;
        /*  260 */ PFNGLINDEXFVPROC Indexfv;
        /*  261 */ PFNGLINDEXIPROC Indexi;
        /*  262 */ PFNGLINDEXIVPROC Indexiv;
        /*  263 */ PFNGLINDEXSPROC Indexs;
        /*  264 */ PFNGLINDEXSVPROC Indexsv;
        /*  265 */ PFNGLINDEXUBPROC Indexub;
        /*  266 */ PFNGLINDEXUBVPROC Indexubv;
        /*  267 */ PFNGLINITNAMESPROC InitNames;
        /*  268 */ PFNGLINTERLEAVEDARRAYSPROC InterleavedArrays;
        /*  269 */ PFNGLISBUFFERARBPROC IsBufferARB;
        /*  270 */ PFNGLISENABLEDPROC IsEnabled;
        /*  271 */ PFNGLISENABLEDINDEXEDEXTPROC IsEnabledIndexedEXT;
        /*  272 */ PFNGLISLISTPROC IsList;
        /*  273 */ PFNGLISTEXTUREPROC IsTexture;
        /*  274 */ PFNGLISTEXTUREEXTPROC IsTextureEXT;
        /*  275 */ PFNGLLIGHTMODELFPROC LightModelf;
        /*  276 */ PFNGLLIGHTMODELFVPROC LightModelfv;
        /*  277 */ PFNGLLIGHTMODELIPROC LightModeli;
        /*  278 */ PFNGLLIGHTMODELIVPROC LightModeliv;
        /*  279 */ PFNGLLIGHTFPROC Lightf;
        /*  280 */ PFNGLLIGHTFVPROC Lightfv;
        /*  281 */ PFNGLLIGHTIPROC Lighti;
        /*  282 */ PFNGLLIGHTIVPROC Lightiv;
        /*  283 */ PFNGLLINESTIPPLEPROC LineStipple;
        /*  284 */ PFNGLLINEWIDTHPROC LineWidth;
        /*  285 */ PFNGLLISTBASEPROC ListBase;
        /*  286 */ PFNGLLOADIDENTITYPROC LoadIdentity;
        /*  287 */ PFNGLLOADMATRIXDPROC LoadMatrixd;
        /*  288 */ PFNGLLOADMATRIXFPROC LoadMatrixf;
        /*  289 */ PFNGLLOADNAMEPROC LoadName;
        /*  290 */ PFNGLLOGICOPPROC LogicOp;
        /*  291 */ PFNGLMAP1DPROC Map1d;
        /*  292 */ PFNGLMAP1FPROC Map1f;
        /*  293 */ PFNGLMAP2DPROC Map2d;
        /*  294 */ PFNGLMAP2FPROC Map2f;
        /*  295 */ PFNGLMAPBUFFERARBPROC MapBufferARB;
        /*  296 */ PFNGLMAPGRID1DPROC MapGrid1d;
        /*  297 */ PFNGLMAPGRID1FPROC MapGrid1f;
        /*  298 */ PFNGLMAPGRID2DPROC MapGrid2d;
        /*  299 */ PFNGLMAPGRID2FPROC MapGrid2f;
        /*  300 */ PFNGLMAPNAMEDBUFFEREXTPROC MapNamedBufferEXT;
        /*  301 */ PFNGLMAPNAMEDBUFFERRANGEEXTPROC MapNamedBufferRangeEXT;
        /*  302 */ PFNGLMATERIALFPROC Materialf;
        /*  303 */ PFNGLMATERIALFVPROC Materialfv;
        /*  304 */ PFNGLMATERIALIPROC Materiali;
        /*  305 */ PFNGLMATERIALIVPROC Materialiv;
        /*  306 */ PFNGLMATRIXFRUSTUMEXTPROC MatrixFrustumEXT;
        /*  307 */ PFNGLMATRIXLOADIDENTITYEXTPROC MatrixLoadIdentityEXT;
        /*  308 */ PFNGLMATRIXLOADTRANSPOSEDEXTPROC MatrixLoadTransposedEXT;
        /*  309 */ PFNGLMATRIXLOADTRANSPOSEFEXTPROC MatrixLoadTransposefEXT;
        /*  310 */ PFNGLMATRIXLOADDEXTPROC MatrixLoaddEXT;
        /*  311 */ PFNGLMATRIXLOADFEXTPROC MatrixLoadfEXT;
        /*  312 */ PFNGLMATRIXMODEPROC MatrixMode;
        /*  313 */ PFNGLMATRIXMULTTRANSPOSEDEXTPROC MatrixMultTransposedEXT;
        /*  314 */ PFNGLMATRIXMULTTRANSPOSEFEXTPROC MatrixMultTransposefEXT;
        /*  315 */ PFNGLMATRIXMULTDEXTPROC MatrixMultdEXT;
        /*  316 */ PFNGLMATRIXMULTFEXTPROC MatrixMultfEXT;
        /*  317 */ PFNGLMATRIXORTHOEXTPROC MatrixOrthoEXT;
        /*  318 */ PFNGLMATRIXPOPEXTPROC MatrixPopEXT;
        /*  319 */ PFNGLMATRIXPUSHEXTPROC MatrixPushEXT;
        /*  320 */ PFNGLMATRIXROTATEDEXTPROC MatrixRotatedEXT;
        /*  321 */ PFNGLMATRIXROTATEFEXTPROC MatrixRotatefEXT;
        /*  322 */ PFNGLMATRIXSCALEDEXTPROC MatrixScaledEXT;
        /*  323 */ PFNGLMATRIXSCALEFEXTPROC MatrixScalefEXT;
        /*  324 */ PFNGLMATRIXTRANSLATEDEXTPROC MatrixTranslatedEXT;
        /*  325 */ PFNGLMATRIXTRANSLATEFEXTPROC MatrixTranslatefEXT;
        /*  326 */ PFNGLMULTMATRIXDPROC MultMatrixd;
        /*  327 */ PFNGLMULTMATRIXFPROC MultMatrixf;
        /*  328 */ PFNGLMULTITEXBUFFEREXTPROC MultiTexBufferEXT;
        /*  329 */ PFNGLMULTITEXCOORDPOINTEREXTPROC MultiTexCoordPointerEXT;
        /*  330 */ PFNGLMULTITEXENVFEXTPROC MultiTexEnvfEXT;
        /*  331 */ PFNGLMULTITEXENVFVEXTPROC MultiTexEnvfvEXT;
        /*  332 */ PFNGLMULTITEXENVIEXTPROC MultiTexEnviEXT;
        /*  333 */ PFNGLMULTITEXENVIVEXTPROC MultiTexEnvivEXT;
        /*  334 */ PFNGLMULTITEXGENDEXTPROC MultiTexGendEXT;
        /*  335 */ PFNGLMULTITEXGENDVEXTPROC MultiTexGendvEXT;
        /*  336 */ PFNGLMULTITEXGENFEXTPROC MultiTexGenfEXT;
        /*  337 */ PFNGLMULTITEXGENFVEXTPROC MultiTexGenfvEXT;
        /*  338 */ PFNGLMULTITEXGENIEXTPROC MultiTexGeniEXT;
        /*  339 */ PFNGLMULTITEXGENIVEXTPROC MultiTexGenivEXT;
        /*  340 */ PFNGLMULTITEXIMAGE1DEXTPROC MultiTexImage1DEXT;
        /*  341 */ PFNGLMULTITEXIMAGE2DEXTPROC MultiTexImage2DEXT;
        /*  342 */ PFNGLMULTITEXIMAGE3DEXTPROC MultiTexImage3DEXT;
        /*  343 */ PFNGLMULTITEXPARAMETERIIVEXTPROC MultiTexParameterIivEXT;
        /*  344 */ PFNGLMULTITEXPARAMETERIUIVEXTPROC MultiTexParameterIuivEXT;
        /*  345 */ PFNGLMULTITEXPARAMETERFEXTPROC MultiTexParameterfEXT;
        /*  346 */ PFNGLMULTITEXPARAMETERFVEXTPROC MultiTexParameterfvEXT;
        /*  347 */ PFNGLMULTITEXPARAMETERIEXTPROC MultiTexParameteriEXT;
        /*  348 */ PFNGLMULTITEXPARAMETERIVEXTPROC MultiTexParameterivEXT;
        /*  349 */ PFNGLMULTITEXRENDERBUFFEREXTPROC MultiTexRenderbufferEXT;
        /*  350 */ PFNGLMULTITEXSUBIMAGE1DEXTPROC MultiTexSubImage1DEXT;
        /*  351 */ PFNGLMULTITEXSUBIMAGE2DEXTPROC MultiTexSubImage2DEXT;
        /*  352 */ PFNGLMULTITEXSUBIMAGE3DEXTPROC MultiTexSubImage3DEXT;
        /*  353 */ PFNGLNAMEDBUFFERDATAEXTPROC NamedBufferDataEXT;
        /*  354 */ PFNGLNAMEDBUFFERSTORAGEEXTPROC NamedBufferStorageEXT;
        /*  355 */ PFNGLNAMEDBUFFERSUBDATAEXTPROC NamedBufferSubDataEXT;
        /*  356 */ PFNGLNAMEDCOPYBUFFERSUBDATAEXTPROC NamedCopyBufferSubDataEXT;
        /*  357 */ PFNGLNAMEDFRAMEBUFFERPARAMETERIEXTPROC NamedFramebufferParameteriEXT;
        /*  358 */ PFNGLNAMEDFRAMEBUFFERRENDERBUFFEREXTPROC NamedFramebufferRenderbufferEXT;
        /*  359 */ PFNGLNAMEDFRAMEBUFFERTEXTURE1DEXTPROC NamedFramebufferTexture1DEXT;
        /*  360 */ PFNGLNAMEDFRAMEBUFFERTEXTURE2DEXTPROC NamedFramebufferTexture2DEXT;
        /*  361 */ PFNGLNAMEDFRAMEBUFFERTEXTURE3DEXTPROC NamedFramebufferTexture3DEXT;
        /*  362 */ PFNGLNAMEDFRAMEBUFFERTEXTUREEXTPROC NamedFramebufferTextureEXT;
        /*  363 */ PFNGLNAMEDFRAMEBUFFERTEXTUREFACEEXTPROC NamedFramebufferTextureFaceEXT;
        /*  364 */ PFNGLNAMEDFRAMEBUFFERTEXTURELAYEREXTPROC NamedFramebufferTextureLayerEXT;
        /*  365 */ PFNGLNAMEDPROGRAMLOCALPARAMETER4DEXTPROC NamedProgramLocalParameter4dEXT;
        /*  366 */ PFNGLNAMEDPROGRAMLOCALPARAMETER4DVEXTPROC NamedProgramLocalParameter4dvEXT;
        /*  367 */ PFNGLNAMEDPROGRAMLOCALPARAMETER4FEXTPROC NamedProgramLocalParameter4fEXT;
        /*  368 */ PFNGLNAMEDPROGRAMLOCALPARAMETER4FVEXTPROC NamedProgramLocalParameter4fvEXT;
        /*  369 */ PFNGLNAMEDPROGRAMLOCALPARAMETERI4IEXTPROC NamedProgramLocalParameterI4iEXT;
        /*  370 */ PFNGLNAMEDPROGRAMLOCALPARAMETERI4IVEXTPROC NamedProgramLocalParameterI4ivEXT;
        /*  371 */ PFNGLNAMEDPROGRAMLOCALPARAMETERI4UIEXTPROC NamedProgramLocalParameterI4uiEXT;
        /*  372 */ PFNGLNAMEDPROGRAMLOCALPARAMETERI4UIVEXTPROC NamedProgramLocalParameterI4uivEXT;
        /*  373 */ PFNGLNAMEDPROGRAMLOCALPARAMETERS4FVEXTPROC NamedProgramLocalParameters4fvEXT;
        /*  374 */ PFNGLNAMEDPROGRAMLOCALPARAMETERSI4IVEXTPROC NamedProgramLocalParametersI4ivEXT;
        /*  375 */ PFNGLNAMEDPROGRAMLOCALPARAMETERSI4UIVEXTPROC NamedProgramLocalParametersI4uivEXT;
        /*  376 */ PFNGLNAMEDPROGRAMSTRINGEXTPROC NamedProgramStringEXT;
        /*  377 */ PFNGLNAMEDRENDERBUFFERSTORAGEEXTPROC NamedRenderbufferStorageEXT;
        /*  378 */ PFNGLNAMEDRENDERBUFFERSTORAGEMULTISAMPLECOVERAGEEXTPROC NamedRenderbufferStorageMultisampleCoverageEXT;
        /*  379 */ PFNGLNAMEDRENDERBUFFERSTORAGEMULTISAMPLEEXTPROC NamedRenderbufferStorageMultisampleEXT;
        /*  380 */ PFNGLNEWLISTPROC NewList;
        /*  381 */ PFNGLNORMAL3BPROC Normal3b;
        /*  382 */ PFNGLNORMAL3BVPROC Normal3bv;
        /*  383 */ PFNGLNORMAL3DPROC Normal3d;
        /*  384 */ PFNGLNORMAL3DVPROC Normal3dv;
        /*  385 */ PFNGLNORMAL3FPROC Normal3f;
        /*  386 */ PFNGLNORMAL3FVPROC Normal3fv;
        /*  387 */ PFNGLNORMAL3IPROC Normal3i;
        /*  388 */ PFNGLNORMAL3IVPROC Normal3iv;
        /*  389 */ PFNGLNORMAL3SPROC Normal3s;
        /*  390 */ PFNGLNORMAL3SVPROC Normal3sv;
        /*  391 */ PFNGLNORMALPOINTERPROC NormalPointer;
        /*  392 */ PFNGLNORMALPOINTEREXTPROC NormalPointerEXT;
        /*  393 */ PFNGLOBJECTLABELPROC ObjectLabel;
        /*  394 */ PFNGLOBJECTPTRLABELPROC ObjectPtrLabel;
        /*  395 */ PFNGLORTHOPROC Ortho;
        /*  396 */ PFNGLPASSTHROUGHPROC PassThrough;
        /*  397 */ PFNGLPIXELMAPFVPROC PixelMapfv;
        /*  398 */ PFNGLPIXELMAPUIVPROC PixelMapuiv;
        /*  399 */ PFNGLPIXELMAPUSVPROC PixelMapusv;
        /*  400 */ PFNGLPIXELSTOREFPROC PixelStoref;
        /*  401 */ PFNGLPIXELSTOREIPROC PixelStorei;
        /*  402 */ PFNGLPIXELTRANSFERFPROC PixelTransferf;
        /*  403 */ PFNGLPIXELTRANSFERIPROC PixelTransferi;
        /*  404 */ PFNGLPIXELZOOMPROC PixelZoom;
        /*  405 */ PFNGLPOINTSIZEPROC PointSize;
        /*  406 */ PFNGLPOLYGONMODEPROC PolygonMode;
        /*  407 */ PFNGLPOLYGONOFFSETPROC PolygonOffset;
        /*  408 */ PFNGLPOLYGONSTIPPLEPROC PolygonStipple;
        /*  409 */ PFNGLPOPATTRIBPROC PopAttrib;
        /*  410 */ PFNGLPOPCLIENTATTRIBPROC PopClientAttrib;
        /*  411 */ PFNGLPOPDEBUGGROUPPROC PopDebugGroup;
        /*  412 */ PFNGLPOPMATRIXPROC PopMatrix;
        /*  413 */ PFNGLPOPNAMEPROC PopName;
        /*  414 */ PFNGLPRIORITIZETEXTURESPROC PrioritizeTextures;
        /*  415 */ PFNGLPRIORITIZETEXTURESEXTPROC PrioritizeTexturesEXT;
        /*  416 */ PFNGLPROGRAMUNIFORM1DEXTPROC ProgramUniform1dEXT;
        /*  417 */ PFNGLPROGRAMUNIFORM1DVEXTPROC ProgramUniform1dvEXT;
        /*  418 */ PFNGLPROGRAMUNIFORM1FEXTPROC ProgramUniform1fEXT;
        /*  419 */ PFNGLPROGRAMUNIFORM1FVEXTPROC ProgramUniform1fvEXT;
        /*  420 */ PFNGLPROGRAMUNIFORM1IEXTPROC ProgramUniform1iEXT;
        /*  421 */ PFNGLPROGRAMUNIFORM1IVEXTPROC ProgramUniform1ivEXT;
        /*  422 */ PFNGLPROGRAMUNIFORM1UIEXTPROC ProgramUniform1uiEXT;
        /*  423 */ PFNGLPROGRAMUNIFORM1UIVEXTPROC ProgramUniform1uivEXT;
        /*  424 */ PFNGLPROGRAMUNIFORM2DEXTPROC ProgramUniform2dEXT;
        /*  425 */ PFNGLPROGRAMUNIFORM2DVEXTPROC ProgramUniform2dvEXT;
        /*  426 */ PFNGLPROGRAMUNIFORM2FEXTPROC ProgramUniform2fEXT;
        /*  427 */ PFNGLPROGRAMUNIFORM2FVEXTPROC ProgramUniform2fvEXT;
        /*  428 */ PFNGLPROGRAMUNIFORM2IEXTPROC ProgramUniform2iEXT;
        /*  429 */ PFNGLPROGRAMUNIFORM2IVEXTPROC ProgramUniform2ivEXT;
        /*  430 */ PFNGLPROGRAMUNIFORM2UIEXTPROC ProgramUniform2uiEXT;
        /*  431 */ PFNGLPROGRAMUNIFORM2UIVEXTPROC ProgramUniform2uivEXT;
        /*  432 */ PFNGLPROGRAMUNIFORM3DEXTPROC ProgramUniform3dEXT;
        /*  433 */ PFNGLPROGRAMUNIFORM3DVEXTPROC ProgramUniform3dvEXT;
        /*  434 */ PFNGLPROGRAMUNIFORM3FEXTPROC ProgramUniform3fEXT;
        /*  435 */ PFNGLPROGRAMUNIFORM3FVEXTPROC ProgramUniform3fvEXT;
        /*  436 */ PFNGLPROGRAMUNIFORM3IEXTPROC ProgramUniform3iEXT;
        /*  437 */ PFNGLPROGRAMUNIFORM3IVEXTPROC ProgramUniform3ivEXT;
        /*  438 */ PFNGLPROGRAMUNIFORM3UIEXTPROC ProgramUniform3uiEXT;
        /*  439 */ PFNGLPROGRAMUNIFORM3UIVEXTPROC ProgramUniform3uivEXT;
        /*  440 */ PFNGLPROGRAMUNIFORM4DEXTPROC ProgramUniform4dEXT;
        /*  441 */ PFNGLPROGRAMUNIFORM4DVEXTPROC ProgramUniform4dvEXT;
        /*  442 */ PFNGLPROGRAMUNIFORM4FEXTPROC ProgramUniform4fEXT;
        /*  443 */ PFNGLPROGRAMUNIFORM4FVEXTPROC ProgramUniform4fvEXT;
        /*  444 */ PFNGLPROGRAMUNIFORM4IEXTPROC ProgramUniform4iEXT;
        /*  445 */ PFNGLPROGRAMUNIFORM4IVEXTPROC ProgramUniform4ivEXT;
        /*  446 */ PFNGLPROGRAMUNIFORM4UIEXTPROC ProgramUniform4uiEXT;
        /*  447 */ PFNGLPROGRAMUNIFORM4UIVEXTPROC ProgramUniform4uivEXT;
        /*  448 */ PFNGLPROGRAMUNIFORMMATRIX2DVEXTPROC ProgramUniformMatrix2dvEXT;
        /*  449 */ PFNGLPROGRAMUNIFORMMATRIX2FVEXTPROC ProgramUniformMatrix2fvEXT;
        /*  450 */ PFNGLPROGRAMUNIFORMMATRIX2X3DVEXTPROC ProgramUniformMatrix2x3dvEXT;
        /*  451 */ PFNGLPROGRAMUNIFORMMATRIX2X3FVEXTPROC ProgramUniformMatrix2x3fvEXT;
        /*  452 */ PFNGLPROGRAMUNIFORMMATRIX2X4DVEXTPROC ProgramUniformMatrix2x4dvEXT;
        /*  453 */ PFNGLPROGRAMUNIFORMMATRIX2X4FVEXTPROC ProgramUniformMatrix2x4fvEXT;
        /*  454 */ PFNGLPROGRAMUNIFORMMATRIX3DVEXTPROC ProgramUniformMatrix3dvEXT;
        /*  455 */ PFNGLPROGRAMUNIFORMMATRIX3FVEXTPROC ProgramUniformMatrix3fvEXT;
        /*  456 */ PFNGLPROGRAMUNIFORMMATRIX3X2DVEXTPROC ProgramUniformMatrix3x2dvEXT;
        /*  457 */ PFNGLPROGRAMUNIFORMMATRIX3X2FVEXTPROC ProgramUniformMatrix3x2fvEXT;
        /*  458 */ PFNGLPROGRAMUNIFORMMATRIX3X4DVEXTPROC ProgramUniformMatrix3x4dvEXT;
        /*  459 */ PFNGLPROGRAMUNIFORMMATRIX3X4FVEXTPROC ProgramUniformMatrix3x4fvEXT;
        /*  460 */ PFNGLPROGRAMUNIFORMMATRIX4DVEXTPROC ProgramUniformMatrix4dvEXT;
        /*  461 */ PFNGLPROGRAMUNIFORMMATRIX4FVEXTPROC ProgramUniformMatrix4fvEXT;
        /*  462 */ PFNGLPROGRAMUNIFORMMATRIX4X2DVEXTPROC ProgramUniformMatrix4x2dvEXT;
        /*  463 */ PFNGLPROGRAMUNIFORMMATRIX4X2FVEXTPROC ProgramUniformMatrix4x2fvEXT;
        /*  464 */ PFNGLPROGRAMUNIFORMMATRIX4X3DVEXTPROC ProgramUniformMatrix4x3dvEXT;
        /*  465 */ PFNGLPROGRAMUNIFORMMATRIX4X3FVEXTPROC ProgramUniformMatrix4x3fvEXT;
        /*  466 */ PFNGLPUSHATTRIBPROC PushAttrib;
        /*  467 */ PFNGLPUSHCLIENTATTRIBPROC PushClientAttrib;
        /*  468 */ PFNGLPUSHCLIENTATTRIBDEFAULTEXTPROC PushClientAttribDefaultEXT;
        /*  469 */ PFNGLPUSHDEBUGGROUPPROC PushDebugGroup;
        /*  470 */ PFNGLPUSHMATRIXPROC PushMatrix;
        /*  471 */ PFNGLPUSHNAMEPROC PushName;
        /*  472 */ PFNGLRASTERPOS2DPROC RasterPos2d;
        /*  473 */ PFNGLRASTERPOS2DVPROC RasterPos2dv;
        /*  474 */ PFNGLRASTERPOS2FPROC RasterPos2f;
        /*  475 */ PFNGLRASTERPOS2FVPROC RasterPos2fv;
        /*  476 */ PFNGLRASTERPOS2IPROC RasterPos2i;
        /*  477 */ PFNGLRASTERPOS2IVPROC RasterPos2iv;
        /*  478 */ PFNGLRASTERPOS2SPROC RasterPos2s;
        /*  479 */ PFNGLRASTERPOS2SVPROC RasterPos2sv;
        /*  480 */ PFNGLRASTERPOS3DPROC RasterPos3d;
        /*  481 */ PFNGLRASTERPOS3DVPROC RasterPos3dv;
        /*  482 */ PFNGLRASTERPOS3FPROC RasterPos3f;
        /*  483 */ PFNGLRASTERPOS3FVPROC RasterPos3fv;
        /*  484 */ PFNGLRASTERPOS3IPROC RasterPos3i;
        /*  485 */ PFNGLRASTERPOS3IVPROC RasterPos3iv;
        /*  486 */ PFNGLRASTERPOS3SPROC RasterPos3s;
        /*  487 */ PFNGLRASTERPOS3SVPROC RasterPos3sv;
        /*  488 */ PFNGLRASTERPOS4DPROC RasterPos4d;
        /*  489 */ PFNGLRASTERPOS4DVPROC RasterPos4dv;
        /*  490 */ PFNGLRASTERPOS4FPROC RasterPos4f;
        /*  491 */ PFNGLRASTERPOS4FVPROC RasterPos4fv;
        /*  492 */ PFNGLRASTERPOS4IPROC RasterPos4i;
        /*  493 */ PFNGLRASTERPOS4IVPROC RasterPos4iv;
        /*  494 */ PFNGLRASTERPOS4SPROC RasterPos4s;
        /*  495 */ PFNGLRASTERPOS4SVPROC RasterPos4sv;
        /*  496 */ PFNGLREADBUFFERPROC ReadBuffer;
        /*  497 */ PFNGLREADPIXELSPROC ReadPixels;
        /*  498 */ PFNGLRECTDPROC Rectd;
        /*  499 */ PFNGLRECTDVPROC Rectdv;
        /*  500 */ PFNGLRECTFPROC Rectf;
        /*  501 */ PFNGLRECTFVPROC Rectfv;
        /*  502 */ PFNGLRECTIPROC Recti;
        /*  503 */ PFNGLRECTIVPROC Rectiv;
        /*  504 */ PFNGLRECTSPROC Rects;
        /*  505 */ PFNGLRECTSVPROC Rectsv;
        /*  506 */ PFNGLRENDERMODEPROC RenderMode;
        /*  507 */ PFNGLROTATEDPROC Rotated;
        /*  508 */ PFNGLROTATEFPROC Rotatef;
        /*  509 */ PFNGLSCALEDPROC Scaled;
        /*  510 */ PFNGLSCALEFPROC Scalef;
        /*  511 */ PFNGLSCISSORPROC Scissor;
        /*  512 */ PFNGLSELECTBUFFERPROC SelectBuffer;
        /*  513 */ PFNGLSHADEMODELPROC ShadeModel;
        /*  514 */ PFNGLSTENCILFUNCPROC StencilFunc;
        /*  515 */ PFNGLSTENCILMASKPROC StencilMask;
        /*  516 */ PFNGLSTENCILOPPROC StencilOp;
        /*  517 */ PFNGLTEXCOORD1DPROC TexCoord1d;
        /*  518 */ PFNGLTEXCOORD1DVPROC TexCoord1dv;
        /*  519 */ PFNGLTEXCOORD1FPROC TexCoord1f;
        /*  520 */ PFNGLTEXCOORD1FVPROC TexCoord1fv;
        /*  521 */ PFNGLTEXCOORD1IPROC TexCoord1i;
        /*  522 */ PFNGLTEXCOORD1IVPROC TexCoord1iv;
        /*  523 */ PFNGLTEXCOORD1SPROC TexCoord1s;
        /*  524 */ PFNGLTEXCOORD1SVPROC TexCoord1sv;
        /*  525 */ PFNGLTEXCOORD2DPROC TexCoord2d;
        /*  526 */ PFNGLTEXCOORD2DVPROC TexCoord2dv;
        /*  527 */ PFNGLTEXCOORD2FPROC TexCoord2f;
        /*  528 */ PFNGLTEXCOORD2FVPROC TexCoord2fv;
        /*  529 */ PFNGLTEXCOORD2IPROC TexCoord2i;
        /*  530 */ PFNGLTEXCOORD2IVPROC TexCoord2iv;
        /*  531 */ PFNGLTEXCOORD2SPROC TexCoord2s;
        /*  532 */ PFNGLTEXCOORD2SVPROC TexCoord2sv;
        /*  533 */ PFNGLTEXCOORD3DPROC TexCoord3d;
        /*  534 */ PFNGLTEXCOORD3DVPROC TexCoord3dv;
        /*  535 */ PFNGLTEXCOORD3FPROC TexCoord3f;
        /*  536 */ PFNGLTEXCOORD3FVPROC TexCoord3fv;
        /*  537 */ PFNGLTEXCOORD3IPROC TexCoord3i;
        /*  538 */ PFNGLTEXCOORD3IVPROC TexCoord3iv;
        /*  539 */ PFNGLTEXCOORD3SPROC TexCoord3s;
        /*  540 */ PFNGLTEXCOORD3SVPROC TexCoord3sv;
        /*  541 */ PFNGLTEXCOORD4DPROC TexCoord4d;
        /*  542 */ PFNGLTEXCOORD4DVPROC TexCoord4dv;
        /*  543 */ PFNGLTEXCOORD4FPROC TexCoord4f;
        /*  544 */ PFNGLTEXCOORD4FVPROC TexCoord4fv;
        /*  545 */ PFNGLTEXCOORD4IPROC TexCoord4i;
        /*  546 */ PFNGLTEXCOORD4IVPROC TexCoord4iv;
        /*  547 */ PFNGLTEXCOORD4SPROC TexCoord4s;
        /*  548 */ PFNGLTEXCOORD4SVPROC TexCoord4sv;
        /*  549 */ PFNGLTEXCOORDPOINTERPROC TexCoordPointer;
        /*  550 */ PFNGLTEXCOORDPOINTEREXTPROC TexCoordPointerEXT;
        /*  551 */ PFNGLTEXENVFPROC TexEnvf;
        /*  552 */ PFNGLTEXENVFVPROC TexEnvfv;
        /*  553 */ PFNGLTEXENVIPROC TexEnvi;
        /*  554 */ PFNGLTEXENVIVPROC TexEnviv;
        /*  555 */ PFNGLTEXGENDPROC TexGend;
        /*  556 */ PFNGLTEXGENDVPROC TexGendv;
        /*  557 */ PFNGLTEXGENFPROC TexGenf;
        /*  558 */ PFNGLTEXGENFVPROC TexGenfv;
        /*  559 */ PFNGLTEXGENIPROC TexGeni;
        /*  560 */ PFNGLTEXGENIVPROC TexGeniv;
        /*  561 */ PFNGLTEXIMAGE1DPROC TexImage1D;
        /*  562 */ PFNGLTEXIMAGE2DPROC TexImage2D;
        /*  563 */ PFNGLTEXIMAGE3DPROC TexImage3D;
        /*  564 */ PFNGLTEXIMAGE3DEXTPROC TexImage3DEXT;
        /*  565 */ PFNGLTEXPARAMETERFPROC TexParameterf;
        /*  566 */ PFNGLTEXPARAMETERFVPROC TexParameterfv;
        /*  567 */ PFNGLTEXPARAMETERIPROC TexParameteri;
        /*  568 */ PFNGLTEXPARAMETERIVPROC TexParameteriv;
        /*  569 */ PFNGLTEXSTORAGE1DEXTPROC TexStorage1DEXT;
        /*  570 */ PFNGLTEXSTORAGE2DEXTPROC TexStorage2DEXT;
        /*  571 */ PFNGLTEXSTORAGE3DEXTPROC TexStorage3DEXT;
        /*  572 */ PFNGLTEXSUBIMAGE1DPROC TexSubImage1D;
        /*  573 */ PFNGLTEXSUBIMAGE1DEXTPROC TexSubImage1DEXT;
        /*  574 */ PFNGLTEXSUBIMAGE2DPROC TexSubImage2D;
        /*  575 */ PFNGLTEXSUBIMAGE2DEXTPROC TexSubImage2DEXT;
        /*  576 */ PFNGLTEXSUBIMAGE3DPROC TexSubImage3D;
        /*  577 */ PFNGLTEXSUBIMAGE3DEXTPROC TexSubImage3DEXT;
        /*  578 */ PFNGLTEXTUREBUFFEREXTPROC TextureBufferEXT;
        /*  579 */ PFNGLTEXTUREBUFFERRANGEEXTPROC TextureBufferRangeEXT;
        /*  580 */ PFNGLTEXTUREIMAGE1DEXTPROC TextureImage1DEXT;
        /*  581 */ PFNGLTEXTUREIMAGE2DEXTPROC TextureImage2DEXT;
        /*  582 */ PFNGLTEXTUREIMAGE3DEXTPROC TextureImage3DEXT;
        /*  583 */ PFNGLTEXTUREPAGECOMMITMENTEXTPROC TexturePageCommitmentEXT;
        /*  584 */ PFNGLTEXTUREPARAMETERIIVEXTPROC TextureParameterIivEXT;
        /*  585 */ PFNGLTEXTUREPARAMETERIUIVEXTPROC TextureParameterIuivEXT;
        /*  586 */ PFNGLTEXTUREPARAMETERFEXTPROC TextureParameterfEXT;
        /*  587 */ PFNGLTEXTUREPARAMETERFVEXTPROC TextureParameterfvEXT;
        /*  588 */ PFNGLTEXTUREPARAMETERIEXTPROC TextureParameteriEXT;
        /*  589 */ PFNGLTEXTUREPARAMETERIVEXTPROC TextureParameterivEXT;
        /*  590 */ PFNGLTEXTURERENDERBUFFEREXTPROC TextureRenderbufferEXT;
        /*  591 */ PFNGLTEXTURESTORAGE1DEXTPROC TextureStorage1DEXT;
        /*  592 */ PFNGLTEXTURESTORAGE2DEXTPROC TextureStorage2DEXT;
        /*  593 */ PFNGLTEXTURESTORAGE2DMULTISAMPLEEXTPROC TextureStorage2DMultisampleEXT;
        /*  594 */ PFNGLTEXTURESTORAGE3DEXTPROC TextureStorage3DEXT;
        /*  595 */ PFNGLTEXTURESTORAGE3DMULTISAMPLEEXTPROC TextureStorage3DMultisampleEXT;
        /*  596 */ PFNGLTEXTURESUBIMAGE1DEXTPROC TextureSubImage1DEXT;
        /*  597 */ PFNGLTEXTURESUBIMAGE2DEXTPROC TextureSubImage2DEXT;
        /*  598 */ PFNGLTEXTURESUBIMAGE3DEXTPROC TextureSubImage3DEXT;
        /*  599 */ PFNGLTRANSLATEDPROC Translated;
        /*  600 */ PFNGLTRANSLATEFPROC Translatef;
        /*  601 */ PFNGLUNMAPBUFFERARBPROC UnmapBufferARB;
        /*  602 */ PFNGLUNMAPNAMEDBUFFEREXTPROC UnmapNamedBufferEXT;
        /*  603 */ PFNGLVERTEX2DPROC Vertex2d;
        /*  604 */ PFNGLVERTEX2DVPROC Vertex2dv;
        /*  605 */ PFNGLVERTEX2FPROC Vertex2f;
        /*  606 */ PFNGLVERTEX2FVPROC Vertex2fv;
        /*  607 */ PFNGLVERTEX2IPROC Vertex2i;
        /*  608 */ PFNGLVERTEX2IVPROC Vertex2iv;
        /*  609 */ PFNGLVERTEX2SPROC Vertex2s;
        /*  610 */ PFNGLVERTEX2SVPROC Vertex2sv;
        /*  611 */ PFNGLVERTEX3DPROC Vertex3d;
        /*  612 */ PFNGLVERTEX3DVPROC Vertex3dv;
        /*  613 */ PFNGLVERTEX3FPROC Vertex3f;
        /*  614 */ PFNGLVERTEX3FVPROC Vertex3fv;
        /*  615 */ PFNGLVERTEX3IPROC Vertex3i;
        /*  616 */ PFNGLVERTEX3IVPROC Vertex3iv;
        /*  617 */ PFNGLVERTEX3SPROC Vertex3s;
        /*  618 */ PFNGLVERTEX3SVPROC Vertex3sv;
        /*  619 */ PFNGLVERTEX4DPROC Vertex4d;
        /*  620 */ PFNGLVERTEX4DVPROC Vertex4dv;
        /*  621 */ PFNGLVERTEX4FPROC Vertex4f;
        /*  622 */ PFNGLVERTEX4FVPROC Vertex4fv;
        /*  623 */ PFNGLVERTEX4IPROC Vertex4i;
        /*  624 */ PFNGLVERTEX4IVPROC Vertex4iv;
        /*  625 */ PFNGLVERTEX4SPROC Vertex4s;
        /*  626 */ PFNGLVERTEX4SVPROC Vertex4sv;
        /*  627 */ PFNGLVERTEXARRAYBINDVERTEXBUFFEREXTPROC VertexArrayBindVertexBufferEXT;
        /*  628 */ PFNGLVERTEXARRAYCOLOROFFSETEXTPROC VertexArrayColorOffsetEXT;
        /*  629 */ PFNGLVERTEXARRAYEDGEFLAGOFFSETEXTPROC VertexArrayEdgeFlagOffsetEXT;
        /*  630 */ PFNGLVERTEXARRAYFOGCOORDOFFSETEXTPROC VertexArrayFogCoordOffsetEXT;
        /*  631 */ PFNGLVERTEXARRAYINDEXOFFSETEXTPROC VertexArrayIndexOffsetEXT;
        /*  632 */ PFNGLVERTEXARRAYMULTITEXCOORDOFFSETEXTPROC VertexArrayMultiTexCoordOffsetEXT;
        /*  633 */ PFNGLVERTEXARRAYNORMALOFFSETEXTPROC VertexArrayNormalOffsetEXT;
        /*  634 */ PFNGLVERTEXARRAYSECONDARYCOLOROFFSETEXTPROC VertexArraySecondaryColorOffsetEXT;
        /*  635 */ PFNGLVERTEXARRAYTEXCOORDOFFSETEXTPROC VertexArrayTexCoordOffsetEXT;
        /*  636 */ PFNGLVERTEXARRAYVERTEXATTRIBBINDINGEXTPROC VertexArrayVertexAttribBindingEXT;
        /*  637 */ PFNGLVERTEXARRAYVERTEXATTRIBDIVISOREXTPROC VertexArrayVertexAttribDivisorEXT;
        /*  638 */ PFNGLVERTEXARRAYVERTEXATTRIBFORMATEXTPROC VertexArrayVertexAttribFormatEXT;
        /*  639 */ PFNGLVERTEXARRAYVERTEXATTRIBIFORMATEXTPROC VertexArrayVertexAttribIFormatEXT;
        /*  640 */ PFNGLVERTEXARRAYVERTEXATTRIBIOFFSETEXTPROC VertexArrayVertexAttribIOffsetEXT;
        /*  641 */ PFNGLVERTEXARRAYVERTEXATTRIBLFORMATEXTPROC VertexArrayVertexAttribLFormatEXT;
        /*  642 */ PFNGLVERTEXARRAYVERTEXATTRIBLOFFSETEXTPROC VertexArrayVertexAttribLOffsetEXT;
        /*  643 */ PFNGLVERTEXARRAYVERTEXATTRIBOFFSETEXTPROC VertexArrayVertexAttribOffsetEXT;
        /*  644 */ PFNGLVERTEXARRAYVERTEXBINDINGDIVISOREXTPROC VertexArrayVertexBindingDivisorEXT;
        /*  645 */ PFNGLVERTEXARRAYVERTEXOFFSETEXTPROC VertexArrayVertexOffsetEXT;
        /*  646 */ PFNGLVERTEXPOINTERPROC VertexPointer;
        /*  647 */ PFNGLVERTEXPOINTEREXTPROC VertexPointerEXT;
        /*  648 */ PFNGLVIEWPORTPROC Viewport;
        /*  649 */ PFNGLACTIVESHADERPROGRAMPROC ActiveShaderProgram;
        /*  650 */ PFNGLACTIVESHADERPROGRAMEXTPROC ActiveShaderProgramEXT;
        /*  651 */ PFNGLACTIVETEXTUREPROC ActiveTexture;
        /*  652 */ PFNGLATTACHSHADERPROC AttachShader;
        /*  653 */ PFNGLBEGINQUERYPROC BeginQuery;
        /*  654 */ PFNGLBEGINQUERYEXTPROC BeginQueryEXT;
        /*  655 */ PFNGLBEGINTRANSFORMFEEDBACKPROC BeginTransformFeedback;
        /*  656 */ PFNGLBINDATTRIBLOCATIONPROC BindAttribLocation;
        /*  657 */ PFNGLBINDBUFFERPROC BindBuffer;
        /*  658 */ PFNGLBINDBUFFERBASEPROC BindBufferBase;
        /*  659 */ PFNGLBINDBUFFERRANGEPROC BindBufferRange;
        /*  660 */ PFNGLBINDFRAMEBUFFERPROC BindFramebuffer;
        /*  661 */ PFNGLBINDIMAGETEXTUREPROC BindImageTexture;
        /*  662 */ PFNGLBINDPROGRAMPIPELINEPROC BindProgramPipeline;
        /*  663 */ PFNGLBINDPROGRAMPIPELINEEXTPROC BindProgramPipelineEXT;
        /*  664 */ PFNGLBINDRENDERBUFFERPROC BindRenderbuffer;
        /*  665 */ PFNGLBINDSAMPLERPROC BindSampler;
        /*  666 */ PFNGLBINDTRANSFORMFEEDBACKPROC BindTransformFeedback;
        /*  667 */ PFNGLBINDVERTEXARRAYPROC BindVertexArray;
        /*  668 */ PFNGLBINDVERTEXARRAYOESPROC BindVertexArrayOES;
        /*  669 */ PFNGLBINDVERTEXBUFFERPROC BindVertexBuffer;
        /*  670 */ PFNGLBLENDBARRIERPROC BlendBarrier;
        /*  671 */ PFNGLBLENDBARRIERKHRPROC BlendBarrierKHR;
        /*  672 */ PFNGLBLENDBARRIERNVPROC BlendBarrierNV;
        /*  673 */ PFNGLBLENDCOLORPROC BlendColor;
        /*  674 */ PFNGLBLENDEQUATIONPROC BlendEquation;
        /*  675 */ PFNGLBLENDEQUATIONSEPARATEPROC BlendEquationSeparate;
        /*  676 */ PFNGLBLENDEQUATIONSEPARATEIPROC BlendEquationSeparatei;
        /*  677 */ PFNGLBLENDEQUATIONSEPARATEIEXTPROC BlendEquationSeparateiEXT;
        /*  678 */ PFNGLBLENDEQUATIONSEPARATEIOESPROC BlendEquationSeparateiOES;
        /*  679 */ PFNGLBLENDEQUATIONIPROC BlendEquationi;
        /*  680 */ PFNGLBLENDEQUATIONIEXTPROC BlendEquationiEXT;
        /*  681 */ PFNGLBLENDEQUATIONIOESPROC BlendEquationiOES;
        /*  682 */ PFNGLBLENDFUNCSEPARATEPROC BlendFuncSeparate;
        /*  683 */ PFNGLBLENDFUNCSEPARATEIPROC BlendFuncSeparatei;
        /*  684 */ PFNGLBLENDFUNCSEPARATEIEXTPROC BlendFuncSeparateiEXT;
        /*  685 */ PFNGLBLENDFUNCSEPARATEIOESPROC BlendFuncSeparateiOES;
        /*  686 */ PFNGLBLENDFUNCIPROC BlendFunci;
        /*  687 */ PFNGLBLENDFUNCIEXTPROC BlendFunciEXT;
        /*  688 */ PFNGLBLENDFUNCIOESPROC BlendFunciOES;
        /*  689 */ PFNGLBLENDPARAMETERINVPROC BlendParameteriNV;
        /*  690 */ PFNGLBLITFRAMEBUFFERPROC BlitFramebuffer;
        /*  691 */ PFNGLBLITFRAMEBUFFERNVPROC BlitFramebufferNV;
        /*  692 */ PFNGLBUFFERDATAPROC BufferData;
        /*  693 */ PFNGLBUFFERSUBDATAPROC BufferSubData;
        /*  694 */ PFNGLCHECKFRAMEBUFFERSTATUSPROC CheckFramebufferStatus;
        /*  695 */ PFNGLCLEARBUFFERFIPROC ClearBufferfi;
        /*  696 */ PFNGLCLEARBUFFERFVPROC ClearBufferfv;
        /*  697 */ PFNGLCLEARBUFFERIVPROC ClearBufferiv;
        /*  698 */ PFNGLCLEARBUFFERUIVPROC ClearBufferuiv;
        /*  699 */ PFNGLCLEARDEPTHFPROC ClearDepthf;
        /*  700 */ PFNGLCLIENTWAITSYNCPROC ClientWaitSync;
        /*  701 */ PFNGLCLIENTWAITSYNCAPPLEPROC ClientWaitSyncAPPLE;
        /*  702 */ PFNGLCOLORMASKIPROC ColorMaski;
        /*  703 */ PFNGLCOLORMASKIEXTPROC ColorMaskiEXT;
        /*  704 */ PFNGLCOLORMASKIOESPROC ColorMaskiOES;
        /*  705 */ PFNGLCOMPILESHADERPROC CompileShader;
        /*  706 */ PFNGLCOMPRESSEDTEXIMAGE2DPROC CompressedTexImage2D;
        /*  707 */ PFNGLCOMPRESSEDTEXIMAGE3DPROC CompressedTexImage3D;
        /*  708 */ PFNGLCOMPRESSEDTEXSUBIMAGE2DPROC CompressedTexSubImage2D;
        /*  709 */ PFNGLCOMPRESSEDTEXSUBIMAGE3DPROC CompressedTexSubImage3D;
        /*  710 */ PFNGLCOPYBUFFERSUBDATAPROC CopyBufferSubData;
        /*  711 */ PFNGLCOPYBUFFERSUBDATANVPROC CopyBufferSubDataNV;
        /*  712 */ PFNGLCOPYIMAGESUBDATAPROC CopyImageSubData;
        /*  713 */ PFNGLCOPYIMAGESUBDATAEXTPROC CopyImageSubDataEXT;
        /*  714 */ PFNGLCOPYIMAGESUBDATAOESPROC CopyImageSubDataOES;
        /*  715 */ PFNGLCREATEPROGRAMPROC CreateProgram;
        /*  716 */ PFNGLCREATESHADERPROC CreateShader;
        /*  717 */ PFNGLCREATESHADERPROGRAMVPROC CreateShaderProgramv;
        /*  718 */ PFNGLCREATESHADERPROGRAMVEXTPROC CreateShaderProgramvEXT;
        /*  719 */ PFNGLDEBUGMESSAGECALLBACKKHRPROC DebugMessageCallbackKHR;
        /*  720 */ PFNGLDEBUGMESSAGECONTROLKHRPROC DebugMessageControlKHR;
        /*  721 */ PFNGLDEBUGMESSAGEINSERTKHRPROC DebugMessageInsertKHR;
        /*  722 */ PFNGLDELETEBUFFERSPROC DeleteBuffers;
        /*  723 */ PFNGLDELETEFRAMEBUFFERSPROC DeleteFramebuffers;
        /*  724 */ PFNGLDELETEPROGRAMPROC DeleteProgram;
        /*  725 */ PFNGLDELETEPROGRAMPIPELINESPROC DeleteProgramPipelines;
        /*  726 */ PFNGLDELETEPROGRAMPIPELINESEXTPROC DeleteProgramPipelinesEXT;
        /*  727 */ PFNGLDELETEQUERIESPROC DeleteQueries;
        /*  728 */ PFNGLDELETEQUERIESEXTPROC DeleteQueriesEXT;
        /*  729 */ PFNGLDELETERENDERBUFFERSPROC DeleteRenderbuffers;
        /*  730 */ PFNGLDELETESAMPLERSPROC DeleteSamplers;
        /*  731 */ PFNGLDELETESHADERPROC DeleteShader;
        /*  732 */ PFNGLDELETESYNCPROC DeleteSync;
        /*  733 */ PFNGLDELETESYNCAPPLEPROC DeleteSyncAPPLE;
        /*  734 */ PFNGLDELETETRANSFORMFEEDBACKSPROC DeleteTransformFeedbacks;
        /*  735 */ PFNGLDELETEVERTEXARRAYSPROC DeleteVertexArrays;
        /*  736 */ PFNGLDELETEVERTEXARRAYSOESPROC DeleteVertexArraysOES;
        /*  737 */ PFNGLDEPTHRANGEARRAYFVNVPROC DepthRangeArrayfvNV;
        /*  738 */ PFNGLDEPTHRANGEARRAYFVOESPROC DepthRangeArrayfvOES;
        /*  739 */ PFNGLDEPTHRANGEINDEXEDFNVPROC DepthRangeIndexedfNV;
        /*  740 */ PFNGLDEPTHRANGEINDEXEDFOESPROC DepthRangeIndexedfOES;
        /*  741 */ PFNGLDEPTHRANGEFPROC DepthRangef;
        /*  742 */ PFNGLDETACHSHADERPROC DetachShader;
        /*  743 */ PFNGLDISABLEVERTEXATTRIBARRAYPROC DisableVertexAttribArray;
        /*  744 */ PFNGLDISABLEIPROC Disablei;
        /*  745 */ PFNGLDISABLEIEXTPROC DisableiEXT;
        /*  746 */ PFNGLDISABLEINVPROC DisableiNV;
        /*  747 */ PFNGLDISABLEIOESPROC DisableiOES;
        /*  748 */ PFNGLDISPATCHCOMPUTEPROC DispatchCompute;
        /*  749 */ PFNGLDISPATCHCOMPUTEINDIRECTPROC DispatchComputeIndirect;
        /*  750 */ PFNGLDRAWARRAYSINDIRECTPROC DrawArraysIndirect;
        /*  751 */ PFNGLDRAWARRAYSINSTANCEDPROC DrawArraysInstanced;
        /*  752 */ PFNGLDRAWARRAYSINSTANCEDANGLEPROC DrawArraysInstancedANGLE;
        /*  753 */ PFNGLDRAWARRAYSINSTANCEDEXTPROC DrawArraysInstancedEXT;
        /*  754 */ PFNGLDRAWARRAYSINSTANCEDNVPROC DrawArraysInstancedNV;
        /*  755 */ PFNGLDRAWBUFFERSPROC DrawBuffers;
        /*  756 */ PFNGLDRAWBUFFERSEXTPROC DrawBuffersEXT;
        /*  757 */ PFNGLDRAWELEMENTSBASEVERTEXPROC DrawElementsBaseVertex;
        /*  758 */ PFNGLDRAWELEMENTSBASEVERTEXEXTPROC DrawElementsBaseVertexEXT;
        /*  759 */ PFNGLDRAWELEMENTSBASEVERTEXOESPROC DrawElementsBaseVertexOES;
        /*  760 */ PFNGLDRAWELEMENTSINDIRECTPROC DrawElementsIndirect;
        /*  761 */ PFNGLDRAWELEMENTSINSTANCEDPROC DrawElementsInstanced;
        /*  762 */ PFNGLDRAWELEMENTSINSTANCEDANGLEPROC DrawElementsInstancedANGLE;
        /*  763 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXPROC DrawElementsInstancedBaseVertex;
        /*  764 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXEXTPROC DrawElementsInstancedBaseVertexEXT;
        /*  765 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXOESPROC DrawElementsInstancedBaseVertexOES;
        /*  766 */ PFNGLDRAWELEMENTSINSTANCEDEXTPROC DrawElementsInstancedEXT;
        /*  767 */ PFNGLDRAWELEMENTSINSTANCEDNVPROC DrawElementsInstancedNV;
        /*  768 */ PFNGLDRAWRANGEELEMENTSBASEVERTEXPROC DrawRangeElementsBaseVertex;
        /*  769 */ PFNGLDRAWRANGEELEMENTSBASEVERTEXEXTPROC DrawRangeElementsBaseVertexEXT;
        /*  770 */ PFNGLDRAWRANGEELEMENTSBASEVERTEXOESPROC DrawRangeElementsBaseVertexOES;
        /*  771 */ PFNGLENABLEVERTEXATTRIBARRAYPROC EnableVertexAttribArray;
        /*  772 */ PFNGLENABLEIPROC Enablei;
        /*  773 */ PFNGLENABLEIEXTPROC EnableiEXT;
        /*  774 */ PFNGLENABLEINVPROC EnableiNV;
        /*  775 */ PFNGLENABLEIOESPROC EnableiOES;
        /*  776 */ PFNGLENDQUERYPROC EndQuery;
        /*  777 */ PFNGLENDQUERYEXTPROC EndQueryEXT;
        /*  778 */ PFNGLENDTRANSFORMFEEDBACKPROC EndTransformFeedback;
        /*  779 */ PFNGLFENCESYNCPROC FenceSync;
        /*  780 */ PFNGLFENCESYNCAPPLEPROC FenceSyncAPPLE;
        /*  781 */ PFNGLFLUSHMAPPEDBUFFERRANGEPROC FlushMappedBufferRange;
        /*  782 */ PFNGLFLUSHMAPPEDBUFFERRANGEEXTPROC FlushMappedBufferRangeEXT;
        /*  783 */ PFNGLFRAMEBUFFERPARAMETERIPROC FramebufferParameteri;
        /*  784 */ PFNGLFRAMEBUFFERRENDERBUFFERPROC FramebufferRenderbuffer;
        /*  785 */ PFNGLFRAMEBUFFERTEXTUREPROC FramebufferTexture;
        /*  786 */ PFNGLFRAMEBUFFERTEXTURE2DPROC FramebufferTexture2D;
        /*  787 */ PFNGLFRAMEBUFFERTEXTURE2DMULTISAMPLEEXTPROC FramebufferTexture2DMultisampleEXT;
        /*  788 */ PFNGLFRAMEBUFFERTEXTUREEXTPROC FramebufferTextureEXT;
        /*  789 */ PFNGLFRAMEBUFFERTEXTURELAYERPROC FramebufferTextureLayer;
        /*  790 */ PFNGLFRAMEBUFFERTEXTUREOESPROC FramebufferTextureOES;
        /*  791 */ PFNGLGENBUFFERSPROC GenBuffers;
        /*  792 */ PFNGLGENFRAMEBUFFERSPROC GenFramebuffers;
        /*  793 */ PFNGLGENPROGRAMPIPELINESPROC GenProgramPipelines;
        /*  794 */ PFNGLGENPROGRAMPIPELINESEXTPROC GenProgramPipelinesEXT;
        /*  795 */ PFNGLGENQUERIESPROC GenQueries;
        /*  796 */ PFNGLGENQUERIESEXTPROC GenQueriesEXT;
        /*  797 */ PFNGLGENRENDERBUFFERSPROC GenRenderbuffers;
        /*  798 */ PFNGLGENSAMPLERSPROC GenSamplers;
        /*  799 */ PFNGLGENTRANSFORMFEEDBACKSPROC GenTransformFeedbacks;
        /*  800 */ PFNGLGENVERTEXARRAYSPROC GenVertexArrays;
        /*  801 */ PFNGLGENVERTEXARRAYSOESPROC GenVertexArraysOES;
        /*  802 */ PFNGLGENERATEMIPMAPPROC GenerateMipmap;
        /*  803 */ PFNGLGETACTIVEATTRIBPROC GetActiveAttrib;
        /*  804 */ PFNGLGETACTIVEUNIFORMPROC GetActiveUniform;
        /*  805 */ PFNGLGETACTIVEUNIFORMBLOCKNAMEPROC GetActiveUniformBlockName;
        /*  806 */ PFNGLGETACTIVEUNIFORMBLOCKIVPROC GetActiveUniformBlockiv;
        /*  807 */ PFNGLGETACTIVEUNIFORMSIVPROC GetActiveUniformsiv;
        /*  808 */ PFNGLGETATTACHEDSHADERSPROC GetAttachedShaders;
        /*  809 */ PFNGLGETATTRIBLOCATIONPROC GetAttribLocation;
        /*  810 */ PFNGLGETBOOLEANI_VPROC GetBooleani_v;
        /*  811 */ PFNGLGETBUFFERPARAMETERI64VPROC GetBufferParameteri64v;
        /*  812 */ PFNGLGETBUFFERPARAMETERIVPROC GetBufferParameteriv;
        /*  813 */ PFNGLGETBUFFERPOINTERVPROC GetBufferPointerv;
        /*  814 */ PFNGLGETBUFFERPOINTERVOESPROC GetBufferPointervOES;
        /*  815 */ PFNGLGETDEBUGMESSAGELOGKHRPROC GetDebugMessageLogKHR;
        /*  816 */ PFNGLGETFLOATI_VNVPROC GetFloati_vNV;
        /*  817 */ PFNGLGETFLOATI_VOESPROC GetFloati_vOES;
        /*  818 */ PFNGLGETFRAGDATALOCATIONPROC GetFragDataLocation;
        /*  819 */ PFNGLGETFRAMEBUFFERATTACHMENTPARAMETERIVPROC GetFramebufferAttachmentParameteriv;
        /*  820 */ PFNGLGETFRAMEBUFFERPARAMETERIVPROC GetFramebufferParameteriv;
        /*  821 */ PFNGLGETGRAPHICSRESETSTATUSPROC GetGraphicsResetStatus;
        /*  822 */ PFNGLGETGRAPHICSRESETSTATUSEXTPROC GetGraphicsResetStatusEXT;
        /*  823 */ PFNGLGETGRAPHICSRESETSTATUSKHRPROC GetGraphicsResetStatusKHR;
        /*  824 */ PFNGLGETINTEGER64I_VPROC GetInteger64i_v;
        /*  825 */ PFNGLGETINTEGER64VPROC GetInteger64v;
        /*  826 */ PFNGLGETINTEGER64VAPPLEPROC GetInteger64vAPPLE;
        /*  827 */ PFNGLGETINTEGER64VEXTPROC GetInteger64vEXT;
        /*  828 */ PFNGLGETINTEGERI_VPROC GetIntegeri_v;
        /*  829 */ PFNGLGETINTERNALFORMATIVPROC GetInternalformativ;
        /*  830 */ PFNGLGETMULTISAMPLEFVPROC GetMultisamplefv;
        /*  831 */ PFNGLGETOBJECTLABELKHRPROC GetObjectLabelKHR;
        /*  832 */ PFNGLGETOBJECTPTRLABELKHRPROC GetObjectPtrLabelKHR;
        /*  833 */ PFNGLGETPOINTERVKHRPROC GetPointervKHR;
        /*  834 */ PFNGLGETPROGRAMBINARYPROC GetProgramBinary;
        /*  835 */ PFNGLGETPROGRAMBINARYOESPROC GetProgramBinaryOES;
        /*  836 */ PFNGLGETPROGRAMINFOLOGPROC GetProgramInfoLog;
        /*  837 */ PFNGLGETPROGRAMINTERFACEIVPROC GetProgramInterfaceiv;
        /*  838 */ PFNGLGETPROGRAMPIPELINEINFOLOGPROC GetProgramPipelineInfoLog;
        /*  839 */ PFNGLGETPROGRAMPIPELINEINFOLOGEXTPROC GetProgramPipelineInfoLogEXT;
        /*  840 */ PFNGLGETPROGRAMPIPELINEIVPROC GetProgramPipelineiv;
        /*  841 */ PFNGLGETPROGRAMPIPELINEIVEXTPROC GetProgramPipelineivEXT;
        /*  842 */ PFNGLGETPROGRAMRESOURCEINDEXPROC GetProgramResourceIndex;
        /*  843 */ PFNGLGETPROGRAMRESOURCELOCATIONPROC GetProgramResourceLocation;
        /*  844 */ PFNGLGETPROGRAMRESOURCENAMEPROC GetProgramResourceName;
        /*  845 */ PFNGLGETPROGRAMRESOURCEIVPROC GetProgramResourceiv;
        /*  846 */ PFNGLGETPROGRAMIVPROC GetProgramiv;
        /*  847 */ PFNGLGETQUERYOBJECTI64VEXTPROC GetQueryObjecti64vEXT;
        /*  848 */ PFNGLGETQUERYOBJECTIVEXTPROC GetQueryObjectivEXT;
        /*  849 */ PFNGLGETQUERYOBJECTUI64VEXTPROC GetQueryObjectui64vEXT;
        /*  850 */ PFNGLGETQUERYOBJECTUIVPROC GetQueryObjectuiv;
        /*  851 */ PFNGLGETQUERYOBJECTUIVEXTPROC GetQueryObjectuivEXT;
        /*  852 */ PFNGLGETQUERYIVPROC GetQueryiv;
        /*  853 */ PFNGLGETQUERYIVEXTPROC GetQueryivEXT;
        /*  854 */ PFNGLGETRENDERBUFFERPARAMETERIVPROC GetRenderbufferParameteriv;
        /*  855 */ PFNGLGETSAMPLERPARAMETERIIVPROC GetSamplerParameterIiv;
        /*  856 */ PFNGLGETSAMPLERPARAMETERIIVEXTPROC GetSamplerParameterIivEXT;
        /*  857 */ PFNGLGETSAMPLERPARAMETERIIVOESPROC GetSamplerParameterIivOES;
        /*  858 */ PFNGLGETSAMPLERPARAMETERIUIVPROC GetSamplerParameterIuiv;
        /*  859 */ PFNGLGETSAMPLERPARAMETERIUIVEXTPROC GetSamplerParameterIuivEXT;
        /*  860 */ PFNGLGETSAMPLERPARAMETERIUIVOESPROC GetSamplerParameterIuivOES;
        /*  861 */ PFNGLGETSAMPLERPARAMETERFVPROC GetSamplerParameterfv;
        /*  862 */ PFNGLGETSAMPLERPARAMETERIVPROC GetSamplerParameteriv;
        /*  863 */ PFNGLGETSHADERINFOLOGPROC GetShaderInfoLog;
        /*  864 */ PFNGLGETSHADERPRECISIONFORMATPROC GetShaderPrecisionFormat;
        /*  865 */ PFNGLGETSHADERSOURCEPROC GetShaderSource;
        /*  866 */ PFNGLGETSHADERIVPROC GetShaderiv;
        /*  867 */ PFNGLGETSTRINGIPROC GetStringi;
        /*  868 */ PFNGLGETSYNCIVPROC GetSynciv;
        /*  869 */ PFNGLGETSYNCIVAPPLEPROC GetSyncivAPPLE;
        /*  870 */ PFNGLGETTEXPARAMETERIIVPROC GetTexParameterIiv;
        /*  871 */ PFNGLGETTEXPARAMETERIIVEXTPROC GetTexParameterIivEXT;
        /*  872 */ PFNGLGETTEXPARAMETERIIVOESPROC GetTexParameterIivOES;
        /*  873 */ PFNGLGETTEXPARAMETERIUIVPROC GetTexParameterIuiv;
        /*  874 */ PFNGLGETTEXPARAMETERIUIVEXTPROC GetTexParameterIuivEXT;
        /*  875 */ PFNGLGETTEXPARAMETERIUIVOESPROC GetTexParameterIuivOES;
        /*  876 */ PFNGLGETTRANSFORMFEEDBACKVARYINGPROC GetTransformFeedbackVarying;
        /*  877 */ PFNGLGETUNIFORMBLOCKINDEXPROC GetUniformBlockIndex;
        /*  878 */ PFNGLGETUNIFORMINDICESPROC GetUniformIndices;
        /*  879 */ PFNGLGETUNIFORMLOCATIONPROC GetUniformLocation;
        /*  880 */ PFNGLGETUNIFORMFVPROC GetUniformfv;
        /*  881 */ PFNGLGETUNIFORMIVPROC GetUniformiv;
        /*  882 */ PFNGLGETUNIFORMUIVPROC GetUniformuiv;
        /*  883 */ PFNGLGETVERTEXATTRIBIIVPROC GetVertexAttribIiv;
        /*  884 */ PFNGLGETVERTEXATTRIBIUIVPROC GetVertexAttribIuiv;
        /*  885 */ PFNGLGETVERTEXATTRIBPOINTERVPROC GetVertexAttribPointerv;
        /*  886 */ PFNGLGETVERTEXATTRIBFVPROC GetVertexAttribfv;
        /*  887 */ PFNGLGETVERTEXATTRIBIVPROC GetVertexAttribiv;
        /*  888 */ PFNGLGETNUNIFORMFVPROC GetnUniformfv;
        /*  889 */ PFNGLGETNUNIFORMFVEXTPROC GetnUniformfvEXT;
        /*  890 */ PFNGLGETNUNIFORMFVKHRPROC GetnUniformfvKHR;
        /*  891 */ PFNGLGETNUNIFORMIVPROC GetnUniformiv;
        /*  892 */ PFNGLGETNUNIFORMIVEXTPROC GetnUniformivEXT;
        /*  893 */ PFNGLGETNUNIFORMIVKHRPROC GetnUniformivKHR;
        /*  894 */ PFNGLGETNUNIFORMUIVPROC GetnUniformuiv;
        /*  895 */ PFNGLGETNUNIFORMUIVKHRPROC GetnUniformuivKHR;
        /*  896 */ PFNGLINVALIDATEFRAMEBUFFERPROC InvalidateFramebuffer;
        /*  897 */ PFNGLINVALIDATESUBFRAMEBUFFERPROC InvalidateSubFramebuffer;
        /*  898 */ PFNGLISBUFFERPROC IsBuffer;
        /*  899 */ PFNGLISENABLEDIPROC IsEnabledi;
        /*  900 */ PFNGLISENABLEDIEXTPROC IsEnablediEXT;
        /*  901 */ PFNGLISENABLEDINVPROC IsEnablediNV;
        /*  902 */ PFNGLISENABLEDIOESPROC IsEnablediOES;
        /*  903 */ PFNGLISFRAMEBUFFERPROC IsFramebuffer;
        /*  904 */ PFNGLISPROGRAMPROC IsProgram;
        /*  905 */ PFNGLISPROGRAMPIPELINEPROC IsProgramPipeline;
        /*  906 */ PFNGLISPROGRAMPIPELINEEXTPROC IsProgramPipelineEXT;
        /*  907 */ PFNGLISQUERYPROC IsQuery;
        /*  908 */ PFNGLISQUERYEXTPROC IsQueryEXT;
        /*  909 */ PFNGLISRENDERBUFFERPROC IsRenderbuffer;
        /*  910 */ PFNGLISSAMPLERPROC IsSampler;
        /*  911 */ PFNGLISSHADERPROC IsShader;
        /*  912 */ PFNGLISSYNCPROC IsSync;
        /*  913 */ PFNGLISSYNCAPPLEPROC IsSyncAPPLE;
        /*  914 */ PFNGLISTRANSFORMFEEDBACKPROC IsTransformFeedback;
        /*  915 */ PFNGLISVERTEXARRAYPROC IsVertexArray;
        /*  916 */ PFNGLISVERTEXARRAYOESPROC IsVertexArrayOES;
        /*  917 */ PFNGLLINKPROGRAMPROC LinkProgram;
        /*  918 */ PFNGLMAPBUFFEROESPROC MapBufferOES;
        /*  919 */ PFNGLMAPBUFFERRANGEPROC MapBufferRange;
        /*  920 */ PFNGLMAPBUFFERRANGEEXTPROC MapBufferRangeEXT;
        /*  921 */ PFNGLMEMORYBARRIERPROC MemoryBarrier;
        /*  922 */ PFNGLMEMORYBARRIERBYREGIONPROC MemoryBarrierByRegion;
        /*  923 */ PFNGLMINSAMPLESHADINGPROC MinSampleShading;
        /*  924 */ PFNGLMINSAMPLESHADINGOESPROC MinSampleShadingOES;
        /*  925 */ PFNGLMULTIDRAWELEMENTSBASEVERTEXEXTPROC MultiDrawElementsBaseVertexEXT;
        /*  926 */ PFNGLOBJECTLABELKHRPROC ObjectLabelKHR;
        /*  927 */ PFNGLOBJECTPTRLABELKHRPROC ObjectPtrLabelKHR;
        /*  928 */ PFNGLPATCHPARAMETERIPROC PatchParameteri;
        /*  929 */ PFNGLPATCHPARAMETERIEXTPROC PatchParameteriEXT;
        /*  930 */ PFNGLPATCHPARAMETERIOESPROC PatchParameteriOES;
        /*  931 */ PFNGLPAUSETRANSFORMFEEDBACKPROC PauseTransformFeedback;
        /*  932 */ PFNGLPOPDEBUGGROUPKHRPROC PopDebugGroupKHR;
        /*  933 */ PFNGLPRIMITIVEBOUNDINGBOXPROC PrimitiveBoundingBox;
        /*  934 */ PFNGLPRIMITIVEBOUNDINGBOXEXTPROC PrimitiveBoundingBoxEXT;
        /*  935 */ PFNGLPRIMITIVEBOUNDINGBOXOESPROC PrimitiveBoundingBoxOES;
        /*  936 */ PFNGLPROGRAMBINARYPROC ProgramBinary;
        /*  937 */ PFNGLPROGRAMBINARYOESPROC ProgramBinaryOES;
        /*  938 */ PFNGLPROGRAMPARAMETERIPROC ProgramParameteri;
        /*  939 */ PFNGLPROGRAMPARAMETERIEXTPROC ProgramParameteriEXT;
        /*  940 */ PFNGLPROGRAMUNIFORM1FPROC ProgramUniform1f;
        /*  941 */ PFNGLPROGRAMUNIFORM1FVPROC ProgramUniform1fv;
        /*  942 */ PFNGLPROGRAMUNIFORM1IPROC ProgramUniform1i;
        /*  943 */ PFNGLPROGRAMUNIFORM1IVPROC ProgramUniform1iv;
        /*  944 */ PFNGLPROGRAMUNIFORM1UIPROC ProgramUniform1ui;
        /*  945 */ PFNGLPROGRAMUNIFORM1UIVPROC ProgramUniform1uiv;
        /*  946 */ PFNGLPROGRAMUNIFORM2FPROC ProgramUniform2f;
        /*  947 */ PFNGLPROGRAMUNIFORM2FVPROC ProgramUniform2fv;
        /*  948 */ PFNGLPROGRAMUNIFORM2IPROC ProgramUniform2i;
        /*  949 */ PFNGLPROGRAMUNIFORM2IVPROC ProgramUniform2iv;
        /*  950 */ PFNGLPROGRAMUNIFORM2UIPROC ProgramUniform2ui;
        /*  951 */ PFNGLPROGRAMUNIFORM2UIVPROC ProgramUniform2uiv;
        /*  952 */ PFNGLPROGRAMUNIFORM3FPROC ProgramUniform3f;
        /*  953 */ PFNGLPROGRAMUNIFORM3FVPROC ProgramUniform3fv;
        /*  954 */ PFNGLPROGRAMUNIFORM3IPROC ProgramUniform3i;
        /*  955 */ PFNGLPROGRAMUNIFORM3IVPROC ProgramUniform3iv;
        /*  956 */ PFNGLPROGRAMUNIFORM3UIPROC ProgramUniform3ui;
        /*  957 */ PFNGLPROGRAMUNIFORM3UIVPROC ProgramUniform3uiv;
        /*  958 */ PFNGLPROGRAMUNIFORM4FPROC ProgramUniform4f;
        /*  959 */ PFNGLPROGRAMUNIFORM4FVPROC ProgramUniform4fv;
        /*  960 */ PFNGLPROGRAMUNIFORM4IPROC ProgramUniform4i;
        /*  961 */ PFNGLPROGRAMUNIFORM4IVPROC ProgramUniform4iv;
        /*  962 */ PFNGLPROGRAMUNIFORM4UIPROC ProgramUniform4ui;
        /*  963 */ PFNGLPROGRAMUNIFORM4UIVPROC ProgramUniform4uiv;
        /*  964 */ PFNGLPROGRAMUNIFORMMATRIX2FVPROC ProgramUniformMatrix2fv;
        /*  965 */ PFNGLPROGRAMUNIFORMMATRIX2X3FVPROC ProgramUniformMatrix2x3fv;
        /*  966 */ PFNGLPROGRAMUNIFORMMATRIX2X4FVPROC ProgramUniformMatrix2x4fv;
        /*  967 */ PFNGLPROGRAMUNIFORMMATRIX3FVPROC ProgramUniformMatrix3fv;
        /*  968 */ PFNGLPROGRAMUNIFORMMATRIX3X2FVPROC ProgramUniformMatrix3x2fv;
        /*  969 */ PFNGLPROGRAMUNIFORMMATRIX3X4FVPROC ProgramUniformMatrix3x4fv;
        /*  970 */ PFNGLPROGRAMUNIFORMMATRIX4FVPROC ProgramUniformMatrix4fv;
        /*  971 */ PFNGLPROGRAMUNIFORMMATRIX4X2FVPROC ProgramUniformMatrix4x2fv;
        /*  972 */ PFNGLPROGRAMUNIFORMMATRIX4X3FVPROC ProgramUniformMatrix4x3fv;
        /*  973 */ PFNGLPUSHDEBUGGROUPKHRPROC PushDebugGroupKHR;
        /*  974 */ PFNGLQUERYCOUNTEREXTPROC QueryCounterEXT;
        /*  975 */ PFNGLREADNPIXELSPROC ReadnPixels;
        /*  976 */ PFNGLREADNPIXELSEXTPROC ReadnPixelsEXT;
        /*  977 */ PFNGLREADNPIXELSKHRPROC ReadnPixelsKHR;
        /*  978 */ PFNGLRELEASESHADERCOMPILERPROC ReleaseShaderCompiler;
        /*  979 */ PFNGLRENDERBUFFERSTORAGEPROC RenderbufferStorage;
        /*  980 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEPROC RenderbufferStorageMultisample;
        /*  981 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEEXTPROC RenderbufferStorageMultisampleEXT;
        /*  982 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLENVPROC RenderbufferStorageMultisampleNV;
        /*  983 */ PFNGLRESUMETRANSFORMFEEDBACKPROC ResumeTransformFeedback;
        /*  984 */ PFNGLSAMPLECOVERAGEPROC SampleCoverage;
        /*  985 */ PFNGLSAMPLEMASKIPROC SampleMaski;
        /*  986 */ PFNGLSAMPLERPARAMETERIIVPROC SamplerParameterIiv;
        /*  987 */ PFNGLSAMPLERPARAMETERIIVEXTPROC SamplerParameterIivEXT;
        /*  988 */ PFNGLSAMPLERPARAMETERIIVOESPROC SamplerParameterIivOES;
        /*  989 */ PFNGLSAMPLERPARAMETERIUIVPROC SamplerParameterIuiv;
        /*  990 */ PFNGLSAMPLERPARAMETERIUIVEXTPROC SamplerParameterIuivEXT;
        /*  991 */ PFNGLSAMPLERPARAMETERIUIVOESPROC SamplerParameterIuivOES;
        /*  992 */ PFNGLSAMPLERPARAMETERFPROC SamplerParameterf;
        /*  993 */ PFNGLSAMPLERPARAMETERFVPROC SamplerParameterfv;
        /*  994 */ PFNGLSAMPLERPARAMETERIPROC SamplerParameteri;
        /*  995 */ PFNGLSAMPLERPARAMETERIVPROC SamplerParameteriv;
        /*  996 */ PFNGLSCISSORARRAYVNVPROC ScissorArrayvNV;
        /*  997 */ PFNGLSCISSORARRAYVOESPROC ScissorArrayvOES;
        /*  998 */ PFNGLSCISSORINDEXEDNVPROC ScissorIndexedNV;
        /*  999 */ PFNGLSCISSORINDEXEDOESPROC ScissorIndexedOES;
        /* 1000 */ PFNGLSCISSORINDEXEDVNVPROC ScissorIndexedvNV;
        /* 1001 */ PFNGLSCISSORINDEXEDVOESPROC ScissorIndexedvOES;
        /* 1002 */ PFNGLSHADERBINARYPROC ShaderBinary;
        /* 1003 */ PFNGLSHADERSOURCEPROC ShaderSource;
        /* 1004 */ PFNGLSTENCILFUNCSEPARATEPROC StencilFuncSeparate;
        /* 1005 */ PFNGLSTENCILMASKSEPARATEPROC StencilMaskSeparate;
        /* 1006 */ PFNGLSTENCILOPSEPARATEPROC StencilOpSeparate;
        /* 1007 */ PFNGLTEXBUFFERPROC TexBuffer;
        /* 1008 */ PFNGLTEXBUFFEREXTPROC TexBufferEXT;
        /* 1009 */ PFNGLTEXBUFFEROESPROC TexBufferOES;
        /* 1010 */ PFNGLTEXBUFFERRANGEPROC TexBufferRange;
        /* 1011 */ PFNGLTEXBUFFERRANGEEXTPROC TexBufferRangeEXT;
        /* 1012 */ PFNGLTEXBUFFERRANGEOESPROC TexBufferRangeOES;
        /* 1013 */ PFNGLTEXPARAMETERIIVPROC TexParameterIiv;
        /* 1014 */ PFNGLTEXPARAMETERIIVEXTPROC TexParameterIivEXT;
        /* 1015 */ PFNGLTEXPARAMETERIIVOESPROC TexParameterIivOES;
        /* 1016 */ PFNGLTEXPARAMETERIUIVPROC TexParameterIuiv;
        /* 1017 */ PFNGLTEXPARAMETERIUIVEXTPROC TexParameterIuivEXT;
        /* 1018 */ PFNGLTEXPARAMETERIUIVOESPROC TexParameterIuivOES;
        /* 1019 */ PFNGLTEXSTORAGE2DPROC TexStorage2D;
        /* 1020 */ PFNGLTEXSTORAGE2DMULTISAMPLEPROC TexStorage2DMultisample;
        /* 1021 */ PFNGLTEXSTORAGE3DPROC TexStorage3D;
        /* 1022 */ PFNGLTEXSTORAGE3DMULTISAMPLEPROC TexStorage3DMultisample;
        /* 1023 */ PFNGLTEXSTORAGE3DMULTISAMPLEOESPROC TexStorage3DMultisampleOES;
        /* 1024 */ PFNGLTRANSFORMFEEDBACKVARYINGSPROC TransformFeedbackVaryings;
        /* 1025 */ PFNGLUNIFORM1FPROC Uniform1f;
        /* 1026 */ PFNGLUNIFORM1FVPROC Uniform1fv;
        /* 1027 */ PFNGLUNIFORM1IPROC Uniform1i;
        /* 1028 */ PFNGLUNIFORM1IVPROC Uniform1iv;
        /* 1029 */ PFNGLUNIFORM1UIPROC Uniform1ui;
        /* 1030 */ PFNGLUNIFORM1UIVPROC Uniform1uiv;
        /* 1031 */ PFNGLUNIFORM2FPROC Uniform2f;
        /* 1032 */ PFNGLUNIFORM2FVPROC Uniform2fv;
        /* 1033 */ PFNGLUNIFORM2IPROC Uniform2i;
        /* 1034 */ PFNGLUNIFORM2IVPROC Uniform2iv;
        /* 1035 */ PFNGLUNIFORM2UIPROC Uniform2ui;
        /* 1036 */ PFNGLUNIFORM2UIVPROC Uniform2uiv;
        /* 1037 */ PFNGLUNIFORM3FPROC Uniform3f;
        /* 1038 */ PFNGLUNIFORM3FVPROC Uniform3fv;
        /* 1039 */ PFNGLUNIFORM3IPROC Uniform3i;
        /* 1040 */ PFNGLUNIFORM3IVPROC Uniform3iv;
        /* 1041 */ PFNGLUNIFORM3UIPROC Uniform3ui;
        /* 1042 */ PFNGLUNIFORM3UIVPROC Uniform3uiv;
        /* 1043 */ PFNGLUNIFORM4FPROC Uniform4f;
        /* 1044 */ PFNGLUNIFORM4FVPROC Uniform4fv;
        /* 1045 */ PFNGLUNIFORM4IPROC Uniform4i;
        /* 1046 */ PFNGLUNIFORM4IVPROC Uniform4iv;
        /* 1047 */ PFNGLUNIFORM4UIPROC Uniform4ui;
        /* 1048 */ PFNGLUNIFORM4UIVPROC Uniform4uiv;
        /* 1049 */ PFNGLUNIFORMBLOCKBINDINGPROC UniformBlockBinding;
        /* 1050 */ PFNGLUNIFORMMATRIX2FVPROC UniformMatrix2fv;
        /* 1051 */ PFNGLUNIFORMMATRIX2X3FVPROC UniformMatrix2x3fv;
        /* 1052 */ PFNGLUNIFORMMATRIX2X3FVNVPROC UniformMatrix2x3fvNV;
        /* 1053 */ PFNGLUNIFORMMATRIX2X4FVPROC UniformMatrix2x4fv;
        /* 1054 */ PFNGLUNIFORMMATRIX2X4FVNVPROC UniformMatrix2x4fvNV;
        /* 1055 */ PFNGLUNIFORMMATRIX3FVPROC UniformMatrix3fv;
        /* 1056 */ PFNGLUNIFORMMATRIX3X2FVPROC UniformMatrix3x2fv;
        /* 1057 */ PFNGLUNIFORMMATRIX3X2FVNVPROC UniformMatrix3x2fvNV;
        /* 1058 */ PFNGLUNIFORMMATRIX3X4FVPROC UniformMatrix3x4fv;
        /* 1059 */ PFNGLUNIFORMMATRIX3X4FVNVPROC UniformMatrix3x4fvNV;
        /* 1060 */ PFNGLUNIFORMMATRIX4FVPROC UniformMatrix4fv;
        /* 1061 */ PFNGLUNIFORMMATRIX4X2FVPROC UniformMatrix4x2fv;
        /* 1062 */ PFNGLUNIFORMMATRIX4X2FVNVPROC UniformMatrix4x2fvNV;
        /* 1063 */ PFNGLUNIFORMMATRIX4X3FVPROC UniformMatrix4x3fv;
        /* 1064 */ PFNGLUNIFORMMATRIX4X3FVNVPROC UniformMatrix4x3fvNV;
        /* 1065 */ PFNGLUNMAPBUFFERPROC UnmapBuffer;
        /* 1066 */ PFNGLUNMAPBUFFEROESPROC UnmapBufferOES;
        /* 1067 */ PFNGLUSEPROGRAMPROC UseProgram;
        /* 1068 */ PFNGLUSEPROGRAMSTAGESPROC UseProgramStages;
        /* 1069 */ PFNGLUSEPROGRAMSTAGESEXTPROC UseProgramStagesEXT;
        /* 1070 */ PFNGLVALIDATEPROGRAMPROC ValidateProgram;
        /* 1071 */ PFNGLVALIDATEPROGRAMPIPELINEPROC ValidateProgramPipeline;
        /* 1072 */ PFNGLVALIDATEPROGRAMPIPELINEEXTPROC ValidateProgramPipelineEXT;
        /* 1073 */ PFNGLVERTEXATTRIB1FPROC VertexAttrib1f;
        /* 1074 */ PFNGLVERTEXATTRIB1FVPROC VertexAttrib1fv;
        /* 1075 */ PFNGLVERTEXATTRIB2FPROC VertexAttrib2f;
        /* 1076 */ PFNGLVERTEXATTRIB2FVPROC VertexAttrib2fv;
        /* 1077 */ PFNGLVERTEXATTRIB3FPROC VertexAttrib3f;
        /* 1078 */ PFNGLVERTEXATTRIB3FVPROC VertexAttrib3fv;
        /* 1079 */ PFNGLVERTEXATTRIB4FPROC VertexAttrib4f;
        /* 1080 */ PFNGLVERTEXATTRIB4FVPROC VertexAttrib4fv;
        /* 1081 */ PFNGLVERTEXATTRIBBINDINGPROC VertexAttribBinding;
        /* 1082 */ PFNGLVERTEXATTRIBDIVISORPROC VertexAttribDivisor;
        /* 1083 */ PFNGLVERTEXATTRIBDIVISORANGLEPROC VertexAttribDivisorANGLE;
        /* 1084 */ PFNGLVERTEXATTRIBDIVISOREXTPROC VertexAttribDivisorEXT;
        /* 1085 */ PFNGLVERTEXATTRIBDIVISORNVPROC VertexAttribDivisorNV;
        /* 1086 */ PFNGLVERTEXATTRIBFORMATPROC VertexAttribFormat;
        /* 1087 */ PFNGLVERTEXATTRIBI4IPROC VertexAttribI4i;
        /* 1088 */ PFNGLVERTEXATTRIBI4IVPROC VertexAttribI4iv;
        /* 1089 */ PFNGLVERTEXATTRIBI4UIPROC VertexAttribI4ui;
        /* 1090 */ PFNGLVERTEXATTRIBI4UIVPROC VertexAttribI4uiv;
        /* 1091 */ PFNGLVERTEXATTRIBIFORMATPROC VertexAttribIFormat;
        /* 1092 */ PFNGLVERTEXATTRIBIPOINTERPROC VertexAttribIPointer;
        /* 1093 */ PFNGLVERTEXATTRIBPOINTERPROC VertexAttribPointer;
        /* 1094 */ PFNGLVERTEXBINDINGDIVISORPROC VertexBindingDivisor;
        /* 1095 */ PFNGLVIEWPORTARRAYVNVPROC ViewportArrayvNV;
        /* 1096 */ PFNGLVIEWPORTARRAYVOESPROC ViewportArrayvOES;
        /* 1097 */ PFNGLVIEWPORTINDEXEDFNVPROC ViewportIndexedfNV;
        /* 1098 */ PFNGLVIEWPORTINDEXEDFOESPROC ViewportIndexedfOES;
        /* 1099 */ PFNGLVIEWPORTINDEXEDFVNVPROC ViewportIndexedfvNV;
        /* 1100 */ PFNGLVIEWPORTINDEXEDFVOESPROC ViewportIndexedfvOES;
        /* 1101 */ PFNGLWAITSYNCPROC WaitSync;
        /* 1102 */ PFNGLWAITSYNCAPPLEPROC WaitSyncAPPLE;
        };
    };

    void* glad_loader_handle;
} GladGLContext;

GLAD_API_CALL GladGLContext glad_gl_context;

#define GLAD_GL_VERSION_1_0 (glad_gl_context.VERSION_1_0)
#define GLAD_GL_VERSION_1_1 (glad_gl_context.VERSION_1_1)
#define GLAD_GL_VERSION_1_2 (glad_gl_context.VERSION_1_2)
#define GLAD_GL_ES_VERSION_2_0 (glad_gl_context.ES_VERSION_2_0)
#define GLAD_GL_ES_VERSION_3_0 (glad_gl_context.ES_VERSION_3_0)
#define GLAD_GL_ES_VERSION_3_1 (glad_gl_context.ES_VERSION_3_1)
#define GLAD_GL_ES_VERSION_3_2 (glad_gl_context.ES_VERSION_3_2)
#define GLAD_GL_ANGLE_instanced_arrays (glad_gl_context.ANGLE_instanced_arrays)
#define GLAD_GL_APPLE_sync (glad_gl_context.APPLE_sync)
#define GLAD_GL_ARB_buffer_storage (glad_gl_context.ARB_buffer_storage)
#define GLAD_GL_ARB_debug_output (glad_gl_context.ARB_debug_output)
#define GLAD_GL_ARB_vertex_buffer_object (glad_gl_context.ARB_vertex_buffer_object)
