/**
 * Loader generated by glad 2.0.8 on -
 *
 * SPDX-License-Identifier: (WTFPL OR CC0-1.0) AND Apache-2.0
 *
 * Generator: C/C++
 * Specification: gl
 * Extensions: 967
 *
 * APIs:
 *  - gl:core=4.6
 *  - gles2=3.2
 *
 * Options:
 *  - ALIAS = True
 *  - HEADER_ONLY = False
 *  - LOADER = True
 *  - USE_PFN_RANGES = True
 *
 * Commandline:

typedef void (GLAD_API_PTR *PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXBASEINSTANCEANGLEPROC)(GLenum mode, GLsizei count, GLenum type, const void * indices, GLsizei instanceCount, GLint baseVertex, GLuint baseInstance);
typedef void (GLAD_API_PTR *PFNGLMULTIDRAWARRAYSINSTANCEDBASEINSTANCEANGLEPROC)(GLenum mode, const GLint * firsts, const GLsizei * counts, const GLsizei * instanceCounts, const GLuint * baseInstances, GLsizei drawcount);
typedef void (GLAD_API_PTR *PFNGLMULTIDRAWELEMENTSINSTANCEDBASEVERTEXBASEINSTANCEANGLEPROC)(GLenum mode, const GLsizei * counts, GLenum type, const void *const* indices, const GLsizei * instanceCounts, const GLint * baseVertices, const GLuint * baseInstances, GLsizei drawcount);
typedef void (GLAD_API_PTR *PFNGLPOLYGONMODEANGLEPROC)(GLenum face, GLenum mode);
typedef void (GLAD_API_PTR *PFNGLPROVOKINGVERTEXANGLEPROC)(GLenum provokeMode);
typedef void (GLAD_API_PTR *PFNGLLOSECONTEXTCHROMIUMPROC)(GLenum current, GLenum other);
typedef void (GLAD_API_PTR *PFNGLGETTEXIMAGEANGLEPROC)(GLenum target, GLint level, GLenum format, GLenum type, void * pixels);
typedef void (GLAD_API_PTR *PFNGLGETCOMPRESSEDTEXIMAGEANGLEPROC)(GLenum target, GLint level, void * pixels);
typedef void (GLAD_API_PTR *PFNGLGETRENDERBUFFERIMAGEANGLEPROC)(GLenum target, GLenum format, GLenum type, void * pixels);
typedef void (GLAD_API_PTR *PFNGLGETTEXLEVELPARAMETERFVANGLEPROC)(GLenum target, GLint level, GLenum pname, GLfloat * params);
typedef void (GLAD_API_PTR *PFNGLGETTEXLEVELPARAMETERIVANGLEPROC)(GLenum target, GLint level, GLenum pname, GLint * params);
typedef void (GLAD_API_PTR *PFNGLFRAMEBUFFERMEMORYLESSPIXELLOCALSTORAGEANGLEPROC)(GLint plane, GLenum internalformat);
typedef void (GLAD_API_PTR *PFNGLFRAMEBUFFERTEXTUREPIXELLOCALSTORAGEANGLEPROC)(GLint plane, GLuint backingtexture, GLint level, GLint layer);
typedef void (GLAD_API_PTR *PFNGLFRAMEBUFFERPIXELLOCALCLEARVALUEFVANGLEPROC)(GLint plane, const GLfloat * value);
typedef void (GLAD_API_PTR *PFNGLFRAMEBUFFERPIXELLOCALCLEARVALUEIVANGLEPROC)(GLint plane, const GLint * value);
typedef void (GLAD_API_PTR *PFNGLFRAMEBUFFERPIXELLOCALCLEARVALUEUIVANGLEPROC)(GLint plane, const GLuint * value);
typedef void (GLAD_API_PTR *PFNGLBEGINPIXELLOCALSTORAGEANGLEPROC)(GLsizei n, const GLenum * loadops);
typedef void (GLAD_API_PTR *PFNGLENDPIXELLOCALSTORAGEANGLEPROC)(GLsizei n, const GLenum * storeops);
typedef void (GLAD_API_PTR *PFNGLPIXELLOCALSTORAGEBARRIERANGLEPROC)(void);
typedef void (GLAD_API_PTR *PFNGLFRAMEBUFFERPIXELLOCALSTORAGEINTERRUPTANGLEPROC)(void);
typedef void (GLAD_API_PTR *PFNGLFRAMEBUFFERPIXELLOCALSTORAGERESTOREANGLEPROC)(void);
typedef void (GLAD_API_PTR *PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERFVANGLEPROC)(GLint plane, GLenum pname, GLfloat * params);
typedef void (GLAD_API_PTR *PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERIVANGLEPROC)(GLint plane, GLenum pname, GLint * params);
typedef void (GLAD_API_PTR *PFNGLLOGICOPANGLEPROC)(GLenum opcode);
typedef void (GLAD_API_PTR *PFNGLBLOBCACHECALLBACKSANGLEPROC)(GLSETBLOBPROCANGLE set, GLGETBLOBPROCANGLE get, const void * userParam);
typedef void (GLAD_API_PTR *PFNGLGETPOINTERVANGLEPROC)(GLenum pname, void ** params);

typedef struct GladGLContext {
    void* userptr;

    union {
        unsigned char featArray[23];
        struct {
        /*    0 */ unsigned char VERSION_1_0;
        /*    1 */ unsigned char VERSION_1_1;
        /*    2 */ unsigned char VERSION_1_2;
        /*    3 */ unsigned char VERSION_1_3;
        /*    4 */ unsigned char VERSION_1_4;
        /*    5 */ unsigned char VERSION_1_5;
        /*    6 */ unsigned char VERSION_2_0;
        /*    7 */ unsigned char VERSION_2_1;
        /*    8 */ unsigned char VERSION_3_0;
        /*    9 */ unsigned char VERSION_3_1;
        /*   10 */ unsigned char VERSION_3_2;
        /*   11 */ unsigned char VERSION_3_3;
        /*   12 */ unsigned char VERSION_4_0;
        /*   13 */ unsigned char VERSION_4_1;
        /*   14 */ unsigned char VERSION_4_2;
        /*   15 */ unsigned char VERSION_4_3;
        /*   16 */ unsigned char VERSION_4_4;
        /*   17 */ unsigned char VERSION_4_5;
        /*   18 */ unsigned char VERSION_4_6;
        /*   19 */ unsigned char ES_VERSION_2_0;
        /*   20 */ unsigned char ES_VERSION_3_0;
        /*   21 */ unsigned char ES_VERSION_3_1;
        /*   22 */ unsigned char ES_VERSION_3_2;
        };
    };

    union {
        unsigned char extArray[967];
        struct {
        /*    0 */ unsigned char _3DFX_multisample;
        /*    1 */ unsigned char _3DFX_tbuffer;
        /*    2 */ unsigned char _3DFX_texture_compression_FXT1;
        /*    3 */ unsigned char AMD_blend_minmax_factor;
        /*    4 */ unsigned char AMD_compressed_3DC_texture;
        /*    5 */ unsigned char AMD_compressed_ATC_texture;
        /*    6 */ unsigned char AMD_conservative_depth;
        /*    7 */ unsigned char AMD_debug_output;
        /*    8 */ unsigned char AMD_depth_clamp_separate;
        /*    9 */ unsigned char AMD_draw_buffers_blend;
        /*   10 */ unsigned char AMD_framebuffer_multisample_advanced;
        /*   11 */ unsigned char AMD_framebuffer_sample_positions;
        /*   12 */ unsigned char AMD_gcn_shader;
        /*   13 */ unsigned char AMD_gpu_shader_half_float;
        /*   14 */ unsigned char AMD_gpu_shader_int16;
        /*   15 */ unsigned char AMD_gpu_shader_int64;
        /*   16 */ unsigned char AMD_interleaved_elements;
        /*   17 */ unsigned char AMD_multi_draw_indirect;
        /*   18 */ unsigned char AMD_name_gen_delete;
        /*   19 */ unsigned char AMD_occlusion_query_event;
        /*   20 */ unsigned char AMD_performance_monitor;
        /*   21 */ unsigned char AMD_pinned_memory;
        /*   22 */ unsigned char AMD_program_binary_Z400;
        /*   23 */ unsigned char AMD_query_buffer_object;
        /*   24 */ unsigned char AMD_sample_positions;
        /*   25 */ unsigned char AMD_seamless_cubemap_per_texture;
        /*   26 */ unsigned char AMD_shader_atomic_counter_ops;
        /*   27 */ unsigned char AMD_shader_ballot;
        /*   28 */ unsigned char AMD_shader_explicit_vertex_parameter;
        /*   29 */ unsigned char AMD_shader_fragment_mask;
        /*   30 */ unsigned char AMD_shader_gpu_shader_half_float_fetch;
        /*   31 */ unsigned char AMD_shader_image_load_store_lod;
        /*   32 */ unsigned char AMD_shader_stencil_export;
        /*   33 */ unsigned char AMD_shader_trinary_minmax;
        /*   34 */ unsigned char AMD_sparse_texture;
        /*   35 */ unsigned char AMD_stencil_operation_extended;
        /*   36 */ unsigned char AMD_texture_gather_bias_lod;
        /*   37 */ unsigned char AMD_texture_texture4;
        /*   38 */ unsigned char AMD_transform_feedback3_lines_triangles;
        /*   39 */ unsigned char AMD_transform_feedback4;
        /*   40 */ unsigned char AMD_vertex_shader_layer;
        /*   41 */ unsigned char AMD_vertex_shader_tessellator;
        /*   42 */ unsigned char AMD_vertex_shader_viewport_index;
        /*   43 */ unsigned char ANDROID_extension_pack_es31a;
        /*   44 */ unsigned char ANGLE_base_vertex_base_instance;
        /*   45 */ unsigned char ANGLE_blob_cache;
        /*   46 */ unsigned char ANGLE_client_arrays;
        /*   47 */ unsigned char ANGLE_clip_cull_distance;
        /*   48 */ unsigned char ANGLE_copy_texture_3d;
        /*   49 */ unsigned char ANGLE_depth_texture;
        /*   50 */ unsigned char ANGLE_framebuffer_blit;
        /*   51 */ unsigned char ANGLE_framebuffer_multisample;
        /*   52 */ unsigned char ANGLE_get_image;
        /*   53 */ unsigned char ANGLE_get_serialized_context_string;
        /*   54 */ unsigned char ANGLE_get_tex_level_parameter;
        /*   55 */ unsigned char ANGLE_instanced_arrays;
        /*   56 */ unsigned char ANGLE_logic_op;
        /*   57 */ unsigned char ANGLE_lossy_etc_decode;
        /*   58 */ unsigned char ANGLE_memory_object_flags;
        /*   59 */ unsigned char ANGLE_memory_object_fuchsia;
        /*   60 */ unsigned char ANGLE_memory_size;
        /*   61 */ unsigned char ANGLE_multi_draw;
        /*   62 */ unsigned char ANGLE_pack_reverse_row_order;
        /*   63 */ unsigned char ANGLE_polygon_mode;
        /*   64 */ unsigned char ANGLE_program_binary;
        /*   65 */ unsigned char ANGLE_program_binary_readiness_query;
        /*   66 */ unsigned char ANGLE_program_cache_control;
        /*   67 */ unsigned char ANGLE_provoking_vertex;
        /*   68 */ unsigned char ANGLE_renderability_validation;
        /*   69 */ unsigned char ANGLE_request_extension;
        /*   70 */ unsigned char ANGLE_rgbx_internal_format;
        /*   71 */ unsigned char ANGLE_robust_client_memory;
        /*   72 */ unsigned char ANGLE_robust_fragment_shader_output;
        /*   73 */ unsigned char ANGLE_robust_resource_initialization;
        /*   74 */ unsigned char ANGLE_semaphore_fuchsia;
        /*   75 */ unsigned char ANGLE_shader_binary;
        /*   76 */ unsigned char ANGLE_shader_pixel_local_storage;
        /*   77 */ unsigned char ANGLE_stencil_texturing;
        /*   78 */ unsigned char ANGLE_texture_compression_dxt1;
        /*   79 */ unsigned char ANGLE_texture_compression_dxt3;
        /*   80 */ unsigned char ANGLE_texture_compression_dxt5;
        /*   81 */ unsigned char ANGLE_texture_external_update;
        /*   82 */ unsigned char ANGLE_texture_multisample;
        /*   83 */ unsigned char ANGLE_texture_usage;
        /*   84 */ unsigned char ANGLE_translated_shader_source;
        /*   85 */ unsigned char ANGLE_vulkan_image;
        /*   86 */ unsigned char ANGLE_yuv_internal_format;
        /*   87 */ unsigned char APPLE_aux_depth_stencil;
        /*   88 */ unsigned char APPLE_client_storage;
        /*   89 */ unsigned char APPLE_clip_distance;
        /*   90 */ unsigned char APPLE_color_buffer_packed_float;
        /*   91 */ unsigned char APPLE_copy_texture_levels;
        /*   92 */ unsigned char APPLE_element_array;
        /*   93 */ unsigned char APPLE_fence;
        /*   94 */ unsigned char APPLE_float_pixels;
        /*   95 */ unsigned char APPLE_flush_buffer_range;
        /*   96 */ unsigned char APPLE_framebuffer_multisample;
        /*   97 */ unsigned char APPLE_object_purgeable;
        /*   98 */ unsigned char APPLE_rgb_422;
        /*   99 */ unsigned char APPLE_row_bytes;
        /*  100 */ unsigned char APPLE_specular_vector;
        /*  101 */ unsigned char APPLE_sync;
        /*  102 */ unsigned char APPLE_texture_format_BGRA8888;
        /*  103 */ unsigned char APPLE_texture_max_level;
        /*  104 */ unsigned char APPLE_texture_packed_float;
        /*  105 */ unsigned char APPLE_texture_range;
        /*  106 */ unsigned char APPLE_transform_hint;
        /*  107 */ unsigned char APPLE_vertex_array_object;
        /*  108 */ unsigned char APPLE_vertex_array_range;
        /*  109 */ unsigned char APPLE_vertex_program_evaluators;
        /*  110 */ unsigned char APPLE_ycbcr_422;
        /*  111 */ unsigned char ARB_ES2_compatibility;
        /*  112 */ unsigned char ARB_ES3_1_compatibility;
        /*  113 */ unsigned char ARB_ES3_2_compatibility;
        /*  114 */ unsigned char ARB_ES3_compatibility;
        /*  115 */ unsigned char ARB_arrays_of_arrays;
        /*  116 */ unsigned char ARB_base_instance;
        /*  117 */ unsigned char ARB_bindless_texture;
        /*  118 */ unsigned char ARB_blend_func_extended;
        /*  119 */ unsigned char ARB_buffer_storage;
        /*  120 */ unsigned char ARB_cl_event;
        /*  121 */ unsigned char ARB_clear_buffer_object;
        /*  122 */ unsigned char ARB_clear_texture;
        /*  123 */ unsigned char ARB_clip_control;
        /*  124 */ unsigned char ARB_color_buffer_float;
        /*  125 */ unsigned char ARB_compatibility;
        /*  126 */ unsigned char ARB_compressed_texture_pixel_storage;
        /*  127 */ unsigned char ARB_compute_shader;
        /*  128 */ unsigned char ARB_compute_variable_group_size;
        /*  129 */ unsigned char ARB_conditional_render_inverted;
        /*  130 */ unsigned char ARB_conservative_depth;
        /*  131 */ unsigned char ARB_copy_buffer;
        /*  132 */ unsigned char ARB_copy_image;
        /*  133 */ unsigned char ARB_cull_distance;
        /*  134 */ unsigned char ARB_debug_output;
        /*  135 */ unsigned char ARB_depth_buffer_float;
        /*  136 */ unsigned char ARB_depth_clamp;
        /*  137 */ unsigned char ARB_depth_texture;
        /*  138 */ unsigned char ARB_derivative_control;
        /*  139 */ unsigned char ARB_direct_state_access;
        /*  140 */ unsigned char ARB_draw_buffers;
        /*  141 */ unsigned char ARB_draw_buffers_blend;
        /*  142 */ unsigned char ARB_draw_elements_base_vertex;
        /*  143 */ unsigned char ARB_draw_indirect;
        /*  144 */ unsigned char ARB_draw_instanced;
        /*  145 */ unsigned char ARB_enhanced_layouts;
        /*  146 */ unsigned char ARB_explicit_attrib_location;
        /*  147 */ unsigned char ARB_explicit_uniform_location;
        /*  148 */ unsigned char ARB_fragment_coord_conventions;
        /*  149 */ unsigned char ARB_fragment_layer_viewport;
        /*  150 */ unsigned char ARB_fragment_program;
        /*  151 */ unsigned char ARB_fragment_program_shadow;
        /*  152 */ unsigned char ARB_fragment_shader;
        /*  153 */ unsigned char ARB_fragment_shader_interlock;
        /*  154 */ unsigned char ARB_framebuffer_no_attachments;
        /*  155 */ unsigned char ARB_framebuffer_object;
        /*  156 */ unsigned char ARB_framebuffer_sRGB;
        /*  157 */ unsigned char ARB_geometry_shader4;
        /*  158 */ unsigned char ARB_get_program_binary;
        /*  159 */ unsigned char ARB_get_texture_sub_image;
        /*  160 */ unsigned char ARB_gl_spirv;
        /*  161 */ unsigned char ARB_gpu_shader5;
        /*  162 */ unsigned char ARB_gpu_shader_fp64;
        /*  163 */ unsigned char ARB_gpu_shader_int64;
        /*  164 */ unsigned char ARB_half_float_pixel;
        /*  165 */ unsigned char ARB_half_float_vertex;
        /*  166 */ unsigned char ARB_imaging;
        /*  167 */ unsigned char ARB_indirect_parameters;
        /*  168 */ unsigned char ARB_instanced_arrays;
        /*  169 */ unsigned char ARB_internalformat_query;
        /*  170 */ unsigned char ARB_internalformat_query2;
        /*  171 */ unsigned char ARB_invalidate_subdata;
        /*  172 */ unsigned char ARB_map_buffer_alignment;
        /*  173 */ unsigned char ARB_map_buffer_range;
        /*  174 */ unsigned char ARB_matrix_palette;
        /*  175 */ unsigned char ARB_multi_bind;
        /*  176 */ unsigned char ARB_multi_draw_indirect;
        /*  177 */ unsigned char ARB_multisample;
        /*  178 */ unsigned char ARB_multitexture;
        /*  179 */ unsigned char ARB_occlusion_query;
        /*  180 */ unsigned char ARB_occlusion_query2;
        /*  181 */ unsigned char ARB_parallel_shader_compile;
        /*  182 */ unsigned char ARB_pipeline_statistics_query;
        /*  183 */ unsigned char ARB_pixel_buffer_object;
        /*  184 */ unsigned char ARB_point_parameters;
        /*  185 */ unsigned char ARB_point_sprite;
        /*  186 */ unsigned char ARB_polygon_offset_clamp;
        /*  187 */ unsigned char ARB_post_depth_coverage;
        /*  188 */ unsigned char ARB_program_interface_query;
        /*  189 */ unsigned char ARB_provoking_vertex;
        /*  190 */ unsigned char ARB_query_buffer_object;
        /*  191 */ unsigned char ARB_robust_buffer_access_behavior;
        /*  192 */ unsigned char ARB_robustness;
        /*  193 */ unsigned char ARB_robustness_isolation;
        /*  194 */ unsigned char ARB_sample_locations;
        /*  195 */ unsigned char ARB_sample_shading;
        /*  196 */ unsigned char ARB_sampler_objects;
        /*  197 */ unsigned char ARB_seamless_cube_map;
        /*  198 */ unsigned char ARB_seamless_cubemap_per_texture;
        /*  199 */ unsigned char ARB_separate_shader_objects;
        /*  200 */ unsigned char ARB_shader_atomic_counter_ops;
        /*  201 */ unsigned char ARB_shader_atomic_counters;
        /*  202 */ unsigned char ARB_shader_ballot;
        /*  203 */ unsigned char ARB_shader_bit_encoding;
        /*  204 */ unsigned char ARB_shader_clock;
        /*  205 */ unsigned char ARB_shader_draw_parameters;
        /*  206 */ unsigned char ARB_shader_group_vote;
        /*  207 */ unsigned char ARB_shader_image_load_store;
        /*  208 */ unsigned char ARB_shader_image_size;
        /*  209 */ unsigned char ARB_shader_objects;
        /*  210 */ unsigned char ARB_shader_precision;
        /*  211 */ unsigned char ARB_shader_stencil_export;
        /*  212 */ unsigned char ARB_shader_storage_buffer_object;
        /*  213 */ unsigned char ARB_shader_subroutine;
        /*  214 */ unsigned char ARB_shader_texture_image_samples;
        /*  215 */ unsigned char ARB_shader_texture_lod;
        /*  216 */ unsigned char ARB_shader_viewport_layer_array;
        /*  217 */ unsigned char ARB_shading_language_100;
        /*  218 */ unsigned char ARB_shading_language_420pack;
        /*  219 */ unsigned char ARB_shading_language_include;
        /*  220 */ unsigned char ARB_shading_language_packing;
        /*  221 */ unsigned char ARB_shadow;
        /*  222 */ unsigned char ARB_shadow_ambient;
        /*  223 */ unsigned char ARB_sparse_buffer;
        /*  224 */ unsigned char ARB_sparse_texture;
        /*  225 */ unsigned char ARB_sparse_texture2;
        /*  226 */ unsigned char ARB_sparse_texture_clamp;
        /*  227 */ unsigned char ARB_spirv_extensions;
        /*  228 */ unsigned char ARB_stencil_texturing;
        /*  229 */ unsigned char ARB_sync;
        /*  230 */ unsigned char ARB_tessellation_shader;
        /*  231 */ unsigned char ARB_texture_barrier;
        /*  232 */ unsigned char ARB_texture_border_clamp;
        /*  233 */ unsigned char ARB_texture_buffer_object;
        /*  234 */ unsigned char ARB_texture_buffer_object_rgb32;
        /*  235 */ unsigned char ARB_texture_buffer_range;
        /*  236 */ unsigned char ARB_texture_compression;
        /*  237 */ unsigned char ARB_texture_compression_bptc;
        /*  238 */ unsigned char ARB_texture_compression_rgtc;
        /*  239 */ unsigned char ARB_texture_cube_map;
        /*  240 */ unsigned char ARB_texture_cube_map_array;
        /*  241 */ unsigned char ARB_texture_env_add;
        /*  242 */ unsigned char ARB_texture_env_combine;
        /*  243 */ unsigned char ARB_texture_env_crossbar;
        /*  244 */ unsigned char ARB_texture_env_dot3;
        /*  245 */ unsigned char ARB_texture_filter_anisotropic;
        /*  246 */ unsigned char ARB_texture_filter_minmax;
        /*  247 */ unsigned char ARB_texture_float;
        /*  248 */ unsigned char ARB_texture_gather;
        /*  249 */ unsigned char ARB_texture_mirror_clamp_to_edge;
        /*  250 */ unsigned char ARB_texture_mirrored_repeat;
        /*  251 */ unsigned char ARB_texture_multisample;
        /*  252 */ unsigned char ARB_texture_non_power_of_two;
        /*  253 */ unsigned char ARB_texture_query_levels;
        /*  254 */ unsigned char ARB_texture_query_lod;
        /*  255 */ unsigned char ARB_texture_rectangle;
        /*  256 */ unsigned char ARB_texture_rg;
        /*  257 */ unsigned char ARB_texture_rgb10_a2ui;
        /*  258 */ unsigned char ARB_texture_stencil8;
        /*  259 */ unsigned char ARB_texture_storage;
        /*  260 */ unsigned char ARB_texture_storage_multisample;
        /*  261 */ unsigned char ARB_texture_swizzle;
        /*  262 */ unsigned char ARB_texture_view;
        /*  263 */ unsigned char ARB_timer_query;
        /*  264 */ unsigned char ARB_transform_feedback2;
        /*  265 */ unsigned char ARB_transform_feedback3;
        /*  266 */ unsigned char ARB_transform_feedback_instanced;
        /*  267 */ unsigned char ARB_transform_feedback_overflow_query;
        /*  268 */ unsigned char ARB_transpose_matrix;
        /*  269 */ unsigned char ARB_uniform_buffer_object;
        /*  270 */ unsigned char ARB_vertex_array_bgra;
        /*  271 */ unsigned char ARB_vertex_array_object;
        /*  272 */ unsigned char ARB_vertex_attrib_64bit;
        /*  273 */ unsigned char ARB_vertex_attrib_binding;
        /*  274 */ unsigned char ARB_vertex_blend;
        /*  275 */ unsigned char ARB_vertex_buffer_object;
        /*  276 */ unsigned char ARB_vertex_program;
        /*  277 */ unsigned char ARB_vertex_shader;
        /*  278 */ unsigned char ARB_vertex_type_10f_11f_11f_rev;
        /*  279 */ unsigned char ARB_vertex_type_2_10_10_10_rev;
        /*  280 */ unsigned char ARB_viewport_array;
        /*  281 */ unsigned char ARB_window_pos;
        /*  282 */ unsigned char ARM_cooperative_matrix_layouts;
        /*  283 */ unsigned char ARM_mali_program_binary;
        /*  284 */ unsigned char ARM_mali_shader_binary;
        /*  285 */ unsigned char ARM_rgba8;
        /*  286 */ unsigned char ARM_shader_core_builtins;
        /*  287 */ unsigned char ARM_shader_core_properties;
        /*  288 */ unsigned char ARM_shader_framebuffer_fetch;
        /*  289 */ unsigned char ARM_shader_framebuffer_fetch_depth_stencil;
        /*  290 */ unsigned char ARM_texture_unnormalized_coordinates;
        /*  291 */ unsigned char ATI_draw_buffers;
        /*  292 */ unsigned char ATI_element_array;
        /*  293 */ unsigned char ATI_envmap_bumpmap;
        /*  294 */ unsigned char ATI_fragment_shader;
        /*  295 */ unsigned char ATI_map_object_buffer;
        /*  296 */ unsigned char ATI_meminfo;
        /*  297 */ unsigned char ATI_pixel_format_float;
        /*  298 */ unsigned char ATI_pn_triangles;
        /*  299 */ unsigned char ATI_separate_stencil;
        /*  300 */ unsigned char ATI_text_fragment_shader;
        /*  301 */ unsigned char ATI_texture_env_combine3;
        /*  302 */ unsigned char ATI_texture_float;
        /*  303 */ unsigned char ATI_texture_mirror_once;
        /*  304 */ unsigned char ATI_vertex_array_object;
        /*  305 */ unsigned char ATI_vertex_attrib_array_object;
        /*  306 */ unsigned char ATI_vertex_streams;
        /*  307 */ unsigned char CHROMIUM_bind_uniform_location;
        /*  308 */ unsigned char CHROMIUM_copy_compressed_texture;
        /*  309 */ unsigned char CHROMIUM_copy_texture;
        /*  310 */ unsigned char CHROMIUM_framebuffer_mixed_samples;
        /*  311 */ unsigned char CHROMIUM_lose_context;
        /*  312 */ unsigned char DMP_program_binary;
        /*  313 */ unsigned char DMP_shader_binary;
        /*  314 */ unsigned char EXT_422_pixels;
        /*  315 */ unsigned char EXT_EGL_image_array;
        /*  316 */ unsigned char EXT_EGL_image_storage;
        /*  317 */ unsigned char EXT_EGL_image_storage_compression;
        /*  318 */ unsigned char EXT_EGL_sync;
        /*  319 */ unsigned char EXT_YUV_target;
        /*  320 */ unsigned char EXT_abgr;
        /*  321 */ unsigned char EXT_base_instance;
        /*  322 */ unsigned char EXT_bfloat16;
        /*  323 */ unsigned char EXT_bgra;
        /*  324 */ unsigned char EXT_bindable_uniform;
        /*  325 */ unsigned char EXT_blend_color;
        /*  326 */ unsigned char EXT_blend_equation_separate;
        /*  327 */ unsigned char EXT_blend_func_extended;
        /*  328 */ unsigned char EXT_blend_func_separate;
        /*  329 */ unsigned char EXT_blend_logic_op;
        /*  330 */ unsigned char EXT_blend_minmax;
        /*  331 */ unsigned char EXT_blend_subtract;
        /*  332 */ unsigned char EXT_buffer_reference;
        /*  333 */ unsigned char EXT_buffer_reference2;
        /*  334 */ unsigned char EXT_buffer_reference_uvec2;
        /*  335 */ unsigned char EXT_buffer_storage;
        /*  336 */ unsigned char EXT_clear_texture;
        /*  337 */ unsigned char EXT_clip_control;
        /*  338 */ unsigned char EXT_clip_cull_distance;
        /*  339 */ unsigned char EXT_clip_volume_hint;
        /*  340 */ unsigned char EXT_cmyka;
        /*  341 */ unsigned char EXT_color_buffer_float;
        /*  342 */ unsigned char EXT_color_buffer_half_float;
        /*  343 */ unsigned char EXT_color_subtable;
        /*  344 */ unsigned char EXT_compiled_vertex_array;
        /*  345 */ unsigned char EXT_conservative_depth;
        /*  346 */ unsigned char EXT_control_flow_attributes;
        /*  347 */ unsigned char EXT_control_flow_attributes2;
        /*  348 */ unsigned char EXT_convolution;
        /*  349 */ unsigned char EXT_coordinate_frame;
        /*  350 */ unsigned char EXT_copy_image;
        /*  351 */ unsigned char EXT_copy_texture;
        /*  352 */ unsigned char EXT_cull_vertex;
        /*  353 */ unsigned char EXT_debug_label;
        /*  354 */ unsigned char EXT_debug_marker;
        /*  355 */ unsigned char EXT_debug_printf;
        /*  356 */ unsigned char EXT_demote_to_helper_invocation;
        /*  357 */ unsigned char EXT_depth_bounds_test;
        /*  358 */ unsigned char EXT_depth_clamp;
        /*  359 */ unsigned char EXT_device_group;
        /*  360 */ unsigned char EXT_direct_state_access;
        /*  361 */ unsigned char EXT_discard_framebuffer;
        /*  362 */ unsigned char EXT_disjoint_timer_query;
        /*  363 */ unsigned char EXT_draw_buffers;
        /*  364 */ unsigned char EXT_draw_buffers2;
        /*  365 */ unsigned char EXT_draw_buffers_indexed;
        /*  366 */ unsigned char EXT_draw_elements_base_vertex;
        /*  367 */ unsigned char EXT_draw_instanced;
        /*  368 */ unsigned char EXT_draw_range_elements;
        /*  369 */ unsigned char EXT_draw_transform_feedback;
        /*  370 */ unsigned char EXT_expect_assume;
        /*  371 */ unsigned char EXT_external_buffer;
        /*  372 */ unsigned char EXT_float8_e5m2_e4m3;
        /*  373 */ unsigned char EXT_float_blend;
        /*  374 */ unsigned char EXT_fog_coord;
        /*  375 */ unsigned char EXT_fragment_invocation_density;
        /*  376 */ unsigned char EXT_fragment_shader_barycentric;
        /*  377 */ unsigned char EXT_fragment_shading_rate;
        /*  378 */ unsigned char EXT_framebuffer_blit;
        /*  379 */ unsigned char EXT_framebuffer_blit_layers;
        /*  380 */ unsigned char EXT_framebuffer_multisample;
        /*  381 */ unsigned char EXT_framebuffer_multisample_blit_scaled;
        /*  382 */ unsigned char EXT_framebuffer_object;
        /*  383 */ unsigned char EXT_framebuffer_sRGB;
        /*  384 */ unsigned char EXT_geometry_point_size;
        /*  385 */ unsigned char EXT_geometry_shader;
        /*  386 */ unsigned char EXT_geometry_shader4;
        /*  387 */ unsigned char EXT_gpu_program_parameters;
        /*  388 */ unsigned char EXT_gpu_shader4;
        /*  389 */ unsigned char EXT_gpu_shader5;
        /*  390 */ unsigned char EXT_histogram;
        /*  391 */ unsigned char EXT_index_array_formats;
        /*  392 */ unsigned char EXT_index_func;
        /*  393 */ unsigned char EXT_index_material;
        /*  394 */ unsigned char EXT_index_texture;
        /*  395 */ unsigned char EXT_instanced_arrays;
        /*  396 */ unsigned char EXT_integer_dot_product;
        /*  397 */ unsigned char EXT_light_texture;
        /*  398 */ unsigned char EXT_map_buffer_range;
        /*  399 */ unsigned char EXT_maximal_reconvergence;
        /*  400 */ unsigned char EXT_memory_object;
        /*  401 */ unsigned char EXT_memory_object_fd;
        /*  402 */ unsigned char EXT_memory_object_win32;
        /*  403 */ unsigned char EXT_mesh_shader;
        /*  404 */ unsigned char EXT_misc_attribute;
        /*  405 */ unsigned char EXT_multi_draw_arrays;
        /*  406 */ unsigned char EXT_multi_draw_indirect;
        /*  407 */ unsigned char EXT_multisample;
        /*  408 */ unsigned char EXT_multisampled_compatibility;
        /*  409 */ unsigned char EXT_multisampled_render_to_texture;
        /*  410 */ unsigned char EXT_multisampled_render_to_texture2;
        /*  411 */ unsigned char EXT_multiview_draw_buffers;
        /*  412 */ unsigned char EXT_multiview_tessellation_geometry_shader;
        /*  413 */ unsigned char EXT_multiview_texture_multisample;
        /*  414 */ unsigned char EXT_multiview_timer_query;
        /*  415 */ unsigned char EXT_nontemporal_keyword;
        /*  416 */ unsigned char EXT_nonuniform_qualifier;
        /*  417 */ unsigned char EXT_null_initializer;
        /*  418 */ unsigned char EXT_occlusion_query_boolean;
        /*  419 */ unsigned char EXT_opacity_micromap;
        /*  420 */ unsigned char EXT_packed_depth_stencil;
        /*  421 */ unsigned char EXT_packed_float;
        /*  422 */ unsigned char EXT_packed_pixels;
        /*  423 */ unsigned char EXT_paletted_texture;
        /*  424 */ unsigned char EXT_pixel_buffer_object;
        /*  425 */ unsigned char EXT_pixel_transform;
        /*  426 */ unsigned char EXT_pixel_transform_color_table;
        /*  427 */ unsigned char EXT_point_parameters;
        /*  428 */ unsigned char EXT_polygon_offset;
        /*  429 */ unsigned char EXT_polygon_offset_clamp;
        /*  430 */ unsigned char EXT_post_depth_coverage;
        /*  431 */ unsigned char EXT_primitive_bounding_box;
        /*  432 */ unsigned char EXT_protected_textures;
        /*  433 */ unsigned char EXT_provoking_vertex;
        /*  434 */ unsigned char EXT_pvrtc_sRGB;
        /*  435 */ unsigned char EXT_raster_multisample;
        /*  436 */ unsigned char EXT_ray_cull_mask;
        /*  437 */ unsigned char EXT_ray_flags_primitive_culling;
        /*  438 */ unsigned char EXT_ray_query;
        /*  439 */ unsigned char EXT_ray_tracing;
        /*  440 */ unsigned char EXT_ray_tracing_position_fetch;
        /*  441 */ unsigned char EXT_read_format_bgra;
        /*  442 */ unsigned char EXT_render_snorm;
        /*  443 */ unsigned char EXT_rescale_normal;
        /*  444 */ unsigned char EXT_robustness;
        /*  445 */ unsigned char EXT_sRGB;
        /*  446 */ unsigned char EXT_sRGB_write_control;
        /*  447 */ unsigned char EXT_samplerless_texture_functions;
        /*  448 */ unsigned char EXT_scalar_block_layout;
        /*  449 */ unsigned char EXT_secondary_color;
        /*  450 */ unsigned char EXT_semaphore;
        /*  451 */ unsigned char EXT_semaphore_fd;
        /*  452 */ unsigned char EXT_semaphore_win32;
        /*  453 */ unsigned char EXT_separate_depth_stencil;
        /*  454 */ unsigned char EXT_separate_shader_objects;
        /*  455 */ unsigned char EXT_separate_specular_color;
        /*  456 */ unsigned char EXT_shader_16bit_storage;
        /*  457 */ unsigned char EXT_shader_8bit_storage;
        /*  458 */ unsigned char EXT_shader_atomic_float;
        /*  459 */ unsigned char EXT_shader_atomic_float2;
        /*  460 */ unsigned char EXT_shader_atomic_int64;
        /*  461 */ unsigned char EXT_shader_explicit_arithmetic_types;
        /*  462 */ unsigned char EXT_shader_explicit_arithmetic_types_float16;
        /*  463 */ unsigned char EXT_shader_explicit_arithmetic_types_float32;
        /*  464 */ unsigned char EXT_shader_explicit_arithmetic_types_float64;
        /*  465 */ unsigned char EXT_shader_explicit_arithmetic_types_int16;
        /*  466 */ unsigned char EXT_shader_explicit_arithmetic_types_int32;
        /*  467 */ unsigned char EXT_shader_explicit_arithmetic_types_int64;
        /*  468 */ unsigned char EXT_shader_explicit_arithmetic_types_int8;
        /*  469 */ unsigned char EXT_shader_framebuffer_fetch;
        /*  470 */ unsigned char EXT_shader_framebuffer_fetch_non_coherent;
        /*  471 */ unsigned char EXT_shader_group_vote;
        /*  472 */ unsigned char EXT_shader_image_int64;
        /*  473 */ unsigned char EXT_shader_image_load_formatted;
        /*  474 */ unsigned char EXT_shader_image_load_store;
        /*  475 */ unsigned char EXT_shader_implicit_conversions;
        /*  476 */ unsigned char EXT_shader_integer_mix;
        /*  477 */ unsigned char EXT_shader_io_blocks;
        /*  478 */ unsigned char EXT_shader_non_constant_global_initializers;
        /*  479 */ unsigned char EXT_shader_pixel_local_storage;
        /*  480 */ unsigned char EXT_shader_pixel_local_storage2;
        /*  481 */ unsigned char EXT_shader_quad_control;
        /*  482 */ unsigned char EXT_shader_realtime_clock;
        /*  483 */ unsigned char EXT_shader_samples_identical;
        /*  484 */ unsigned char EXT_shader_subgroup_extended_types;
        /*  485 */ unsigned char EXT_shader_subgroup_extended_types_float16;
        /*  486 */ unsigned char EXT_shader_subgroup_extended_types_int16;
        /*  487 */ unsigned char EXT_shader_subgroup_extended_types_int64;
        /*  488 */ unsigned char EXT_shader_subgroup_extended_types_int8;
        /*  489 */ unsigned char EXT_shader_texture_lod;
        /*  490 */ unsigned char EXT_shader_tile_image;
        /*  491 */ unsigned char EXT_shadow_funcs;
        /*  492 */ unsigned char EXT_shadow_samplers;
        /*  493 */ unsigned char EXT_shared_memory_block;
        /*  494 */ unsigned char EXT_shared_texture_palette;
        /*  495 */ unsigned char EXT_sparse_texture;
        /*  496 */ unsigned char EXT_sparse_texture2;
        /*  497 */ unsigned char EXT_spec_constant_composites;
        /*  498 */ unsigned char EXT_spirv_intrinsics;
        /*  499 */ unsigned char EXT_stencil_clear_tag;
        /*  500 */ unsigned char EXT_stencil_two_side;
        /*  501 */ unsigned char EXT_stencil_wrap;
        /*  502 */ unsigned char EXT_subgroup_uniform_control_flow;
        /*  503 */ unsigned char EXT_subgroupuniform_qualifier;
        /*  504 */ unsigned char EXT_subtexture;
        /*  505 */ unsigned char EXT_terminate_invocation;
        /*  506 */ unsigned char EXT_tessellation_point_size;
        /*  507 */ unsigned char EXT_tessellation_shader;
        /*  508 */ unsigned char EXT_texture;
        /*  509 */ unsigned char EXT_texture3D;
        /*  510 */ unsigned char EXT_texture_array;
        /*  511 */ unsigned char EXT_texture_border_clamp;
        /*  512 */ unsigned char EXT_texture_buffer;
        /*  513 */ unsigned char EXT_texture_buffer_object;
        /*  514 */ unsigned char EXT_texture_compression_astc_decode_mode;
        /*  515 */ unsigned char EXT_texture_compression_bptc;
        /*  516 */ unsigned char EXT_texture_compression_dxt1;
        /*  517 */ unsigned char EXT_texture_compression_latc;
        /*  518 */ unsigned char EXT_texture_compression_rgtc;
        /*  519 */ unsigned char EXT_texture_compression_s3tc;
        /*  520 */ unsigned char EXT_texture_compression_s3tc_srgb;
        /*  521 */ unsigned char EXT_texture_cube_map;
        /*  522 */ unsigned char EXT_texture_cube_map_array;
        /*  523 */ unsigned char EXT_texture_env_add;
        /*  524 */ unsigned char EXT_texture_env_combine;
        /*  525 */ unsigned char EXT_texture_env_dot3;
        /*  526 */ unsigned char EXT_texture_filter_anisotropic;
        /*  527 */ unsigned char EXT_texture_filter_minmax;
        /*  528 */ unsigned char EXT_texture_format_BGRA8888;
        /*  529 */ unsigned char EXT_texture_format_sRGB_override;
        /*  530 */ unsigned char EXT_texture_integer;
        /*  531 */ unsigned char EXT_texture_lod_bias;
        /*  532 */ unsigned char EXT_texture_mirror_clamp;
        /*  533 */ unsigned char EXT_texture_mirror_clamp_to_edge;
        /*  534 */ unsigned char EXT_texture_norm16;
        /*  535 */ unsigned char EXT_texture_object;
        /*  536 */ unsigned char EXT_texture_offset_non_const;
        /*  537 */ unsigned char EXT_texture_perturb_normal;
        /*  538 */ unsigned char EXT_texture_query_lod;
        /*  539 */ unsigned char EXT_texture_rg;
        /*  540 */ unsigned char EXT_texture_sRGB;
        /*  541 */ unsigned char EXT_texture_sRGB_R8;
        /*  542 */ unsigned char EXT_texture_sRGB_RG8;
        /*  543 */ unsigned char EXT_texture_sRGB_decode;
        /*  544 */ unsigned char EXT_texture_shadow_lod;
        /*  545 */ unsigned char EXT_texture_shared_exponent;
        /*  546 */ unsigned char EXT_texture_snorm;
        /*  547 */ unsigned char EXT_texture_storage;
        /*  548 */ unsigned char EXT_texture_storage_compression;
        /*  549 */ unsigned char EXT_texture_swizzle;
        /*  550 */ unsigned char EXT_texture_type_2_10_10_10_REV;
        /*  551 */ unsigned char EXT_texture_view;
        /*  552 */ unsigned char EXT_timer_query;
        /*  553 */ unsigned char EXT_transform_feedback;
        /*  554 */ unsigned char EXT_unpack_subimage;
        /*  555 */ unsigned char EXT_vertex_array;
        /*  556 */ unsigned char EXT_vertex_array_bgra;
        /*  557 */ unsigned char EXT_vertex_attrib_64bit;
        /*  558 */ unsigned char EXT_vertex_shader;
        /*  559 */ unsigned char EXT_vertex_weighting;
        /*  560 */ unsigned char EXT_vulkan_glsl_relaxed;
        /*  561 */ unsigned char EXT_win32_keyed_mutex;
        /*  562 */ unsigned char EXT_window_rectangles;
        /*  563 */ unsigned char EXT_x11_sync_object;
        /*  564 */ unsigned char FJ_shader_binary_GCCSO;
        /*  565 */ unsigned char GREMEDY_frame_terminator;
        /*  566 */ unsigned char GREMEDY_string_marker;
        /*  567 */ unsigned char HP_convolution_border_modes;
        /*  568 */ unsigned char HP_image_transform;
        /*  569 */ unsigned char HP_occlusion_test;
        /*  570 */ unsigned char HP_texture_lighting;
        /*  571 */ unsigned char HUAWEI_cluster_culling_shader;
        /*  572 */ unsigned char HUAWEI_program_binary;
        /*  573 */ unsigned char HUAWEI_shader_binary;
        /*  574 */ unsigned char HUAWEI_subpass_shading;
        /*  575 */ unsigned char IBM_cull_vertex;
        /*  576 */ unsigned char IBM_multimode_draw_arrays;
        /*  577 */ unsigned char IBM_rasterpos_clip;
        /*  578 */ unsigned char IBM_static_data;
        /*  579 */ unsigned char IBM_texture_mirrored_repeat;
        /*  580 */ unsigned char IBM_vertex_array_lists;
        /*  581 */ unsigned char IMG_bindless_texture;
        /*  582 */ unsigned char IMG_framebuffer_downsample;
        /*  583 */ unsigned char IMG_multisampled_render_to_texture;
        /*  584 */ unsigned char IMG_program_binary;
        /*  585 */ unsigned char IMG_read_format;
        /*  586 */ unsigned char IMG_shader_binary;
        /*  587 */ unsigned char IMG_texture_compression_pvrtc;
        /*  588 */ unsigned char IMG_texture_compression_pvrtc2;
        /*  589 */ unsigned char IMG_texture_filter_cubic;
        /*  590 */ unsigned char INGR_blend_func_separate;
        /*  591 */ unsigned char INGR_color_clamp;
        /*  592 */ unsigned char INGR_interlace_read;
        /*  593 */ unsigned char INTEL_blackhole_render;
        /*  594 */ unsigned char INTEL_conservative_rasterization;
        /*  595 */ unsigned char INTEL_fragment_shader_ordering;
        /*  596 */ unsigned char INTEL_framebuffer_CMAA;
        /*  597 */ unsigned char INTEL_map_texture;
        /*  598 */ unsigned char INTEL_parallel_arrays;
        /*  599 */ unsigned char INTEL_performance_query;
        /*  600 */ unsigned char KHR_blend_equation_advanced;
        /*  601 */ unsigned char KHR_blend_equation_advanced_coherent;
        /*  602 */ unsigned char KHR_context_flush_control;
        /*  603 */ unsigned char KHR_cooperative_matrix;
        /*  604 */ unsigned char KHR_debug;
        /*  605 */ unsigned char KHR_memory_scope_semantics;
        /*  606 */ unsigned char KHR_no_error;
        /*  607 */ unsigned char KHR_parallel_shader_compile;
        /*  608 */ unsigned char KHR_robust_buffer_access_behavior;
        /*  609 */ unsigned char KHR_robustness;
        /*  610 */ unsigned char KHR_shader_subgroup;
        /*  611 */ unsigned char KHR_shader_subgroup_arithmetic;
        /*  612 */ unsigned char KHR_shader_subgroup_ballot;
        /*  613 */ unsigned char KHR_shader_subgroup_basic;
        /*  614 */ unsigned char KHR_shader_subgroup_clustered;
        /*  615 */ unsigned char KHR_shader_subgroup_quad;
        /*  616 */ unsigned char KHR_shader_subgroup_rotate;
        /*  617 */ unsigned char KHR_shader_subgroup_shuffle;
        /*  618 */ unsigned char KHR_shader_subgroup_shuffle_relative;
        /*  619 */ unsigned char KHR_shader_subgroup_vote;
        /*  620 */ unsigned char KHR_texture_compression_astc_hdr;
        /*  621 */ unsigned char KHR_texture_compression_astc_ldr;
        /*  622 */ unsigned char KHR_texture_compression_astc_sliced_3d;
        /*  623 */ unsigned char KHR_vulkan_glsl;
        /*  624 */ unsigned char MESAX_texture_stack;
        /*  625 */ unsigned char MESA_bgra;
        /*  626 */ unsigned char MESA_framebuffer_flip_x;
        /*  627 */ unsigned char MESA_framebuffer_flip_y;
        /*  628 */ unsigned char MESA_framebuffer_swap_xy;
        /*  629 */ unsigned char MESA_pack_invert;
        /*  630 */ unsigned char MESA_program_binary_formats;
        /*  631 */ unsigned char MESA_resize_buffers;
        /*  632 */ unsigned char MESA_sampler_objects;
        /*  633 */ unsigned char MESA_shader_integer_functions;
        /*  634 */ unsigned char MESA_texture_const_bandwidth;
        /*  635 */ unsigned char MESA_tile_raster_order;
        /*  636 */ unsigned char MESA_window_pos;
        /*  637 */ unsigned char MESA_ycbcr_texture;
        /*  638 */ unsigned char NVX_blend_equation_advanced_multi_draw_buffers;
        /*  639 */ unsigned char NVX_conditional_render;
        /*  640 */ unsigned char NVX_gpu_memory_info;
        /*  641 */ unsigned char NVX_gpu_multicast2;
        /*  642 */ unsigned char NVX_linked_gpu_multicast;
        /*  643 */ unsigned char NVX_multiview_per_view_attributes;
        /*  644 */ unsigned char NVX_progress_fence;
        /*  645 */ unsigned char NV_alpha_to_coverage_dither_control;
        /*  646 */ unsigned char NV_bindless_multi_draw_indirect;
        /*  647 */ unsigned char NV_bindless_multi_draw_indirect_count;
        /*  648 */ unsigned char NV_bindless_texture;
        /*  649 */ unsigned char NV_blend_equation_advanced;
        /*  650 */ unsigned char NV_blend_equation_advanced_coherent;
        /*  651 */ unsigned char NV_blend_minmax_factor;
        /*  652 */ unsigned char NV_blend_square;
        /*  653 */ unsigned char NV_clip_space_w_scaling;
        /*  654 */ unsigned char NV_cluster_acceleration_structure;
        /*  655 */ unsigned char NV_command_list;
        /*  656 */ unsigned char NV_compute_program5;
        /*  657 */ unsigned char NV_compute_shader_derivatives;
        /*  658 */ unsigned char NV_conditional_render;
        /*  659 */ unsigned char NV_conservative_raster;
        /*  660 */ unsigned char NV_conservative_raster_dilate;
        /*  661 */ unsigned char NV_conservative_raster_pre_snap;
        /*  662 */ unsigned char NV_conservative_raster_pre_snap_triangles;
        /*  663 */ unsigned char NV_conservative_raster_underestimation;
        /*  664 */ unsigned char NV_cooperative_matrix;
        /*  665 */ unsigned char NV_cooperative_matrix2;
        /*  666 */ unsigned char NV_cooperative_vector;
        /*  667 */ unsigned char NV_copy_buffer;
        /*  668 */ unsigned char NV_copy_depth_to_color;
        /*  669 */ unsigned char NV_copy_image;
        /*  670 */ unsigned char NV_coverage_sample;
        /*  671 */ unsigned char NV_deep_texture3D;
        /*  672 */ unsigned char NV_depth_buffer_float;
        /*  673 */ unsigned char NV_depth_clamp;
        /*  674 */ unsigned char NV_depth_nonlinear;
        /*  675 */ unsigned char NV_displacement_micromap;
        /*  676 */ unsigned char NV_draw_buffers;
        /*  677 */ unsigned char NV_draw_instanced;
        /*  678 */ unsigned char NV_draw_texture;
        /*  679 */ unsigned char NV_draw_vulkan_image;
        /*  680 */ unsigned char NV_evaluators;
        /*  681 */ unsigned char NV_explicit_attrib_location;
        /*  682 */ unsigned char NV_explicit_multisample;
        /*  683 */ unsigned char NV_fbo_color_attachments;
        /*  684 */ unsigned char NV_fence;
        /*  685 */ unsigned char NV_fill_rectangle;
        /*  686 */ unsigned char NV_float_buffer;
        /*  687 */ unsigned char NV_fog_distance;
        /*  688 */ unsigned char NV_fragment_coverage_to_color;
        /*  689 */ unsigned char NV_fragment_program;
        /*  690 */ unsigned char NV_fragment_program2;
        /*  691 */ unsigned char NV_fragment_program4;
        /*  692 */ unsigned char NV_fragment_program_option;
        /*  693 */ unsigned char NV_fragment_shader_barycentric;
        /*  694 */ unsigned char NV_fragment_shader_interlock;
        /*  695 */ unsigned char NV_framebuffer_blit;
        /*  696 */ unsigned char NV_framebuffer_mixed_samples;
        /*  697 */ unsigned char NV_framebuffer_multisample;
        /*  698 */ unsigned char NV_framebuffer_multisample_coverage;
        /*  699 */ unsigned char NV_generate_mipmap_sRGB;
        /*  700 */ unsigned char NV_geometry_program4;
        /*  701 */ unsigned char NV_geometry_shader4;
        /*  702 */ unsigned char NV_geometry_shader_passthrough;
        /*  703 */ unsigned char NV_gpu_multicast;
        /*  704 */ unsigned char NV_gpu_program4;
        /*  705 */ unsigned char NV_gpu_program5;
        /*  706 */ unsigned char NV_gpu_program5_mem_extended;
        /*  707 */ unsigned char NV_gpu_shader5;
        /*  708 */ unsigned char NV_half_float;
        /*  709 */ unsigned char NV_image_formats;
        /*  710 */ unsigned char NV_instanced_arrays;
        /*  711 */ unsigned char NV_integer_cooperative_matrix;
        /*  712 */ unsigned char NV_internalformat_sample_query;
        /*  713 */ unsigned char NV_light_max_exponent;
        /*  714 */ unsigned char NV_linear_swept_spheres;
        /*  715 */ unsigned char NV_memory_attachment;
        /*  716 */ unsigned char NV_memory_object_sparse;
        /*  717 */ unsigned char NV_mesh_shader;
        /*  718 */ unsigned char NV_multisample_coverage;
        /*  719 */ unsigned char NV_multisample_filter_hint;
        /*  720 */ unsigned char NV_non_square_matrices;
        /*  721 */ unsigned char NV_occlusion_query;
        /*  722 */ unsigned char NV_pack_subimage;
        /*  723 */ unsigned char NV_packed_depth_stencil;
        /*  724 */ unsigned char NV_parameter_buffer_object;
        /*  725 */ unsigned char NV_parameter_buffer_object2;
        /*  726 */ unsigned char NV_path_rendering;
        /*  727 */ unsigned char NV_path_rendering_shared_edge;
        /*  728 */ unsigned char NV_pixel_buffer_object;
        /*  729 */ unsigned char NV_pixel_data_range;
        /*  730 */ unsigned char NV_point_sprite;
        /*  731 */ unsigned char NV_polygon_mode;
        /*  732 */ unsigned char NV_present_video;
        /*  733 */ unsigned char NV_primitive_restart;
        /*  734 */ unsigned char NV_primitive_shading_rate;
        /*  735 */ unsigned char NV_query_resource;
        /*  736 */ unsigned char NV_query_resource_tag;
        /*  737 */ unsigned char NV_ray_tracing;
        /*  738 */ unsigned char NV_ray_tracing_motion_blur;
        /*  739 */ unsigned char NV_read_buffer;
        /*  740 */ unsigned char NV_read_buffer_front;
        /*  741 */ unsigned char NV_read_depth;
        /*  742 */ unsigned char NV_read_depth_stencil;
        /*  743 */ unsigned char NV_read_stencil;
        /*  744 */ unsigned char NV_register_combiners;
        /*  745 */ unsigned char NV_register_combiners2;
        /*  746 */ unsigned char NV_representative_fragment_test;
        /*  747 */ unsigned char NV_robustness_video_memory_purge;
        /*  748 */ unsigned char NV_sRGB_formats;
        /*  749 */ unsigned char NV_sample_locations;
        /*  750 */ unsigned char NV_sample_mask_override_coverage;
        /*  751 */ unsigned char NV_scissor_exclusive;
        /*  752 */ unsigned char NV_shader_atomic_counters;
        /*  753 */ unsigned char NV_shader_atomic_float;
        /*  754 */ unsigned char NV_shader_atomic_float64;
        /*  755 */ unsigned char NV_shader_atomic_fp16_vector;
        /*  756 */ unsigned char NV_shader_atomic_int64;
        /*  757 */ unsigned char NV_shader_buffer_load;
        /*  758 */ unsigned char NV_shader_buffer_store;
        /*  759 */ unsigned char NV_shader_invocation_reorder;
        /*  760 */ unsigned char NV_shader_noperspective_interpolation;
        /*  761 */ unsigned char NV_shader_sm_builtins;
        /*  762 */ unsigned char NV_shader_storage_buffer_object;
        /*  763 */ unsigned char NV_shader_subgroup_partitioned;
        /*  764 */ unsigned char NV_shader_texture_footprint;
        /*  765 */ unsigned char NV_shader_thread_group;
        /*  766 */ unsigned char NV_shader_thread_shuffle;
        /*  767 */ unsigned char NV_shading_rate_image;
        /*  768 */ unsigned char NV_shadow_samplers_array;
        /*  769 */ unsigned char NV_shadow_samplers_cube;
        /*  770 */ unsigned char NV_stereo_view_rendering;
        /*  771 */ unsigned char NV_tessellation_program5;
        /*  772 */ unsigned char NV_texgen_emboss;
        /*  773 */ unsigned char NV_texgen_reflection;
        /*  774 */ unsigned char NV_texture_barrier;
        /*  775 */ unsigned char NV_texture_border_clamp;
        /*  776 */ unsigned char NV_texture_compression_s3tc_update;
        /*  777 */ unsigned char NV_texture_compression_vtc;
        /*  778 */ unsigned char NV_texture_env_combine4;
        /*  779 */ unsigned char NV_texture_expand_normal;
        /*  780 */ unsigned char NV_texture_multisample;
        /*  781 */ unsigned char NV_texture_npot_2D_mipmap;
        /*  782 */ unsigned char NV_texture_rectangle;
        /*  783 */ unsigned char NV_texture_rectangle_compressed;
        /*  784 */ unsigned char NV_texture_shader;
        /*  785 */ unsigned char NV_texture_shader2;
        /*  786 */ unsigned char NV_texture_shader3;
        /*  787 */ unsigned char NV_timeline_semaphore;
        /*  788 */ unsigned char NV_transform_feedback;
        /*  789 */ unsigned char NV_transform_feedback2;
        /*  790 */ unsigned char NV_uniform_buffer_std430_layout;
        /*  791 */ unsigned char NV_uniform_buffer_unified_memory;
        /*  792 */ unsigned char NV_vdpau_interop;
        /*  793 */ unsigned char NV_vdpau_interop2;
        /*  794 */ unsigned char NV_vertex_array_range;
        /*  795 */ unsigned char NV_vertex_array_range2;
        /*  796 */ unsigned char NV_vertex_attrib_integer_64bit;
        /*  797 */ unsigned char NV_vertex_buffer_unified_memory;
        /*  798 */ unsigned char NV_vertex_program;
        /*  799 */ unsigned char NV_vertex_program1_1;
        /*  800 */ unsigned char NV_vertex_program2;
        /*  801 */ unsigned char NV_vertex_program2_option;
        /*  802 */ unsigned char NV_vertex_program3;
        /*  803 */ unsigned char NV_vertex_program4;
        /*  804 */ unsigned char NV_video_capture;
        /*  805 */ unsigned char NV_viewport_array;
        /*  806 */ unsigned char NV_viewport_array2;
        /*  807 */ unsigned char NV_viewport_swizzle;
        /*  808 */ unsigned char OES_EGL_image;
        /*  809 */ unsigned char OES_EGL_image_external;
        /*  810 */ unsigned char OES_EGL_image_external_essl3;
        /*  811 */ unsigned char OES_byte_coordinates;
        /*  812 */ unsigned char OES_compressed_ETC1_RGB8_sub_texture;
        /*  813 */ unsigned char OES_compressed_ETC1_RGB8_texture;
        /*  814 */ unsigned char OES_compressed_paletted_texture;
        /*  815 */ unsigned char OES_copy_image;
        /*  816 */ unsigned char OES_depth24;
        /*  817 */ unsigned char OES_depth32;
        /*  818 */ unsigned char OES_depth_texture;
        /*  819 */ unsigned char OES_draw_buffers_indexed;
        /*  820 */ unsigned char OES_draw_elements_base_vertex;
        /*  821 */ unsigned char OES_element_index_uint;
        /*  822 */ unsigned char OES_fbo_render_mipmap;
        /*  823 */ unsigned char OES_fixed_point;
        /*  824 */ unsigned char OES_fragment_precision_high;
        /*  825 */ unsigned char OES_geometry_point_size;
        /*  826 */ unsigned char OES_geometry_shader;
        /*  827 */ unsigned char OES_get_program_binary;
        /*  828 */ unsigned char OES_gpu_shader5;
        /*  829 */ unsigned char OES_mapbuffer;
        /*  830 */ unsigned char OES_packed_depth_stencil;
        /*  831 */ unsigned char OES_primitive_bounding_box;
        /*  832 */ unsigned char OES_query_matrix;
        /*  833 */ unsigned char OES_read_format;
        /*  834 */ unsigned char OES_required_internalformat;
        /*  835 */ unsigned char OES_rgb8_rgba8;
        /*  836 */ unsigned char OES_sample_shading;
        /*  837 */ unsigned char OES_sample_variables;
        /*  838 */ unsigned char OES_shader_image_atomic;
        /*  839 */ unsigned char OES_shader_io_blocks;
        /*  840 */ unsigned char OES_shader_multisample_interpolation;
        /*  841 */ unsigned char OES_single_precision;
        /*  842 */ unsigned char OES_standard_derivatives;
        /*  843 */ unsigned char OES_stencil1;
        /*  844 */ unsigned char OES_stencil4;
        /*  845 */ unsigned char OES_surfaceless_context;
        /*  846 */ unsigned char OES_tessellation_point_size;
        /*  847 */ unsigned char OES_tessellation_shader;
        /*  848 */ unsigned char OES_texture_3D;
        /*  849 */ unsigned char OES_texture_border_clamp;
        /*  850 */ unsigned char OES_texture_buffer;
        /*  851 */ unsigned char OES_texture_compression_astc;
        /*  852 */ unsigned char OES_texture_cube_map_array;
        /*  853 */ unsigned char OES_texture_float;
        /*  854 */ unsigned char OES_texture_float_linear;
        /*  855 */ unsigned char OES_texture_half_float;
        /*  856 */ unsigned char OES_texture_half_float_linear;
        /*  857 */ unsigned char OES_texture_npot;
        /*  858 */ unsigned char OES_texture_stencil8;
        /*  859 */ unsigned char OES_texture_storage_multisample_2d_array;
        /*  860 */ unsigned char OES_texture_view;
        /*  861 */ unsigned char OES_vertex_array_object;
        /*  862 */ unsigned char OES_vertex_half_float;
        /*  863 */ unsigned char OES_vertex_type_10_10_10_2;
        /*  864 */ unsigned char OES_viewport_array;
        /*  865 */ unsigned char OML_interlace;
        /*  866 */ unsigned char OML_resample;
        /*  867 */ unsigned char OML_subsample;
        /*  868 */ unsigned char OVR_multiview;
        /*  869 */ unsigned char OVR_multiview2;
        /*  870 */ unsigned char OVR_multiview_multisampled_render_to_texture;
        /*  871 */ unsigned char PGI_misc_hints;
        /*  872 */ unsigned char PGI_vertex_hints;
        /*  873 */ unsigned char QCOM_YUV_texture_gather;
        /*  874 */ unsigned char QCOM_alpha_test;
        /*  875 */ unsigned char QCOM_binning_control;
        /*  876 */ unsigned char QCOM_cooperative_matrix_conversion;
        /*  877 */ unsigned char QCOM_driver_control;
        /*  878 */ unsigned char QCOM_extended_get;
        /*  879 */ unsigned char QCOM_extended_get2;
        /*  880 */ unsigned char QCOM_frame_extrapolation;
        /*  881 */ unsigned char QCOM_framebuffer_foveated;
        /*  882 */ unsigned char QCOM_image_processing;
        /*  883 */ unsigned char QCOM_image_processing2;
        /*  884 */ unsigned char QCOM_motion_estimation;
        /*  885 */ unsigned char QCOM_perfmon_global_mode;
        /*  886 */ unsigned char QCOM_render_sRGB_R8_RG8;
        /*  887 */ unsigned char QCOM_render_shared_exponent;
        /*  888 */ unsigned char QCOM_shader_framebuffer_fetch_noncoherent;
        /*  889 */ unsigned char QCOM_shader_framebuffer_fetch_rate;
        /*  890 */ unsigned char QCOM_shading_rate;
        /*  891 */ unsigned char QCOM_texture_foveated;
        /*  892 */ unsigned char QCOM_texture_foveated2;
        /*  893 */ unsigned char QCOM_texture_foveated_subsampled_layout;
        /*  894 */ unsigned char QCOM_texture_lod_bias;
        /*  895 */ unsigned char QCOM_tile_shading;
        /*  896 */ unsigned char QCOM_tiled_rendering;
        /*  897 */ unsigned char QCOM_writeonly_rendering;
        /*  898 */ unsigned char QCOM_ycbcr_degamma;
        /*  899 */ unsigned char REND_screen_coordinates;
        /*  900 */ unsigned char S3_s3tc;
        /*  901 */ unsigned char SGIS_detail_texture;
        /*  902 */ unsigned char SGIS_fog_function;
        /*  903 */ unsigned char SGIS_generate_mipmap;
        /*  904 */ unsigned char SGIS_multisample;
        /*  905 */ unsigned char SGIS_pixel_texture;
        /*  906 */ unsigned char SGIS_point_line_texgen;
        /*  907 */ unsigned char SGIS_point_parameters;
        /*  908 */ unsigned char SGIS_sharpen_texture;
        /*  909 */ unsigned char SGIS_texture4D;
        /*  910 */ unsigned char SGIS_texture_border_clamp;
        /*  911 */ unsigned char SGIS_texture_color_mask;
        /*  912 */ unsigned char SGIS_texture_edge_clamp;
        /*  913 */ unsigned char SGIS_texture_filter4;
        /*  914 */ unsigned char SGIS_texture_lod;
        /*  915 */ unsigned char SGIS_texture_select;
        /*  916 */ unsigned char SGIX_async;
        /*  917 */ unsigned char SGIX_async_histogram;
        /*  918 */ unsigned char SGIX_async_pixel;
        /*  919 */ unsigned char SGIX_blend_alpha_minmax;
        /*  920 */ unsigned char SGIX_calligraphic_fragment;
        /*  921 */ unsigned char SGIX_clipmap;
        /*  922 */ unsigned char SGIX_convolution_accuracy;
        /*  923 */ unsigned char SGIX_depth_pass_instrument;
        /*  924 */ unsigned char SGIX_depth_texture;
        /*  925 */ unsigned char SGIX_flush_raster;
        /*  926 */ unsigned char SGIX_fog_offset;
        /*  927 */ unsigned char SGIX_fragment_lighting;
        /*  928 */ unsigned char SGIX_framezoom;
        /*  929 */ unsigned char SGIX_igloo_interface;
        /*  930 */ unsigned char SGIX_instruments;
        /*  931 */ unsigned char SGIX_interlace;
        /*  932 */ unsigned char SGIX_ir_instrument1;
        /*  933 */ unsigned char SGIX_list_priority;
        /*  934 */ unsigned char SGIX_pixel_texture;
        /*  935 */ unsigned char SGIX_pixel_tiles;
        /*  936 */ unsigned char SGIX_polynomial_ffd;
        /*  937 */ unsigned char SGIX_reference_plane;
        /*  938 */ unsigned char SGIX_resample;
        /*  939 */ unsigned char SGIX_scalebias_hint;
        /*  940 */ unsigned char SGIX_shadow;
        /*  941 */ unsigned char SGIX_shadow_ambient;
        /*  942 */ unsigned char SGIX_sprite;
        /*  943 */ unsigned char SGIX_subsample;
        /*  944 */ unsigned char SGIX_tag_sample_buffer;
        /*  945 */ unsigned char SGIX_texture_add_env;
        /*  946 */ unsigned char SGIX_texture_coordinate_clamp;
        /*  947 */ unsigned char SGIX_texture_lod_bias;
        /*  948 */ unsigned char SGIX_texture_multi_buffer;
        /*  949 */ unsigned char SGIX_texture_scale_bias;
        /*  950 */ unsigned char SGIX_vertex_preclip;
        /*  951 */ unsigned char SGIX_ycrcb;
        /*  952 */ unsigned char SGIX_ycrcb_subsample;
        /*  953 */ unsigned char SGIX_ycrcba;
        /*  954 */ unsigned char SGI_color_matrix;
        /*  955 */ unsigned char SGI_color_table;
        /*  956 */ unsigned char SGI_texture_color_table;
        /*  957 */ unsigned char SUNX_constant_data;
        /*  958 */ unsigned char SUN_convolution_border_modes;
        /*  959 */ unsigned char SUN_global_alpha;
        /*  960 */ unsigned char SUN_mesh_array;
        /*  961 */ unsigned char SUN_slice_accum;
        /*  962 */ unsigned char SUN_triangle_list;
        /*  963 */ unsigned char SUN_vertex;
        /*  964 */ unsigned char VIV_shader_binary;
        /*  965 */ unsigned char WIN_phong_shading;
        /*  966 */ unsigned char WIN_specular_fog;
        };
    };

    union {
        void *pfnArray[2886];
        struct {
        /*    0 */ PFNGLCULLFACEPROC CullFace;
        /*    1 */ PFNGLFRONTFACEPROC FrontFace;
        /*    2 */ PFNGLHINTPROC Hint;
        /*    3 */ PFNGLLINEWIDTHPROC LineWidth;
        /*    4 */ PFNGLPOINTSIZEPROC PointSize;
        /*    5 */ PFNGLPOLYGONMODEPROC PolygonMode;
        /*    6 */ PFNGLSCISSORPROC Scissor;
        /*    7 */ PFNGLTEXPARAMETERFPROC TexParameterf;
        /*    8 */ PFNGLTEXPARAMETERFVPROC TexParameterfv;
        /*    9 */ PFNGLTEXPARAMETERIPROC TexParameteri;
        /*   10 */ PFNGLTEXPARAMETERIVPROC TexParameteriv;
        /*   11 */ PFNGLTEXIMAGE1DPROC TexImage1D;
        /*   12 */ PFNGLTEXIMAGE2DPROC TexImage2D;
        /*   13 */ PFNGLDRAWBUFFERPROC DrawBuffer;
        /*   14 */ PFNGLCLEARPROC Clear;
        /*   15 */ PFNGLCLEARCOLORPROC ClearColor;
        /*   16 */ PFNGLCLEARSTENCILPROC ClearStencil;
        /*   17 */ PFNGLCLEARDEPTHPROC ClearDepth;
        /*   18 */ PFNGLSTENCILMASKPROC StencilMask;
        /*   19 */ PFNGLCOLORMASKPROC ColorMask;
        /*   20 */ PFNGLDEPTHMASKPROC DepthMask;
        /*   21 */ PFNGLDISABLEPROC Disable;
        /*   22 */ PFNGLENABLEPROC Enable;
        /*   23 */ PFNGLFINISHPROC Finish;
        /*   24 */ PFNGLFLUSHPROC Flush;
        /*   25 */ PFNGLBLENDFUNCPROC BlendFunc;
        /*   26 */ PFNGLLOGICOPPROC LogicOp;
        /*   27 */ PFNGLSTENCILFUNCPROC StencilFunc;
        /*   28 */ PFNGLSTENCILOPPROC StencilOp;
        /*   29 */ PFNGLDEPTHFUNCPROC DepthFunc;
        /*   30 */ PFNGLPIXELSTOREFPROC PixelStoref;
        /*   31 */ PFNGLPIXELSTOREIPROC PixelStorei;
        /*   32 */ PFNGLREADBUFFERPROC ReadBuffer;
        /*   33 */ PFNGLREADPIXELSPROC ReadPixels;
        /*   34 */ PFNGLGETBOOLEANVPROC GetBooleanv;
        /*   35 */ PFNGLGETDOUBLEVPROC GetDoublev;
        /*   36 */ PFNGLGETERRORPROC GetError;
        /*   37 */ PFNGLGETFLOATVPROC GetFloatv;
        /*   38 */ PFNGLGETINTEGERVPROC GetIntegerv;
        /*   39 */ PFNGLGETSTRINGPROC GetString;
        /*   40 */ PFNGLGETTEXIMAGEPROC GetTexImage;
        /*   41 */ PFNGLGETTEXPARAMETERFVPROC GetTexParameterfv;
        /*   42 */ PFNGLGETTEXPARAMETERIVPROC GetTexParameteriv;
        /*   43 */ PFNGLGETTEXLEVELPARAMETERFVPROC GetTexLevelParameterfv;
        /*   44 */ PFNGLGETTEXLEVELPARAMETERIVPROC GetTexLevelParameteriv;
        /*   45 */ PFNGLISENABLEDPROC IsEnabled;
        /*   46 */ PFNGLDEPTHRANGEPROC DepthRange;
        /*   47 */ PFNGLVIEWPORTPROC Viewport;
        /*   48 */ PFNGLDRAWARRAYSPROC DrawArrays;
        /*   49 */ PFNGLDRAWELEMENTSPROC DrawElements;
        /*   50 */ PFNGLGETPOINTERVPROC GetPointerv;
        /*   51 */ PFNGLPOLYGONOFFSETPROC PolygonOffset;
        /*   52 */ PFNGLCOPYTEXIMAGE1DPROC CopyTexImage1D;
        /*   53 */ PFNGLCOPYTEXIMAGE2DPROC CopyTexImage2D;
        /*   54 */ PFNGLCOPYTEXSUBIMAGE1DPROC CopyTexSubImage1D;
        /*   55 */ PFNGLCOPYTEXSUBIMAGE2DPROC CopyTexSubImage2D;
        /*   56 */ PFNGLTEXSUBIMAGE1DPROC TexSubImage1D;
        /*   57 */ PFNGLTEXSUBIMAGE2DPROC TexSubImage2D;
        /*   58 */ PFNGLBINDTEXTUREPROC BindTexture;
        /*   59 */ PFNGLDELETETEXTURESPROC DeleteTextures;
        /*   60 */ PFNGLGENTEXTURESPROC GenTextures;
        /*   61 */ PFNGLISTEXTUREPROC IsTexture;
        /*   62 */ PFNGLDRAWRANGEELEMENTSPROC DrawRangeElements;
        /*   63 */ PFNGLTEXIMAGE3DPROC TexImage3D;
        /*   64 */ PFNGLTEXSUBIMAGE3DPROC TexSubImage3D;
        /*   65 */ PFNGLCOPYTEXSUBIMAGE3DPROC CopyTexSubImage3D;
        /*   66 */ PFNGLACTIVETEXTUREPROC ActiveTexture;
        /*   67 */ PFNGLSAMPLECOVERAGEPROC SampleCoverage;
        /*   68 */ PFNGLCOMPRESSEDTEXIMAGE3DPROC CompressedTexImage3D;
        /*   69 */ PFNGLCOMPRESSEDTEXIMAGE2DPROC CompressedTexImage2D;
        /*   70 */ PFNGLCOMPRESSEDTEXIMAGE1DPROC CompressedTexImage1D;
        /*   71 */ PFNGLCOMPRESSEDTEXSUBIMAGE3DPROC CompressedTexSubImage3D;
        /*   72 */ PFNGLCOMPRESSEDTEXSUBIMAGE2DPROC CompressedTexSubImage2D;
        /*   73 */ PFNGLCOMPRESSEDTEXSUBIMAGE1DPROC CompressedTexSubImage1D;
        /*   74 */ PFNGLGETCOMPRESSEDTEXIMAGEPROC GetCompressedTexImage;
        /*   75 */ PFNGLBLENDFUNCSEPARATEPROC BlendFuncSeparate;
        /*   76 */ PFNGLMULTIDRAWARRAYSPROC MultiDrawArrays;
        /*   77 */ PFNGLMULTIDRAWELEMENTSPROC MultiDrawElements;
        /*   78 */ PFNGLPOINTPARAMETERFPROC PointParameterf;
        /*   79 */ PFNGLPOINTPARAMETERFVPROC PointParameterfv;
        /*   80 */ PFNGLPOINTPARAMETERIPROC PointParameteri;
        /*   81 */ PFNGLPOINTPARAMETERIVPROC PointParameteriv;
        /*   82 */ PFNGLBLENDCOLORPROC BlendColor;
        /*   83 */ PFNGLBLENDEQUATIONPROC BlendEquation;
        /*   84 */ PFNGLGENQUERIESPROC GenQueries;
        /*   85 */ PFNGLDELETEQUERIESPROC DeleteQueries;
        /*   86 */ PFNGLISQUERYPROC IsQuery;
        /*   87 */ PFNGLBEGINQUERYPROC BeginQuery;
        /*   88 */ PFNGLENDQUERYPROC EndQuery;
        /*   89 */ PFNGLGETQUERYIVPROC GetQueryiv;
        /*   90 */ PFNGLGETQUERYOBJECTIVPROC GetQueryObjectiv;
        /*   91 */ PFNGLGETQUERYOBJECTUIVPROC GetQueryObjectuiv;
        /*   92 */ PFNGLBINDBUFFERPROC BindBuffer;
        /*   93 */ PFNGLDELETEBUFFERSPROC DeleteBuffers;
        /*   94 */ PFNGLGENBUFFERSPROC GenBuffers;
        /*   95 */ PFNGLISBUFFERPROC IsBuffer;
        /*   96 */ PFNGLBUFFERDATAPROC BufferData;
        /*   97 */ PFNGLBUFFERSUBDATAPROC BufferSubData;
        /*   98 */ PFNGLGETBUFFERSUBDATAPROC GetBufferSubData;
        /*   99 */ PFNGLMAPBUFFERPROC MapBuffer;
        /*  100 */ PFNGLUNMAPBUFFERPROC UnmapBuffer;
        /*  101 */ PFNGLGETBUFFERPARAMETERIVPROC GetBufferParameteriv;
        /*  102 */ PFNGLGETBUFFERPOINTERVPROC GetBufferPointerv;
        /*  103 */ PFNGLBLENDEQUATIONSEPARATEPROC BlendEquationSeparate;
        /*  104 */ PFNGLDRAWBUFFERSPROC DrawBuffers;
        /*  105 */ PFNGLSTENCILOPSEPARATEPROC StencilOpSeparate;
        /*  106 */ PFNGLSTENCILFUNCSEPARATEPROC StencilFuncSeparate;
        /*  107 */ PFNGLSTENCILMASKSEPARATEPROC StencilMaskSeparate;
        /*  108 */ PFNGLATTACHSHADERPROC AttachShader;
        /*  109 */ PFNGLBINDATTRIBLOCATIONPROC BindAttribLocation;
        /*  110 */ PFNGLCOMPILESHADERPROC CompileShader;
        /*  111 */ PFNGLCREATEPROGRAMPROC CreateProgram;
        /*  112 */ PFNGLCREATESHADERPROC CreateShader;
        /*  113 */ PFNGLDELETEPROGRAMPROC DeleteProgram;
        /*  114 */ PFNGLDELETESHADERPROC DeleteShader;
        /*  115 */ PFNGLDETACHSHADERPROC DetachShader;
        /*  116 */ PFNGLDISABLEVERTEXATTRIBARRAYPROC DisableVertexAttribArray;
        /*  117 */ PFNGLENABLEVERTEXATTRIBARRAYPROC EnableVertexAttribArray;
        /*  118 */ PFNGLGETACTIVEATTRIBPROC GetActiveAttrib;
        /*  119 */ PFNGLGETACTIVEUNIFORMPROC GetActiveUniform;
        /*  120 */ PFNGLGETATTACHEDSHADERSPROC GetAttachedShaders;
        /*  121 */ PFNGLGETATTRIBLOCATIONPROC GetAttribLocation;
        /*  122 */ PFNGLGETPROGRAMIVPROC GetProgramiv;
        /*  123 */ PFNGLGETPROGRAMINFOLOGPROC GetProgramInfoLog;
        /*  124 */ PFNGLGETSHADERIVPROC GetShaderiv;
        /*  125 */ PFNGLGETSHADERINFOLOGPROC GetShaderInfoLog;
        /*  126 */ PFNGLGETSHADERSOURCEPROC GetShaderSource;
        /*  127 */ PFNGLGETUNIFORMLOCATIONPROC GetUniformLocation;
        /*  128 */ PFNGLGETUNIFORMFVPROC GetUniformfv;
        /*  129 */ PFNGLGETUNIFORMIVPROC GetUniformiv;
        /*  130 */ PFNGLGETVERTEXATTRIBDVPROC GetVertexAttribdv;
        /*  131 */ PFNGLGETVERTEXATTRIBFVPROC GetVertexAttribfv;
        /*  132 */ PFNGLGETVERTEXATTRIBIVPROC GetVertexAttribiv;
        /*  133 */ PFNGLGETVERTEXATTRIBPOINTERVPROC GetVertexAttribPointerv;
        /*  134 */ PFNGLISPROGRAMPROC IsProgram;
        /*  135 */ PFNGLISSHADERPROC IsShader;
        /*  136 */ PFNGLLINKPROGRAMPROC LinkProgram;
        /*  137 */ PFNGLSHADERSOURCEPROC ShaderSource;
        /*  138 */ PFNGLUSEPROGRAMPROC UseProgram;
        /*  139 */ PFNGLUNIFORM1FPROC Uniform1f;
        /*  140 */ PFNGLUNIFORM2FPROC Uniform2f;
        /*  141 */ PFNGLUNIFORM3FPROC Uniform3f;
        /*  142 */ PFNGLUNIFORM4FPROC Uniform4f;
        /*  143 */ PFNGLUNIFORM1IPROC Uniform1i;
        /*  144 */ PFNGLUNIFORM2IPROC Uniform2i;
        /*  145 */ PFNGLUNIFORM3IPROC Uniform3i;
        /*  146 */ PFNGLUNIFORM4IPROC Uniform4i;
        /*  147 */ PFNGLUNIFORM1FVPROC Uniform1fv;
        /*  148 */ PFNGLUNIFORM2FVPROC Uniform2fv;
        /*  149 */ PFNGLUNIFORM3FVPROC Uniform3fv;
        /*  150 */ PFNGLUNIFORM4FVPROC Uniform4fv;
        /*  151 */ PFNGLUNIFORM1IVPROC Uniform1iv;
        /*  152 */ PFNGLUNIFORM2IVPROC Uniform2iv;
        /*  153 */ PFNGLUNIFORM3IVPROC Uniform3iv;
        /*  154 */ PFNGLUNIFORM4IVPROC Uniform4iv;
        /*  155 */ PFNGLUNIFORMMATRIX2FVPROC UniformMatrix2fv;
        /*  156 */ PFNGLUNIFORMMATRIX3FVPROC UniformMatrix3fv;
        /*  157 */ PFNGLUNIFORMMATRIX4FVPROC UniformMatrix4fv;
        /*  158 */ PFNGLVALIDATEPROGRAMPROC ValidateProgram;
        /*  159 */ PFNGLVERTEXATTRIB1DPROC VertexAttrib1d;
        /*  160 */ PFNGLVERTEXATTRIB1DVPROC VertexAttrib1dv;
        /*  161 */ PFNGLVERTEXATTRIB1FPROC VertexAttrib1f;
        /*  162 */ PFNGLVERTEXATTRIB1FVPROC VertexAttrib1fv;
        /*  163 */ PFNGLVERTEXATTRIB1SPROC VertexAttrib1s;
        /*  164 */ PFNGLVERTEXATTRIB1SVPROC VertexAttrib1sv;
        /*  165 */ PFNGLVERTEXATTRIB2DPROC VertexAttrib2d;
        /*  166 */ PFNGLVERTEXATTRIB2DVPROC VertexAttrib2dv;
        /*  167 */ PFNGLVERTEXATTRIB2FPROC VertexAttrib2f;
        /*  168 */ PFNGLVERTEXATTRIB2FVPROC VertexAttrib2fv;
        /*  169 */ PFNGLVERTEXATTRIB2SPROC VertexAttrib2s;
        /*  170 */ PFNGLVERTEXATTRIB2SVPROC VertexAttrib2sv;
        /*  171 */ PFNGLVERTEXATTRIB3DPROC VertexAttrib3d;
        /*  172 */ PFNGLVERTEXATTRIB3DVPROC VertexAttrib3dv;
        /*  173 */ PFNGLVERTEXATTRIB3FPROC VertexAttrib3f;
        /*  174 */ PFNGLVERTEXATTRIB3FVPROC VertexAttrib3fv;
        /*  175 */ PFNGLVERTEXATTRIB3SPROC VertexAttrib3s;
        /*  176 */ PFNGLVERTEXATTRIB3SVPROC VertexAttrib3sv;
        /*  177 */ PFNGLVERTEXATTRIB4NBVPROC VertexAttrib4Nbv;
        /*  178 */ PFNGLVERTEXATTRIB4NIVPROC VertexAttrib4Niv;
        /*  179 */ PFNGLVERTEXATTRIB4NSVPROC VertexAttrib4Nsv;
        /*  180 */ PFNGLVERTEXATTRIB4NUBPROC VertexAttrib4Nub;
        /*  181 */ PFNGLVERTEXATTRIB4NUBVPROC VertexAttrib4Nubv;
        /*  182 */ PFNGLVERTEXATTRIB4NUIVPROC VertexAttrib4Nuiv;
        /*  183 */ PFNGLVERTEXATTRIB4NUSVPROC VertexAttrib4Nusv;
        /*  184 */ PFNGLVERTEXATTRIB4BVPROC VertexAttrib4bv;
        /*  185 */ PFNGLVERTEXATTRIB4DPROC VertexAttrib4d;
        /*  186 */ PFNGLVERTEXATTRIB4DVPROC VertexAttrib4dv;
        /*  187 */ PFNGLVERTEXATTRIB4FPROC VertexAttrib4f;
        /*  188 */ PFNGLVERTEXATTRIB4FVPROC VertexAttrib4fv;
        /*  189 */ PFNGLVERTEXATTRIB4IVPROC VertexAttrib4iv;
        /*  190 */ PFNGLVERTEXATTRIB4SPROC VertexAttrib4s;
        /*  191 */ PFNGLVERTEXATTRIB4SVPROC VertexAttrib4sv;
        /*  192 */ PFNGLVERTEXATTRIB4UBVPROC VertexAttrib4ubv;
        /*  193 */ PFNGLVERTEXATTRIB4UIVPROC VertexAttrib4uiv;
        /*  194 */ PFNGLVERTEXATTRIB4USVPROC VertexAttrib4usv;
        /*  195 */ PFNGLVERTEXATTRIBPOINTERPROC VertexAttribPointer;
        /*  196 */ PFNGLUNIFORMMATRIX2X3FVPROC UniformMatrix2x3fv;
        /*  197 */ PFNGLUNIFORMMATRIX3X2FVPROC UniformMatrix3x2fv;
        /*  198 */ PFNGLUNIFORMMATRIX2X4FVPROC UniformMatrix2x4fv;
        /*  199 */ PFNGLUNIFORMMATRIX4X2FVPROC UniformMatrix4x2fv;
        /*  200 */ PFNGLUNIFORMMATRIX3X4FVPROC UniformMatrix3x4fv;
        /*  201 */ PFNGLUNIFORMMATRIX4X3FVPROC UniformMatrix4x3fv;
        /*  202 */ PFNGLCOLORMASKIPROC ColorMaski;
        /*  203 */ PFNGLGETBOOLEANI_VPROC GetBooleani_v;
        /*  204 */ PFNGLGETINTEGERI_VPROC GetIntegeri_v;
        /*  205 */ PFNGLENABLEIPROC Enablei;
        /*  206 */ PFNGLDISABLEIPROC Disablei;
        /*  207 */ PFNGLISENABLEDIPROC IsEnabledi;
        /*  208 */ PFNGLBEGINTRANSFORMFEEDBACKPROC BeginTransformFeedback;
        /*  209 */ PFNGLENDTRANSFORMFEEDBACKPROC EndTransformFeedback;
        /*  210 */ PFNGLBINDBUFFERRANGEPROC BindBufferRange;
        /*  211 */ PFNGLBINDBUFFERBASEPROC BindBufferBase;
        /*  212 */ PFNGLTRANSFORMFEEDBACKVARYINGSPROC TransformFeedbackVaryings;
        /*  213 */ PFNGLGETTRANSFORMFEEDBACKVARYINGPROC GetTransformFeedbackVarying;
        /*  214 */ PFNGLCLAMPCOLORPROC ClampColor;
        /*  215 */ PFNGLBEGINCONDITIONALRENDERPROC BeginConditionalRender;
        /*  216 */ PFNGLENDCONDITIONALRENDERPROC EndConditionalRender;
        /*  217 */ PFNGLVERTEXATTRIBIPOINTERPROC VertexAttribIPointer;
        /*  218 */ PFNGLGETVERTEXATTRIBIIVPROC GetVertexAttribIiv;
        /*  219 */ PFNGLGETVERTEXATTRIBIUIVPROC GetVertexAttribIuiv;
        /*  220 */ PFNGLVERTEXATTRIBI1IPROC VertexAttribI1i;
        /*  221 */ PFNGLVERTEXATTRIBI2IPROC VertexAttribI2i;
        /*  222 */ PFNGLVERTEXATTRIBI3IPROC VertexAttribI3i;
        /*  223 */ PFNGLVERTEXATTRIBI4IPROC VertexAttribI4i;
        /*  224 */ PFNGLVERTEXATTRIBI1UIPROC VertexAttribI1ui;
        /*  225 */ PFNGLVERTEXATTRIBI2UIPROC VertexAttribI2ui;
        /*  226 */ PFNGLVERTEXATTRIBI3UIPROC VertexAttribI3ui;
        /*  227 */ PFNGLVERTEXATTRIBI4UIPROC VertexAttribI4ui;
        /*  228 */ PFNGLVERTEXATTRIBI1IVPROC VertexAttribI1iv;
        /*  229 */ PFNGLVERTEXATTRIBI2IVPROC VertexAttribI2iv;
        /*  230 */ PFNGLVERTEXATTRIBI3IVPROC VertexAttribI3iv;
        /*  231 */ PFNGLVERTEXATTRIBI4IVPROC VertexAttribI4iv;
        /*  232 */ PFNGLVERTEXATTRIBI1UIVPROC VertexAttribI1uiv;
        /*  233 */ PFNGLVERTEXATTRIBI2UIVPROC VertexAttribI2uiv;
        /*  234 */ PFNGLVERTEXATTRIBI3UIVPROC VertexAttribI3uiv;
        /*  235 */ PFNGLVERTEXATTRIBI4UIVPROC VertexAttribI4uiv;
        /*  236 */ PFNGLVERTEXATTRIBI4BVPROC VertexAttribI4bv;
        /*  237 */ PFNGLVERTEXATTRIBI4SVPROC VertexAttribI4sv;
        /*  238 */ PFNGLVERTEXATTRIBI4UBVPROC VertexAttribI4ubv;
        /*  239 */ PFNGLVERTEXATTRIBI4USVPROC VertexAttribI4usv;
        /*  240 */ PFNGLGETUNIFORMUIVPROC GetUniformuiv;
        /*  241 */ PFNGLBINDFRAGDATALOCATIONPROC BindFragDataLocation;
        /*  242 */ PFNGLGETFRAGDATALOCATIONPROC GetFragDataLocation;
        /*  243 */ PFNGLUNIFORM1UIPROC Uniform1ui;
        /*  244 */ PFNGLUNIFORM2UIPROC Uniform2ui;
        /*  245 */ PFNGLUNIFORM3UIPROC Uniform3ui;
        /*  246 */ PFNGLUNIFORM4UIPROC Uniform4ui;
        /*  247 */ PFNGLUNIFORM1UIVPROC Uniform1uiv;
        /*  248 */ PFNGLUNIFORM2UIVPROC Uniform2uiv;
        /*  249 */ PFNGLUNIFORM3UIVPROC Uniform3uiv;
        /*  250 */ PFNGLUNIFORM4UIVPROC Uniform4uiv;
        /*  251 */ PFNGLTEXPARAMETERIIVPROC TexParameterIiv;
        /*  252 */ PFNGLTEXPARAMETERIUIVPROC TexParameterIuiv;
        /*  253 */ PFNGLGETTEXPARAMETERIIVPROC GetTexParameterIiv;
        /*  254 */ PFNGLGETTEXPARAMETERIUIVPROC GetTexParameterIuiv;
        /*  255 */ PFNGLCLEARBUFFERIVPROC ClearBufferiv;
        /*  256 */ PFNGLCLEARBUFFERUIVPROC ClearBufferuiv;
        /*  257 */ PFNGLCLEARBUFFERFVPROC ClearBufferfv;
        /*  258 */ PFNGLCLEARBUFFERFIPROC ClearBufferfi;
        /*  259 */ PFNGLGETSTRINGIPROC GetStringi;
        /*  260 */ PFNGLISRENDERBUFFERPROC IsRenderbuffer;
        /*  261 */ PFNGLBINDRENDERBUFFERPROC BindRenderbuffer;
        /*  262 */ PFNGLDELETERENDERBUFFERSPROC DeleteRenderbuffers;
        /*  263 */ PFNGLGENRENDERBUFFERSPROC GenRenderbuffers;
        /*  264 */ PFNGLRENDERBUFFERSTORAGEPROC RenderbufferStorage;
        /*  265 */ PFNGLGETRENDERBUFFERPARAMETERIVPROC GetRenderbufferParameteriv;
        /*  266 */ PFNGLISFRAMEBUFFERPROC IsFramebuffer;
        /*  267 */ PFNGLBINDFRAMEBUFFERPROC BindFramebuffer;
        /*  268 */ PFNGLDELETEFRAMEBUFFERSPROC DeleteFramebuffers;
        /*  269 */ PFNGLGENFRAMEBUFFERSPROC GenFramebuffers;
        /*  270 */ PFNGLCHECKFRAMEBUFFERSTATUSPROC CheckFramebufferStatus;
        /*  271 */ PFNGLFRAMEBUFFERTEXTURE1DPROC FramebufferTexture1D;
        /*  272 */ PFNGLFRAMEBUFFERTEXTURE2DPROC FramebufferTexture2D;
        /*  273 */ PFNGLFRAMEBUFFERTEXTURE3DPROC FramebufferTexture3D;
        /*  274 */ PFNGLFRAMEBUFFERRENDERBUFFERPROC FramebufferRenderbuffer;
        /*  275 */ PFNGLGETFRAMEBUFFERATTACHMENTPARAMETERIVPROC GetFramebufferAttachmentParameteriv;
        /*  276 */ PFNGLGENERATEMIPMAPPROC GenerateMipmap;
        /*  277 */ PFNGLBLITFRAMEBUFFERPROC BlitFramebuffer;
        /*  278 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEPROC RenderbufferStorageMultisample;
        /*  279 */ PFNGLFRAMEBUFFERTEXTURELAYERPROC FramebufferTextureLayer;
        /*  280 */ PFNGLMAPBUFFERRANGEPROC MapBufferRange;
        /*  281 */ PFNGLFLUSHMAPPEDBUFFERRANGEPROC FlushMappedBufferRange;
        /*  282 */ PFNGLBINDVERTEXARRAYPROC BindVertexArray;
        /*  283 */ PFNGLDELETEVERTEXARRAYSPROC DeleteVertexArrays;
        /*  284 */ PFNGLGENVERTEXARRAYSPROC GenVertexArrays;
        /*  285 */ PFNGLISVERTEXARRAYPROC IsVertexArray;
        /*  286 */ PFNGLDRAWARRAYSINSTANCEDPROC DrawArraysInstanced;
        /*  287 */ PFNGLDRAWELEMENTSINSTANCEDPROC DrawElementsInstanced;
        /*  288 */ PFNGLTEXBUFFERPROC TexBuffer;
        /*  289 */ PFNGLPRIMITIVERESTARTINDEXPROC PrimitiveRestartIndex;
        /*  290 */ PFNGLCOPYBUFFERSUBDATAPROC CopyBufferSubData;
        /*  291 */ PFNGLGETUNIFORMINDICESPROC GetUniformIndices;
        /*  292 */ PFNGLGETACTIVEUNIFORMSIVPROC GetActiveUniformsiv;
        /*  293 */ PFNGLGETACTIVEUNIFORMNAMEPROC GetActiveUniformName;
        /*  294 */ PFNGLGETUNIFORMBLOCKINDEXPROC GetUniformBlockIndex;
        /*  295 */ PFNGLGETACTIVEUNIFORMBLOCKIVPROC GetActiveUniformBlockiv;
        /*  296 */ PFNGLGETACTIVEUNIFORMBLOCKNAMEPROC GetActiveUniformBlockName;
        /*  297 */ PFNGLUNIFORMBLOCKBINDINGPROC UniformBlockBinding;
        /*  298 */ PFNGLDRAWELEMENTSBASEVERTEXPROC DrawElementsBaseVertex;
        /*  299 */ PFNGLDRAWRANGEELEMENTSBASEVERTEXPROC DrawRangeElementsBaseVertex;
        /*  300 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXPROC DrawElementsInstancedBaseVertex;
        /*  301 */ PFNGLMULTIDRAWELEMENTSBASEVERTEXPROC MultiDrawElementsBaseVertex;
        /*  302 */ PFNGLPROVOKINGVERTEXPROC ProvokingVertex;
        /*  303 */ PFNGLFENCESYNCPROC FenceSync;
        /*  304 */ PFNGLISSYNCPROC IsSync;
        /*  305 */ PFNGLDELETESYNCPROC DeleteSync;
        /*  306 */ PFNGLCLIENTWAITSYNCPROC ClientWaitSync;
        /*  307 */ PFNGLWAITSYNCPROC WaitSync;
        /*  308 */ PFNGLGETINTEGER64VPROC GetInteger64v;
        /*  309 */ PFNGLGETSYNCIVPROC GetSynciv;
        /*  310 */ PFNGLGETINTEGER64I_VPROC GetInteger64i_v;
        /*  311 */ PFNGLGETBUFFERPARAMETERI64VPROC GetBufferParameteri64v;
        /*  312 */ PFNGLFRAMEBUFFERTEXTUREPROC FramebufferTexture;
        /*  313 */ PFNGLTEXIMAGE2DMULTISAMPLEPROC TexImage2DMultisample;
        /*  314 */ PFNGLTEXIMAGE3DMULTISAMPLEPROC TexImage3DMultisample;
        /*  315 */ PFNGLGETMULTISAMPLEFVPROC GetMultisamplefv;
        /*  316 */ PFNGLSAMPLEMASKIPROC SampleMaski;
        /*  317 */ PFNGLBINDFRAGDATALOCATIONINDEXEDPROC BindFragDataLocationIndexed;
        /*  318 */ PFNGLGETFRAGDATAINDEXPROC GetFragDataIndex;
        /*  319 */ PFNGLGENSAMPLERSPROC GenSamplers;
        /*  320 */ PFNGLDELETESAMPLERSPROC DeleteSamplers;
        /*  321 */ PFNGLISSAMPLERPROC IsSampler;
        /*  322 */ PFNGLBINDSAMPLERPROC BindSampler;
        /*  323 */ PFNGLSAMPLERPARAMETERIPROC SamplerParameteri;
        /*  324 */ PFNGLSAMPLERPARAMETERIVPROC SamplerParameteriv;
        /*  325 */ PFNGLSAMPLERPARAMETERFPROC SamplerParameterf;
        /*  326 */ PFNGLSAMPLERPARAMETERFVPROC SamplerParameterfv;
        /*  327 */ PFNGLSAMPLERPARAMETERIIVPROC SamplerParameterIiv;
        /*  328 */ PFNGLSAMPLERPARAMETERIUIVPROC SamplerParameterIuiv;
        /*  329 */ PFNGLGETSAMPLERPARAMETERIVPROC GetSamplerParameteriv;
        /*  330 */ PFNGLGETSAMPLERPARAMETERIIVPROC GetSamplerParameterIiv;
        /*  331 */ PFNGLGETSAMPLERPARAMETERFVPROC GetSamplerParameterfv;
        /*  332 */ PFNGLGETSAMPLERPARAMETERIUIVPROC GetSamplerParameterIuiv;
        /*  333 */ PFNGLQUERYCOUNTERPROC QueryCounter;
        /*  334 */ PFNGLGETQUERYOBJECTI64VPROC GetQueryObjecti64v;
        /*  335 */ PFNGLGETQUERYOBJECTUI64VPROC GetQueryObjectui64v;
        /*  336 */ PFNGLVERTEXATTRIBDIVISORPROC VertexAttribDivisor;
        /*  337 */ PFNGLVERTEXATTRIBP1UIPROC VertexAttribP1ui;
        /*  338 */ PFNGLVERTEXATTRIBP1UIVPROC VertexAttribP1uiv;
        /*  339 */ PFNGLVERTEXATTRIBP2UIPROC VertexAttribP2ui;
        /*  340 */ PFNGLVERTEXATTRIBP2UIVPROC VertexAttribP2uiv;
        /*  341 */ PFNGLVERTEXATTRIBP3UIPROC VertexAttribP3ui;
        /*  342 */ PFNGLVERTEXATTRIBP3UIVPROC VertexAttribP3uiv;
        /*  343 */ PFNGLVERTEXATTRIBP4UIPROC VertexAttribP4ui;
        /*  344 */ PFNGLVERTEXATTRIBP4UIVPROC VertexAttribP4uiv;
        /*  345 */ PFNGLMINSAMPLESHADINGPROC MinSampleShading;
        /*  346 */ PFNGLBLENDEQUATIONIPROC BlendEquationi;
        /*  347 */ PFNGLBLENDEQUATIONSEPARATEIPROC BlendEquationSeparatei;
        /*  348 */ PFNGLBLENDFUNCIPROC BlendFunci;
        /*  349 */ PFNGLBLENDFUNCSEPARATEIPROC BlendFuncSeparatei;
        /*  350 */ PFNGLDRAWARRAYSINDIRECTPROC DrawArraysIndirect;
        /*  351 */ PFNGLDRAWELEMENTSINDIRECTPROC DrawElementsIndirect;
        /*  352 */ PFNGLUNIFORM1DPROC Uniform1d;
        /*  353 */ PFNGLUNIFORM2DPROC Uniform2d;
        /*  354 */ PFNGLUNIFORM3DPROC Uniform3d;
        /*  355 */ PFNGLUNIFORM4DPROC Uniform4d;
        /*  356 */ PFNGLUNIFORM1DVPROC Uniform1dv;
        /*  357 */ PFNGLUNIFORM2DVPROC Uniform2dv;
        /*  358 */ PFNGLUNIFORM3DVPROC Uniform3dv;
        /*  359 */ PFNGLUNIFORM4DVPROC Uniform4dv;
        /*  360 */ PFNGLUNIFORMMATRIX2DVPROC UniformMatrix2dv;
        /*  361 */ PFNGLUNIFORMMATRIX3DVPROC UniformMatrix3dv;
        /*  362 */ PFNGLUNIFORMMATRIX4DVPROC UniformMatrix4dv;
        /*  363 */ PFNGLUNIFORMMATRIX2X3DVPROC UniformMatrix2x3dv;
        /*  364 */ PFNGLUNIFORMMATRIX2X4DVPROC UniformMatrix2x4dv;
        /*  365 */ PFNGLUNIFORMMATRIX3X2DVPROC UniformMatrix3x2dv;
        /*  366 */ PFNGLUNIFORMMATRIX3X4DVPROC UniformMatrix3x4dv;
        /*  367 */ PFNGLUNIFORMMATRIX4X2DVPROC UniformMatrix4x2dv;
        /*  368 */ PFNGLUNIFORMMATRIX4X3DVPROC UniformMatrix4x3dv;
        /*  369 */ PFNGLGETUNIFORMDVPROC GetUniformdv;
        /*  370 */ PFNGLGETSUBROUTINEUNIFORMLOCATIONPROC GetSubroutineUniformLocation;
        /*  371 */ PFNGLGETSUBROUTINEINDEXPROC GetSubroutineIndex;
        /*  372 */ PFNGLGETACTIVESUBROUTINEUNIFORMIVPROC GetActiveSubroutineUniformiv;
        /*  373 */ PFNGLGETACTIVESUBROUTINEUNIFORMNAMEPROC GetActiveSubroutineUniformName;
        /*  374 */ PFNGLGETACTIVESUBROUTINENAMEPROC GetActiveSubroutineName;
        /*  375 */ PFNGLUNIFORMSUBROUTINESUIVPROC UniformSubroutinesuiv;
        /*  376 */ PFNGLGETUNIFORMSUBROUTINEUIVPROC GetUniformSubroutineuiv;
        /*  377 */ PFNGLGETPROGRAMSTAGEIVPROC GetProgramStageiv;
        /*  378 */ PFNGLPATCHPARAMETERIPROC PatchParameteri;
        /*  379 */ PFNGLPATCHPARAMETERFVPROC PatchParameterfv;
        /*  380 */ PFNGLBINDTRANSFORMFEEDBACKPROC BindTransformFeedback;
        /*  381 */ PFNGLDELETETRANSFORMFEEDBACKSPROC DeleteTransformFeedbacks;
        /*  382 */ PFNGLGENTRANSFORMFEEDBACKSPROC GenTransformFeedbacks;
        /*  383 */ PFNGLISTRANSFORMFEEDBACKPROC IsTransformFeedback;
        /*  384 */ PFNGLPAUSETRANSFORMFEEDBACKPROC PauseTransformFeedback;
        /*  385 */ PFNGLRESUMETRANSFORMFEEDBACKPROC ResumeTransformFeedback;
        /*  386 */ PFNGLDRAWTRANSFORMFEEDBACKPROC DrawTransformFeedback;
        /*  387 */ PFNGLDRAWTRANSFORMFEEDBACKSTREAMPROC DrawTransformFeedbackStream;
        /*  388 */ PFNGLBEGINQUERYINDEXEDPROC BeginQueryIndexed;
        /*  389 */ PFNGLENDQUERYINDEXEDPROC EndQueryIndexed;
        /*  390 */ PFNGLGETQUERYINDEXEDIVPROC GetQueryIndexediv;
        /*  391 */ PFNGLRELEASESHADERCOMPILERPROC ReleaseShaderCompiler;
        /*  392 */ PFNGLSHADERBINARYPROC ShaderBinary;
        /*  393 */ PFNGLGETSHADERPRECISIONFORMATPROC GetShaderPrecisionFormat;
        /*  394 */ PFNGLDEPTHRANGEFPROC DepthRangef;
        /*  395 */ PFNGLCLEARDEPTHFPROC ClearDepthf;
        /*  396 */ PFNGLGETPROGRAMBINARYPROC GetProgramBinary;
        /*  397 */ PFNGLPROGRAMBINARYPROC ProgramBinary;
        /*  398 */ PFNGLPROGRAMPARAMETERIPROC ProgramParameteri;
        /*  399 */ PFNGLUSEPROGRAMSTAGESPROC UseProgramStages;
        /*  400 */ PFNGLACTIVESHADERPROGRAMPROC ActiveShaderProgram;
        /*  401 */ PFNGLCREATESHADERPROGRAMVPROC CreateShaderProgramv;
        /*  402 */ PFNGLBINDPROGRAMPIPELINEPROC BindProgramPipeline;
        /*  403 */ PFNGLDELETEPROGRAMPIPELINESPROC DeleteProgramPipelines;
        /*  404 */ PFNGLGENPROGRAMPIPELINESPROC GenProgramPipelines;
        /*  405 */ PFNGLISPROGRAMPIPELINEPROC IsProgramPipeline;
        /*  406 */ PFNGLGETPROGRAMPIPELINEIVPROC GetProgramPipelineiv;
        /*  407 */ PFNGLPROGRAMUNIFORM1IPROC ProgramUniform1i;
        /*  408 */ PFNGLPROGRAMUNIFORM1IVPROC ProgramUniform1iv;
        /*  409 */ PFNGLPROGRAMUNIFORM1FPROC ProgramUniform1f;
        /*  410 */ PFNGLPROGRAMUNIFORM1FVPROC ProgramUniform1fv;
        /*  411 */ PFNGLPROGRAMUNIFORM1DPROC ProgramUniform1d;
        /*  412 */ PFNGLPROGRAMUNIFORM1DVPROC ProgramUniform1dv;
        /*  413 */ PFNGLPROGRAMUNIFORM1UIPROC ProgramUniform1ui;
        /*  414 */ PFNGLPROGRAMUNIFORM1UIVPROC ProgramUniform1uiv;
        /*  415 */ PFNGLPROGRAMUNIFORM2IPROC ProgramUniform2i;
        /*  416 */ PFNGLPROGRAMUNIFORM2IVPROC ProgramUniform2iv;
        /*  417 */ PFNGLPROGRAMUNIFORM2FPROC ProgramUniform2f;
        /*  418 */ PFNGLPROGRAMUNIFORM2FVPROC ProgramUniform2fv;
        /*  419 */ PFNGLPROGRAMUNIFORM2DPROC ProgramUniform2d;
        /*  420 */ PFNGLPROGRAMUNIFORM2DVPROC ProgramUniform2dv;
        /*  421 */ PFNGLPROGRAMUNIFORM2UIPROC ProgramUniform2ui;
        /*  422 */ PFNGLPROGRAMUNIFORM2UIVPROC ProgramUniform2uiv;
        /*  423 */ PFNGLPROGRAMUNIFORM3IPROC ProgramUniform3i;
        /*  424 */ PFNGLPROGRAMUNIFORM3IVPROC ProgramUniform3iv;
        /*  425 */ PFNGLPROGRAMUNIFORM3FPROC ProgramUniform3f;
        /*  426 */ PFNGLPROGRAMUNIFORM3FVPROC ProgramUniform3fv;
        /*  427 */ PFNGLPROGRAMUNIFORM3DPROC ProgramUniform3d;
        /*  428 */ PFNGLPROGRAMUNIFORM3DVPROC ProgramUniform3dv;
        /*  429 */ PFNGLPROGRAMUNIFORM3UIPROC ProgramUniform3ui;
        /*  430 */ PFNGLPROGRAMUNIFORM3UIVPROC ProgramUniform3uiv;
        /*  431 */ PFNGLPROGRAMUNIFORM4IPROC ProgramUniform4i;
        /*  432 */ PFNGLPROGRAMUNIFORM4IVPROC ProgramUniform4iv;
        /*  433 */ PFNGLPROGRAMUNIFORM4FPROC ProgramUniform4f;
        /*  434 */ PFNGLPROGRAMUNIFORM4FVPROC ProgramUniform4fv;
        /*  435 */ PFNGLPROGRAMUNIFORM4DPROC ProgramUniform4d;
        /*  436 */ PFNGLPROGRAMUNIFORM4DVPROC ProgramUniform4dv;
        /*  437 */ PFNGLPROGRAMUNIFORM4UIPROC ProgramUniform4ui;
        /*  438 */ PFNGLPROGRAMUNIFORM4UIVPROC ProgramUniform4uiv;
        /*  439 */ PFNGLPROGRAMUNIFORMMATRIX2FVPROC ProgramUniformMatrix2fv;
        /*  440 */ PFNGLPROGRAMUNIFORMMATRIX3FVPROC ProgramUniformMatrix3fv;
        /*  441 */ PFNGLPROGRAMUNIFORMMATRIX4FVPROC ProgramUniformMatrix4fv;
        /*  442 */ PFNGLPROGRAMUNIFORMMATRIX2DVPROC ProgramUniformMatrix2dv;
        /*  443 */ PFNGLPROGRAMUNIFORMMATRIX3DVPROC ProgramUniformMatrix3dv;
        /*  444 */ PFNGLPROGRAMUNIFORMMATRIX4DVPROC ProgramUniformMatrix4dv;
        /*  445 */ PFNGLPROGRAMUNIFORMMATRIX2X3FVPROC ProgramUniformMatrix2x3fv;
        /*  446 */ PFNGLPROGRAMUNIFORMMATRIX3X2FVPROC ProgramUniformMatrix3x2fv;
        /*  447 */ PFNGLPROGRAMUNIFORMMATRIX2X4FVPROC ProgramUniformMatrix2x4fv;
        /*  448 */ PFNGLPROGRAMUNIFORMMATRIX4X2FVPROC ProgramUniformMatrix4x2fv;
        /*  449 */ PFNGLPROGRAMUNIFORMMATRIX3X4FVPROC ProgramUniformMatrix3x4fv;
        /*  450 */ PFNGLPROGRAMUNIFORMMATRIX4X3FVPROC ProgramUniformMatrix4x3fv;
        /*  451 */ PFNGLPROGRAMUNIFORMMATRIX2X3DVPROC ProgramUniformMatrix2x3dv;
        /*  452 */ PFNGLPROGRAMUNIFORMMATRIX3X2DVPROC ProgramUniformMatrix3x2dv;
        /*  453 */ PFNGLPROGRAMUNIFORMMATRIX2X4DVPROC ProgramUniformMatrix2x4dv;
        /*  454 */ PFNGLPROGRAMUNIFORMMATRIX4X2DVPROC ProgramUniformMatrix4x2dv;
        /*  455 */ PFNGLPROGRAMUNIFORMMATRIX3X4DVPROC ProgramUniformMatrix3x4dv;
        /*  456 */ PFNGLPROGRAMUNIFORMMATRIX4X3DVPROC ProgramUniformMatrix4x3dv;
        /*  457 */ PFNGLVALIDATEPROGRAMPIPELINEPROC ValidateProgramPipeline;
        /*  458 */ PFNGLGETPROGRAMPIPELINEINFOLOGPROC GetProgramPipelineInfoLog;
        /*  459 */ PFNGLVERTEXATTRIBL1DPROC VertexAttribL1d;
        /*  460 */ PFNGLVERTEXATTRIBL2DPROC VertexAttribL2d;
        /*  461 */ PFNGLVERTEXATTRIBL3DPROC VertexAttribL3d;
        /*  462 */ PFNGLVERTEXATTRIBL4DPROC VertexAttribL4d;
        /*  463 */ PFNGLVERTEXATTRIBL1DVPROC VertexAttribL1dv;
        /*  464 */ PFNGLVERTEXATTRIBL2DVPROC VertexAttribL2dv;
        /*  465 */ PFNGLVERTEXATTRIBL3DVPROC VertexAttribL3dv;
        /*  466 */ PFNGLVERTEXATTRIBL4DVPROC VertexAttribL4dv;
        /*  467 */ PFNGLVERTEXATTRIBLPOINTERPROC VertexAttribLPointer;
        /*  468 */ PFNGLGETVERTEXATTRIBLDVPROC GetVertexAttribLdv;
        /*  469 */ PFNGLVIEWPORTARRAYVPROC ViewportArrayv;
        /*  470 */ PFNGLVIEWPORTINDEXEDFPROC ViewportIndexedf;
        /*  471 */ PFNGLVIEWPORTINDEXEDFVPROC ViewportIndexedfv;
        /*  472 */ PFNGLSCISSORARRAYVPROC ScissorArrayv;
        /*  473 */ PFNGLSCISSORINDEXEDPROC ScissorIndexed;
        /*  474 */ PFNGLSCISSORINDEXEDVPROC ScissorIndexedv;
        /*  475 */ PFNGLDEPTHRANGEARRAYVPROC DepthRangeArrayv;
        /*  476 */ PFNGLDEPTHRANGEINDEXEDPROC DepthRangeIndexed;
        /*  477 */ PFNGLGETFLOATI_VPROC GetFloati_v;
        /*  478 */ PFNGLGETDOUBLEI_VPROC GetDoublei_v;
        /*  479 */ PFNGLDRAWARRAYSINSTANCEDBASEINSTANCEPROC DrawArraysInstancedBaseInstance;
        /*  480 */ PFNGLDRAWELEMENTSINSTANCEDBASEINSTANCEPROC DrawElementsInstancedBaseInstance;
        /*  481 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXBASEINSTANCEPROC DrawElementsInstancedBaseVertexBaseInstance;
        /*  482 */ PFNGLGETINTERNALFORMATIVPROC GetInternalformativ;
        /*  483 */ PFNGLGETACTIVEATOMICCOUNTERBUFFERIVPROC GetActiveAtomicCounterBufferiv;
        /*  484 */ PFNGLBINDIMAGETEXTUREPROC BindImageTexture;
        /*  485 */ PFNGLMEMORYBARRIERPROC MemoryBarrier;
        /*  486 */ PFNGLTEXSTORAGE1DPROC TexStorage1D;
        /*  487 */ PFNGLTEXSTORAGE2DPROC TexStorage2D;
        /*  488 */ PFNGLTEXSTORAGE3DPROC TexStorage3D;
        /*  489 */ PFNGLDRAWTRANSFORMFEEDBACKINSTANCEDPROC DrawTransformFeedbackInstanced;
        /*  490 */ PFNGLDRAWTRANSFORMFEEDBACKSTREAMINSTANCEDPROC DrawTransformFeedbackStreamInstanced;
        /*  491 */ PFNGLCLEARBUFFERDATAPROC ClearBufferData;
        /*  492 */ PFNGLCLEARBUFFERSUBDATAPROC ClearBufferSubData;
        /*  493 */ PFNGLDISPATCHCOMPUTEPROC DispatchCompute;
        /*  494 */ PFNGLDISPATCHCOMPUTEINDIRECTPROC DispatchComputeIndirect;
        /*  495 */ PFNGLCOPYIMAGESUBDATAPROC CopyImageSubData;
        /*  496 */ PFNGLFRAMEBUFFERPARAMETERIPROC FramebufferParameteri;
        /*  497 */ PFNGLGETFRAMEBUFFERPARAMETERIVPROC GetFramebufferParameteriv;
        /*  498 */ PFNGLGETINTERNALFORMATI64VPROC GetInternalformati64v;
        /*  499 */ PFNGLINVALIDATETEXSUBIMAGEPROC InvalidateTexSubImage;
        /*  500 */ PFNGLINVALIDATETEXIMAGEPROC InvalidateTexImage;
        /*  501 */ PFNGLINVALIDATEBUFFERSUBDATAPROC InvalidateBufferSubData;
        /*  502 */ PFNGLINVALIDATEBUFFERDATAPROC InvalidateBufferData;
        /*  503 */ PFNGLINVALIDATEFRAMEBUFFERPROC InvalidateFramebuffer;
        /*  504 */ PFNGLINVALIDATESUBFRAMEBUFFERPROC InvalidateSubFramebuffer;
        /*  505 */ PFNGLMULTIDRAWARRAYSINDIRECTPROC MultiDrawArraysIndirect;
        /*  506 */ PFNGLMULTIDRAWELEMENTSINDIRECTPROC MultiDrawElementsIndirect;
        /*  507 */ PFNGLGETPROGRAMINTERFACEIVPROC GetProgramInterfaceiv;
        /*  508 */ PFNGLGETPROGRAMRESOURCEINDEXPROC GetProgramResourceIndex;
        /*  509 */ PFNGLGETPROGRAMRESOURCENAMEPROC GetProgramResourceName;
        /*  510 */ PFNGLGETPROGRAMRESOURCEIVPROC GetProgramResourceiv;
        /*  511 */ PFNGLGETPROGRAMRESOURCELOCATIONPROC GetProgramResourceLocation;
        /*  512 */ PFNGLGETPROGRAMRESOURCELOCATIONINDEXPROC GetProgramResourceLocationIndex;
        /*  513 */ PFNGLSHADERSTORAGEBLOCKBINDINGPROC ShaderStorageBlockBinding;
        /*  514 */ PFNGLTEXBUFFERRANGEPROC TexBufferRange;
        /*  515 */ PFNGLTEXSTORAGE2DMULTISAMPLEPROC TexStorage2DMultisample;
        /*  516 */ PFNGLTEXSTORAGE3DMULTISAMPLEPROC TexStorage3DMultisample;
        /*  517 */ PFNGLTEXTUREVIEWPROC TextureView;
        /*  518 */ PFNGLBINDVERTEXBUFFERPROC BindVertexBuffer;
        /*  519 */ PFNGLVERTEXATTRIBFORMATPROC VertexAttribFormat;
        /*  520 */ PFNGLVERTEXATTRIBIFORMATPROC VertexAttribIFormat;
        /*  521 */ PFNGLVERTEXATTRIBLFORMATPROC VertexAttribLFormat;
        /*  522 */ PFNGLVERTEXATTRIBBINDINGPROC VertexAttribBinding;
        /*  523 */ PFNGLVERTEXBINDINGDIVISORPROC VertexBindingDivisor;
        /*  524 */ PFNGLDEBUGMESSAGECONTROLPROC DebugMessageControl;
        /*  525 */ PFNGLDEBUGMESSAGEINSERTPROC DebugMessageInsert;
        /*  526 */ PFNGLDEBUGMESSAGECALLBACKPROC DebugMessageCallback;
        /*  527 */ PFNGLGETDEBUGMESSAGELOGPROC GetDebugMessageLog;
        /*  528 */ PFNGLPUSHDEBUGGROUPPROC PushDebugGroup;
        /*  529 */ PFNGLPOPDEBUGGROUPPROC PopDebugGroup;
        /*  530 */ PFNGLOBJECTLABELPROC ObjectLabel;
        /*  531 */ PFNGLGETOBJECTLABELPROC GetObjectLabel;
        /*  532 */ PFNGLOBJECTPTRLABELPROC ObjectPtrLabel;
        /*  533 */ PFNGLGETOBJECTPTRLABELPROC GetObjectPtrLabel;
        /*  534 */ PFNGLBUFFERSTORAGEPROC BufferStorage;
        /*  535 */ PFNGLCLEARTEXIMAGEPROC ClearTexImage;
        /*  536 */ PFNGLCLEARTEXSUBIMAGEPROC ClearTexSubImage;
        /*  537 */ PFNGLBINDBUFFERSBASEPROC BindBuffersBase;
        /*  538 */ PFNGLBINDBUFFERSRANGEPROC BindBuffersRange;
        /*  539 */ PFNGLBINDTEXTURESPROC BindTextures;
        /*  540 */ PFNGLBINDSAMPLERSPROC BindSamplers;
        /*  541 */ PFNGLBINDIMAGETEXTURESPROC BindImageTextures;
        /*  542 */ PFNGLBINDVERTEXBUFFERSPROC BindVertexBuffers;
        /*  543 */ PFNGLCLIPCONTROLPROC ClipControl;
        /*  544 */ PFNGLCREATETRANSFORMFEEDBACKSPROC CreateTransformFeedbacks;
        /*  545 */ PFNGLTRANSFORMFEEDBACKBUFFERBASEPROC TransformFeedbackBufferBase;
        /*  546 */ PFNGLTRANSFORMFEEDBACKBUFFERRANGEPROC TransformFeedbackBufferRange;
        /*  547 */ PFNGLGETTRANSFORMFEEDBACKIVPROC GetTransformFeedbackiv;
        /*  548 */ PFNGLGETTRANSFORMFEEDBACKI_VPROC GetTransformFeedbacki_v;
        /*  549 */ PFNGLGETTRANSFORMFEEDBACKI64_VPROC GetTransformFeedbacki64_v;
        /*  550 */ PFNGLCREATEBUFFERSPROC CreateBuffers;
        /*  551 */ PFNGLNAMEDBUFFERSTORAGEPROC NamedBufferStorage;
        /*  552 */ PFNGLNAMEDBUFFERDATAPROC NamedBufferData;
        /*  553 */ PFNGLNAMEDBUFFERSUBDATAPROC NamedBufferSubData;
        /*  554 */ PFNGLCOPYNAMEDBUFFERSUBDATAPROC CopyNamedBufferSubData;
        /*  555 */ PFNGLCLEARNAMEDBUFFERDATAPROC ClearNamedBufferData;
        /*  556 */ PFNGLCLEARNAMEDBUFFERSUBDATAPROC ClearNamedBufferSubData;
        /*  557 */ PFNGLMAPNAMEDBUFFERPROC MapNamedBuffer;
        /*  558 */ PFNGLMAPNAMEDBUFFERRANGEPROC MapNamedBufferRange;
        /*  559 */ PFNGLUNMAPNAMEDBUFFERPROC UnmapNamedBuffer;
        /*  560 */ PFNGLFLUSHMAPPEDNAMEDBUFFERRANGEPROC FlushMappedNamedBufferRange;
        /*  561 */ PFNGLGETNAMEDBUFFERPARAMETERIVPROC GetNamedBufferParameteriv;
        /*  562 */ PFNGLGETNAMEDBUFFERPARAMETERI64VPROC GetNamedBufferParameteri64v;
        /*  563 */ PFNGLGETNAMEDBUFFERPOINTERVPROC GetNamedBufferPointerv;
        /*  564 */ PFNGLGETNAMEDBUFFERSUBDATAPROC GetNamedBufferSubData;
        /*  565 */ PFNGLCREATEFRAMEBUFFERSPROC CreateFramebuffers;
        /*  566 */ PFNGLNAMEDFRAMEBUFFERRENDERBUFFERPROC NamedFramebufferRenderbuffer;
        /*  567 */ PFNGLNAMEDFRAMEBUFFERPARAMETERIPROC NamedFramebufferParameteri;
        /*  568 */ PFNGLNAMEDFRAMEBUFFERTEXTUREPROC NamedFramebufferTexture;
        /*  569 */ PFNGLNAMEDFRAMEBUFFERTEXTURELAYERPROC NamedFramebufferTextureLayer;
        /*  570 */ PFNGLNAMEDFRAMEBUFFERDRAWBUFFERPROC NamedFramebufferDrawBuffer;
        /*  571 */ PFNGLNAMEDFRAMEBUFFERDRAWBUFFERSPROC NamedFramebufferDrawBuffers;
        /*  572 */ PFNGLNAMEDFRAMEBUFFERREADBUFFERPROC NamedFramebufferReadBuffer;
        /*  573 */ PFNGLINVALIDATENAMEDFRAMEBUFFERDATAPROC InvalidateNamedFramebufferData;
        /*  574 */ PFNGLINVALIDATENAMEDFRAMEBUFFERSUBDATAPROC InvalidateNamedFramebufferSubData;
        /*  575 */ PFNGLCLEARNAMEDFRAMEBUFFERIVPROC ClearNamedFramebufferiv;
        /*  576 */ PFNGLCLEARNAMEDFRAMEBUFFERUIVPROC ClearNamedFramebufferuiv;
        /*  577 */ PFNGLCLEARNAMEDFRAMEBUFFERFVPROC ClearNamedFramebufferfv;
        /*  578 */ PFNGLCLEARNAMEDFRAMEBUFFERFIPROC ClearNamedFramebufferfi;
        /*  579 */ PFNGLBLITNAMEDFRAMEBUFFERPROC BlitNamedFramebuffer;
        /*  580 */ PFNGLCHECKNAMEDFRAMEBUFFERSTATUSPROC CheckNamedFramebufferStatus;
        /*  581 */ PFNGLGETNAMEDFRAMEBUFFERPARAMETERIVPROC GetNamedFramebufferParameteriv;
        /*  582 */ PFNGLGETNAMEDFRAMEBUFFERATTACHMENTPARAMETERIVPROC GetNamedFramebufferAttachmentParameteriv;
        /*  583 */ PFNGLCREATERENDERBUFFERSPROC CreateRenderbuffers;
        /*  584 */ PFNGLNAMEDRENDERBUFFERSTORAGEPROC NamedRenderbufferStorage;
        /*  585 */ PFNGLNAMEDRENDERBUFFERSTORAGEMULTISAMPLEPROC NamedRenderbufferStorageMultisample;
        /*  586 */ PFNGLGETNAMEDRENDERBUFFERPARAMETERIVPROC GetNamedRenderbufferParameteriv;
        /*  587 */ PFNGLCREATETEXTURESPROC CreateTextures;
        /*  588 */ PFNGLTEXTUREBUFFERPROC TextureBuffer;
        /*  589 */ PFNGLTEXTUREBUFFERRANGEPROC TextureBufferRange;
        /*  590 */ PFNGLTEXTURESTORAGE1DPROC TextureStorage1D;
        /*  591 */ PFNGLTEXTURESTORAGE2DPROC TextureStorage2D;
        /*  592 */ PFNGLTEXTURESTORAGE3DPROC TextureStorage3D;
        /*  593 */ PFNGLTEXTURESTORAGE2DMULTISAMPLEPROC TextureStorage2DMultisample;
        /*  594 */ PFNGLTEXTURESTORAGE3DMULTISAMPLEPROC TextureStorage3DMultisample;
        /*  595 */ PFNGLTEXTURESUBIMAGE1DPROC TextureSubImage1D;
        /*  596 */ PFNGLTEXTURESUBIMAGE2DPROC TextureSubImage2D;
        /*  597 */ PFNGLTEXTURESUBIMAGE3DPROC TextureSubImage3D;
        /*  598 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE1DPROC CompressedTextureSubImage1D;
        /*  599 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE2DPROC CompressedTextureSubImage2D;
        /*  600 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE3DPROC CompressedTextureSubImage3D;
        /*  601 */ PFNGLCOPYTEXTURESUBIMAGE1DPROC CopyTextureSubImage1D;
        /*  602 */ PFNGLCOPYTEXTURESUBIMAGE2DPROC CopyTextureSubImage2D;
        /*  603 */ PFNGLCOPYTEXTURESUBIMAGE3DPROC CopyTextureSubImage3D;
        /*  604 */ PFNGLTEXTUREPARAMETERFPROC TextureParameterf;
        /*  605 */ PFNGLTEXTUREPARAMETERFVPROC TextureParameterfv;
        /*  606 */ PFNGLTEXTUREPARAMETERIPROC TextureParameteri;
        /*  607 */ PFNGLTEXTUREPARAMETERIIVPROC TextureParameterIiv;
        /*  608 */ PFNGLTEXTUREPARAMETERIUIVPROC TextureParameterIuiv;
        /*  609 */ PFNGLTEXTUREPARAMETERIVPROC TextureParameteriv;
        /*  610 */ PFNGLGENERATETEXTUREMIPMAPPROC GenerateTextureMipmap;
        /*  611 */ PFNGLBINDTEXTUREUNITPROC BindTextureUnit;
        /*  612 */ PFNGLGETTEXTUREIMAGEPROC GetTextureImage;
        /*  613 */ PFNGLGETCOMPRESSEDTEXTUREIMAGEPROC GetCompressedTextureImage;
        /*  614 */ PFNGLGETTEXTURELEVELPARAMETERFVPROC GetTextureLevelParameterfv;
        /*  615 */ PFNGLGETTEXTURELEVELPARAMETERIVPROC GetTextureLevelParameteriv;
        /*  616 */ PFNGLGETTEXTUREPARAMETERFVPROC GetTextureParameterfv;
        /*  617 */ PFNGLGETTEXTUREPARAMETERIIVPROC GetTextureParameterIiv;
        /*  618 */ PFNGLGETTEXTUREPARAMETERIUIVPROC GetTextureParameterIuiv;
        /*  619 */ PFNGLGETTEXTUREPARAMETERIVPROC GetTextureParameteriv;
        /*  620 */ PFNGLCREATEVERTEXARRAYSPROC CreateVertexArrays;
        /*  621 */ PFNGLDISABLEVERTEXARRAYATTRIBPROC DisableVertexArrayAttrib;
        /*  622 */ PFNGLENABLEVERTEXARRAYATTRIBPROC EnableVertexArrayAttrib;
        /*  623 */ PFNGLVERTEXARRAYELEMENTBUFFERPROC VertexArrayElementBuffer;
        /*  624 */ PFNGLVERTEXARRAYVERTEXBUFFERPROC VertexArrayVertexBuffer;
        /*  625 */ PFNGLVERTEXARRAYVERTEXBUFFERSPROC VertexArrayVertexBuffers;
        /*  626 */ PFNGLVERTEXARRAYATTRIBBINDINGPROC VertexArrayAttribBinding;
        /*  627 */ PFNGLVERTEXARRAYATTRIBFORMATPROC VertexArrayAttribFormat;
        /*  628 */ PFNGLVERTEXARRAYATTRIBIFORMATPROC VertexArrayAttribIFormat;
        /*  629 */ PFNGLVERTEXARRAYATTRIBLFORMATPROC VertexArrayAttribLFormat;
        /*  630 */ PFNGLVERTEXARRAYBINDINGDIVISORPROC VertexArrayBindingDivisor;
        /*  631 */ PFNGLGETVERTEXARRAYIVPROC GetVertexArrayiv;
        /*  632 */ PFNGLGETVERTEXARRAYINDEXEDIVPROC GetVertexArrayIndexediv;
        /*  633 */ PFNGLGETVERTEXARRAYINDEXED64IVPROC GetVertexArrayIndexed64iv;
        /*  634 */ PFNGLCREATESAMPLERSPROC CreateSamplers;
        /*  635 */ PFNGLCREATEPROGRAMPIPELINESPROC CreateProgramPipelines;
        /*  636 */ PFNGLCREATEQUERIESPROC CreateQueries;
        /*  637 */ PFNGLGETQUERYBUFFEROBJECTI64VPROC GetQueryBufferObjecti64v;
        /*  638 */ PFNGLGETQUERYBUFFEROBJECTIVPROC GetQueryBufferObjectiv;
        /*  639 */ PFNGLGETQUERYBUFFEROBJECTUI64VPROC GetQueryBufferObjectui64v;
        /*  640 */ PFNGLGETQUERYBUFFEROBJECTUIVPROC GetQueryBufferObjectuiv;
        /*  641 */ PFNGLMEMORYBARRIERBYREGIONPROC MemoryBarrierByRegion;
        /*  642 */ PFNGLGETTEXTURESUBIMAGEPROC GetTextureSubImage;
        /*  643 */ PFNGLGETCOMPRESSEDTEXTURESUBIMAGEPROC GetCompressedTextureSubImage;
        /*  644 */ PFNGLGETGRAPHICSRESETSTATUSPROC GetGraphicsResetStatus;
        /*  645 */ PFNGLGETNCOMPRESSEDTEXIMAGEPROC GetnCompressedTexImage;
        /*  646 */ PFNGLGETNTEXIMAGEPROC GetnTexImage;
        /*  647 */ PFNGLGETNUNIFORMDVPROC GetnUniformdv;
        /*  648 */ PFNGLGETNUNIFORMFVPROC GetnUniformfv;
        /*  649 */ PFNGLGETNUNIFORMIVPROC GetnUniformiv;
        /*  650 */ PFNGLGETNUNIFORMUIVPROC GetnUniformuiv;
        /*  651 */ PFNGLREADNPIXELSPROC ReadnPixels;
        /*  652 */ PFNGLTEXTUREBARRIERPROC TextureBarrier;
        /*  653 */ PFNGLSPECIALIZESHADERPROC SpecializeShader;
        /*  654 */ PFNGLMULTIDRAWARRAYSINDIRECTCOUNTPROC MultiDrawArraysIndirectCount;
        /*  655 */ PFNGLMULTIDRAWELEMENTSINDIRECTCOUNTPROC MultiDrawElementsIndirectCount;
        /*  656 */ PFNGLPOLYGONOFFSETCLAMPPROC PolygonOffsetClamp;
        /*  657 */ PFNGLTBUFFERMASK3DFXPROC TbufferMask3DFX;
        /*  658 */ PFNGLDEBUGMESSAGEENABLEAMDPROC DebugMessageEnableAMD;
        /*  659 */ PFNGLDEBUGMESSAGEINSERTAMDPROC DebugMessageInsertAMD;
        /*  660 */ PFNGLDEBUGMESSAGECALLBACKAMDPROC DebugMessageCallbackAMD;
        /*  661 */ PFNGLGETDEBUGMESSAGELOGAMDPROC GetDebugMessageLogAMD;
        /*  662 */ PFNGLBLENDFUNCINDEXEDAMDPROC BlendFuncIndexedAMD;
        /*  663 */ PFNGLBLENDFUNCSEPARATEINDEXEDAMDPROC BlendFuncSeparateIndexedAMD;
        /*  664 */ PFNGLBLENDEQUATIONINDEXEDAMDPROC BlendEquationIndexedAMD;
        /*  665 */ PFNGLBLENDEQUATIONSEPARATEINDEXEDAMDPROC BlendEquationSeparateIndexedAMD;
        /*  666 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEADVANCEDAMDPROC RenderbufferStorageMultisampleAdvancedAMD;
        /*  667 */ PFNGLNAMEDRENDERBUFFERSTORAGEMULTISAMPLEADVANCEDAMDPROC NamedRenderbufferStorageMultisampleAdvancedAMD;
        /*  668 */ PFNGLFRAMEBUFFERSAMPLEPOSITIONSFVAMDPROC FramebufferSamplePositionsfvAMD;
        /*  669 */ PFNGLNAMEDFRAMEBUFFERSAMPLEPOSITIONSFVAMDPROC NamedFramebufferSamplePositionsfvAMD;
        /*  670 */ PFNGLGETFRAMEBUFFERPARAMETERFVAMDPROC GetFramebufferParameterfvAMD;
        /*  671 */ PFNGLGETNAMEDFRAMEBUFFERPARAMETERFVAMDPROC GetNamedFramebufferParameterfvAMD;
        /*  672 */ PFNGLUNIFORM1I64NVPROC Uniform1i64NV;
        /*  673 */ PFNGLUNIFORM2I64NVPROC Uniform2i64NV;
        /*  674 */ PFNGLUNIFORM3I64NVPROC Uniform3i64NV;
        /*  675 */ PFNGLUNIFORM4I64NVPROC Uniform4i64NV;
        /*  676 */ PFNGLUNIFORM1I64VNVPROC Uniform1i64vNV;
        /*  677 */ PFNGLUNIFORM2I64VNVPROC Uniform2i64vNV;
        /*  678 */ PFNGLUNIFORM3I64VNVPROC Uniform3i64vNV;
        /*  679 */ PFNGLUNIFORM4I64VNVPROC Uniform4i64vNV;
        /*  680 */ PFNGLUNIFORM1UI64NVPROC Uniform1ui64NV;
        /*  681 */ PFNGLUNIFORM2UI64NVPROC Uniform2ui64NV;
        /*  682 */ PFNGLUNIFORM3UI64NVPROC Uniform3ui64NV;
        /*  683 */ PFNGLUNIFORM4UI64NVPROC Uniform4ui64NV;
        /*  684 */ PFNGLUNIFORM1UI64VNVPROC Uniform1ui64vNV;
        /*  685 */ PFNGLUNIFORM2UI64VNVPROC Uniform2ui64vNV;
        /*  686 */ PFNGLUNIFORM3UI64VNVPROC Uniform3ui64vNV;
        /*  687 */ PFNGLUNIFORM4UI64VNVPROC Uniform4ui64vNV;
        /*  688 */ PFNGLGETUNIFORMI64VNVPROC GetUniformi64vNV;
        /*  689 */ PFNGLGETUNIFORMUI64VNVPROC GetUniformui64vNV;
        /*  690 */ PFNGLPROGRAMUNIFORM1I64NVPROC ProgramUniform1i64NV;
        /*  691 */ PFNGLPROGRAMUNIFORM2I64NVPROC ProgramUniform2i64NV;
        /*  692 */ PFNGLPROGRAMUNIFORM3I64NVPROC ProgramUniform3i64NV;
        /*  693 */ PFNGLPROGRAMUNIFORM4I64NVPROC ProgramUniform4i64NV;
        /*  694 */ PFNGLPROGRAMUNIFORM1I64VNVPROC ProgramUniform1i64vNV;
        /*  695 */ PFNGLPROGRAMUNIFORM2I64VNVPROC ProgramUniform2i64vNV;
        /*  696 */ PFNGLPROGRAMUNIFORM3I64VNVPROC ProgramUniform3i64vNV;
        /*  697 */ PFNGLPROGRAMUNIFORM4I64VNVPROC ProgramUniform4i64vNV;
        /*  698 */ PFNGLPROGRAMUNIFORM1UI64NVPROC ProgramUniform1ui64NV;
        /*  699 */ PFNGLPROGRAMUNIFORM2UI64NVPROC ProgramUniform2ui64NV;
        /*  700 */ PFNGLPROGRAMUNIFORM3UI64NVPROC ProgramUniform3ui64NV;
        /*  701 */ PFNGLPROGRAMUNIFORM4UI64NVPROC ProgramUniform4ui64NV;
        /*  702 */ PFNGLPROGRAMUNIFORM1UI64VNVPROC ProgramUniform1ui64vNV;
        /*  703 */ PFNGLPROGRAMUNIFORM2UI64VNVPROC ProgramUniform2ui64vNV;
        /*  704 */ PFNGLPROGRAMUNIFORM3UI64VNVPROC ProgramUniform3ui64vNV;
        /*  705 */ PFNGLPROGRAMUNIFORM4UI64VNVPROC ProgramUniform4ui64vNV;
        /*  706 */ PFNGLVERTEXATTRIBPARAMETERIAMDPROC VertexAttribParameteriAMD;
        /*  707 */ PFNGLMULTIDRAWARRAYSINDIRECTAMDPROC MultiDrawArraysIndirectAMD;
        /*  708 */ PFNGLMULTIDRAWELEMENTSINDIRECTAMDPROC MultiDrawElementsIndirectAMD;
        /*  709 */ PFNGLGENNAMESAMDPROC GenNamesAMD;
        /*  710 */ PFNGLDELETENAMESAMDPROC DeleteNamesAMD;
        /*  711 */ PFNGLISNAMEAMDPROC IsNameAMD;
        /*  712 */ PFNGLQUERYOBJECTPARAMETERUIAMDPROC QueryObjectParameteruiAMD;
        /*  713 */ PFNGLGETPERFMONITORGROUPSAMDPROC GetPerfMonitorGroupsAMD;
        /*  714 */ PFNGLGETPERFMONITORCOUNTERSAMDPROC GetPerfMonitorCountersAMD;
        /*  715 */ PFNGLGETPERFMONITORGROUPSTRINGAMDPROC GetPerfMonitorGroupStringAMD;
        /*  716 */ PFNGLGETPERFMONITORCOUNTERSTRINGAMDPROC GetPerfMonitorCounterStringAMD;
        /*  717 */ PFNGLGETPERFMONITORCOUNTERINFOAMDPROC GetPerfMonitorCounterInfoAMD;
        /*  718 */ PFNGLGENPERFMONITORSAMDPROC GenPerfMonitorsAMD;
        /*  719 */ PFNGLDELETEPERFMONITORSAMDPROC DeletePerfMonitorsAMD;
        /*  720 */ PFNGLSELECTPERFMONITORCOUNTERSAMDPROC SelectPerfMonitorCountersAMD;
        /*  721 */ PFNGLBEGINPERFMONITORAMDPROC BeginPerfMonitorAMD;
        /*  722 */ PFNGLENDPERFMONITORAMDPROC EndPerfMonitorAMD;
        /*  723 */ PFNGLGETPERFMONITORCOUNTERDATAAMDPROC GetPerfMonitorCounterDataAMD;
        /*  724 */ PFNGLSETMULTISAMPLEFVAMDPROC SetMultisamplefvAMD;
        /*  725 */ PFNGLTEXSTORAGESPARSEAMDPROC TexStorageSparseAMD;
        /*  726 */ PFNGLTEXTURESTORAGESPARSEAMDPROC TextureStorageSparseAMD;
        /*  727 */ PFNGLSTENCILOPVALUEAMDPROC StencilOpValueAMD;
        /*  728 */ PFNGLTESSELLATIONFACTORAMDPROC TessellationFactorAMD;
        /*  729 */ PFNGLTESSELLATIONMODEAMDPROC TessellationModeAMD;
        /*  730 */ PFNGLELEMENTPOINTERAPPLEPROC ElementPointerAPPLE;
        /*  731 */ PFNGLDRAWELEMENTARRAYAPPLEPROC DrawElementArrayAPPLE;
        /*  732 */ PFNGLDRAWRANGEELEMENTARRAYAPPLEPROC DrawRangeElementArrayAPPLE;
        /*  733 */ PFNGLMULTIDRAWELEMENTARRAYAPPLEPROC MultiDrawElementArrayAPPLE;
        /*  734 */ PFNGLMULTIDRAWRANGEELEMENTARRAYAPPLEPROC MultiDrawRangeElementArrayAPPLE;
        /*  735 */ PFNGLGENFENCESAPPLEPROC GenFencesAPPLE;
        /*  736 */ PFNGLDELETEFENCESAPPLEPROC DeleteFencesAPPLE;
        /*  737 */ PFNGLSETFENCEAPPLEPROC SetFenceAPPLE;
        /*  738 */ PFNGLISFENCEAPPLEPROC IsFenceAPPLE;
        /*  739 */ PFNGLTESTFENCEAPPLEPROC TestFenceAPPLE;
        /*  740 */ PFNGLFINISHFENCEAPPLEPROC FinishFenceAPPLE;
        /*  741 */ PFNGLTESTOBJECTAPPLEPROC TestObjectAPPLE;
        /*  742 */ PFNGLFINISHOBJECTAPPLEPROC FinishObjectAPPLE;
        /*  743 */ PFNGLBUFFERPARAMETERIAPPLEPROC BufferParameteriAPPLE;
        /*  744 */ PFNGLFLUSHMAPPEDBUFFERRANGEAPPLEPROC FlushMappedBufferRangeAPPLE;
        /*  745 */ PFNGLOBJECTPURGEABLEAPPLEPROC ObjectPurgeableAPPLE;
        /*  746 */ PFNGLOBJECTUNPURGEABLEAPPLEPROC ObjectUnpurgeableAPPLE;
        /*  747 */ PFNGLGETOBJECTPARAMETERIVAPPLEPROC GetObjectParameterivAPPLE;
        /*  748 */ PFNGLTEXTURERANGEAPPLEPROC TextureRangeAPPLE;
        /*  749 */ PFNGLGETTEXPARAMETERPOINTERVAPPLEPROC GetTexParameterPointervAPPLE;
        /*  750 */ PFNGLBINDVERTEXARRAYAPPLEPROC BindVertexArrayAPPLE;
        /*  751 */ PFNGLDELETEVERTEXARRAYSAPPLEPROC DeleteVertexArraysAPPLE;
        /*  752 */ PFNGLGENVERTEXARRAYSAPPLEPROC GenVertexArraysAPPLE;
        /*  753 */ PFNGLISVERTEXARRAYAPPLEPROC IsVertexArrayAPPLE;
        /*  754 */ PFNGLVERTEXARRAYRANGEAPPLEPROC VertexArrayRangeAPPLE;
        /*  755 */ PFNGLFLUSHVERTEXARRAYRANGEAPPLEPROC FlushVertexArrayRangeAPPLE;
        /*  756 */ PFNGLVERTEXARRAYPARAMETERIAPPLEPROC VertexArrayParameteriAPPLE;
        /*  757 */ PFNGLENABLEVERTEXATTRIBAPPLEPROC EnableVertexAttribAPPLE;
        /*  758 */ PFNGLDISABLEVERTEXATTRIBAPPLEPROC DisableVertexAttribAPPLE;
        /*  759 */ PFNGLISVERTEXATTRIBENABLEDAPPLEPROC IsVertexAttribEnabledAPPLE;
        /*  760 */ PFNGLMAPVERTEXATTRIB1DAPPLEPROC MapVertexAttrib1dAPPLE;
        /*  761 */ PFNGLMAPVERTEXATTRIB1FAPPLEPROC MapVertexAttrib1fAPPLE;
        /*  762 */ PFNGLMAPVERTEXATTRIB2DAPPLEPROC MapVertexAttrib2dAPPLE;
        /*  763 */ PFNGLMAPVERTEXATTRIB2FAPPLEPROC MapVertexAttrib2fAPPLE;
        /*  764 */ PFNGLPRIMITIVEBOUNDINGBOXARBPROC PrimitiveBoundingBoxARB;
        /*  765 */ PFNGLGETTEXTUREHANDLEARBPROC GetTextureHandleARB;
        /*  766 */ PFNGLGETTEXTURESAMPLERHANDLEARBPROC GetTextureSamplerHandleARB;
        /*  767 */ PFNGLMAKETEXTUREHANDLERESIDENTARBPROC MakeTextureHandleResidentARB;
        /*  768 */ PFNGLMAKETEXTUREHANDLENONRESIDENTARBPROC MakeTextureHandleNonResidentARB;
        /*  769 */ PFNGLGETIMAGEHANDLEARBPROC GetImageHandleARB;
        /*  770 */ PFNGLMAKEIMAGEHANDLERESIDENTARBPROC MakeImageHandleResidentARB;
        /*  771 */ PFNGLMAKEIMAGEHANDLENONRESIDENTARBPROC MakeImageHandleNonResidentARB;
        /*  772 */ PFNGLUNIFORMHANDLEUI64ARBPROC UniformHandleui64ARB;
        /*  773 */ PFNGLUNIFORMHANDLEUI64VARBPROC UniformHandleui64vARB;
        /*  774 */ PFNGLPROGRAMUNIFORMHANDLEUI64ARBPROC ProgramUniformHandleui64ARB;
        /*  775 */ PFNGLPROGRAMUNIFORMHANDLEUI64VARBPROC ProgramUniformHandleui64vARB;
        /*  776 */ PFNGLISTEXTUREHANDLERESIDENTARBPROC IsTextureHandleResidentARB;
        /*  777 */ PFNGLISIMAGEHANDLERESIDENTARBPROC IsImageHandleResidentARB;
        /*  778 */ PFNGLVERTEXATTRIBL1UI64ARBPROC VertexAttribL1ui64ARB;
        /*  779 */ PFNGLVERTEXATTRIBL1UI64VARBPROC VertexAttribL1ui64vARB;
        /*  780 */ PFNGLGETVERTEXATTRIBLUI64VARBPROC GetVertexAttribLui64vARB;
        /*  781 */ PFNGLCREATESYNCFROMCLEVENTARBPROC CreateSyncFromCLeventARB;
        /*  782 */ PFNGLCLAMPCOLORARBPROC ClampColorARB;
        /*  783 */ PFNGLDISPATCHCOMPUTEGROUPSIZEARBPROC DispatchComputeGroupSizeARB;
        /*  784 */ PFNGLDEBUGMESSAGECONTROLARBPROC DebugMessageControlARB;
        /*  785 */ PFNGLDEBUGMESSAGEINSERTARBPROC DebugMessageInsertARB;
        /*  786 */ PFNGLDEBUGMESSAGECALLBACKARBPROC DebugMessageCallbackARB;
        /*  787 */ PFNGLGETDEBUGMESSAGELOGARBPROC GetDebugMessageLogARB;
        /*  788 */ PFNGLDRAWBUFFERSARBPROC DrawBuffersARB;
        /*  789 */ PFNGLBLENDEQUATIONIARBPROC BlendEquationiARB;
        /*  790 */ PFNGLBLENDEQUATIONSEPARATEIARBPROC BlendEquationSeparateiARB;
        /*  791 */ PFNGLBLENDFUNCIARBPROC BlendFunciARB;
        /*  792 */ PFNGLBLENDFUNCSEPARATEIARBPROC BlendFuncSeparateiARB;
        /*  793 */ PFNGLDRAWARRAYSINSTANCEDARBPROC DrawArraysInstancedARB;
        /*  794 */ PFNGLDRAWELEMENTSINSTANCEDARBPROC DrawElementsInstancedARB;
        /*  795 */ PFNGLPROGRAMSTRINGARBPROC ProgramStringARB;
        /*  796 */ PFNGLBINDPROGRAMARBPROC BindProgramARB;
        /*  797 */ PFNGLDELETEPROGRAMSARBPROC DeleteProgramsARB;
        /*  798 */ PFNGLGENPROGRAMSARBPROC GenProgramsARB;
        /*  799 */ PFNGLPROGRAMENVPARAMETER4DARBPROC ProgramEnvParameter4dARB;
        /*  800 */ PFNGLPROGRAMENVPARAMETER4DVARBPROC ProgramEnvParameter4dvARB;
        /*  801 */ PFNGLPROGRAMENVPARAMETER4FARBPROC ProgramEnvParameter4fARB;
        /*  802 */ PFNGLPROGRAMENVPARAMETER4FVARBPROC ProgramEnvParameter4fvARB;
        /*  803 */ PFNGLPROGRAMLOCALPARAMETER4DARBPROC ProgramLocalParameter4dARB;
        /*  804 */ PFNGLPROGRAMLOCALPARAMETER4DVARBPROC ProgramLocalParameter4dvARB;
        /*  805 */ PFNGLPROGRAMLOCALPARAMETER4FARBPROC ProgramLocalParameter4fARB;
        /*  806 */ PFNGLPROGRAMLOCALPARAMETER4FVARBPROC ProgramLocalParameter4fvARB;
        /*  807 */ PFNGLGETPROGRAMENVPARAMETERDVARBPROC GetProgramEnvParameterdvARB;
        /*  808 */ PFNGLGETPROGRAMENVPARAMETERFVARBPROC GetProgramEnvParameterfvARB;
        /*  809 */ PFNGLGETPROGRAMLOCALPARAMETERDVARBPROC GetProgramLocalParameterdvARB;
        /*  810 */ PFNGLGETPROGRAMLOCALPARAMETERFVARBPROC GetProgramLocalParameterfvARB;
        /*  811 */ PFNGLGETPROGRAMIVARBPROC GetProgramivARB;
        /*  812 */ PFNGLGETPROGRAMSTRINGARBPROC GetProgramStringARB;
        /*  813 */ PFNGLISPROGRAMARBPROC IsProgramARB;
        /*  814 */ PFNGLPROGRAMPARAMETERIARBPROC ProgramParameteriARB;
        /*  815 */ PFNGLFRAMEBUFFERTEXTUREARBPROC FramebufferTextureARB;
        /*  816 */ PFNGLFRAMEBUFFERTEXTURELAYERARBPROC FramebufferTextureLayerARB;
        /*  817 */ PFNGLFRAMEBUFFERTEXTUREFACEARBPROC FramebufferTextureFaceARB;
        /*  818 */ PFNGLSPECIALIZESHADERARBPROC SpecializeShaderARB;
        /*  819 */ PFNGLUNIFORM1I64ARBPROC Uniform1i64ARB;
        /*  820 */ PFNGLUNIFORM2I64ARBPROC Uniform2i64ARB;
        /*  821 */ PFNGLUNIFORM3I64ARBPROC Uniform3i64ARB;
        /*  822 */ PFNGLUNIFORM4I64ARBPROC Uniform4i64ARB;
        /*  823 */ PFNGLUNIFORM1I64VARBPROC Uniform1i64vARB;
        /*  824 */ PFNGLUNIFORM2I64VARBPROC Uniform2i64vARB;
        /*  825 */ PFNGLUNIFORM3I64VARBPROC Uniform3i64vARB;
        /*  826 */ PFNGLUNIFORM4I64VARBPROC Uniform4i64vARB;
        /*  827 */ PFNGLUNIFORM1UI64ARBPROC Uniform1ui64ARB;
        /*  828 */ PFNGLUNIFORM2UI64ARBPROC Uniform2ui64ARB;
        /*  829 */ PFNGLUNIFORM3UI64ARBPROC Uniform3ui64ARB;
        /*  830 */ PFNGLUNIFORM4UI64ARBPROC Uniform4ui64ARB;
        /*  831 */ PFNGLUNIFORM1UI64VARBPROC Uniform1ui64vARB;
        /*  832 */ PFNGLUNIFORM2UI64VARBPROC Uniform2ui64vARB;
        /*  833 */ PFNGLUNIFORM3UI64VARBPROC Uniform3ui64vARB;
        /*  834 */ PFNGLUNIFORM4UI64VARBPROC Uniform4ui64vARB;
        /*  835 */ PFNGLGETUNIFORMI64VARBPROC GetUniformi64vARB;
        /*  836 */ PFNGLGETUNIFORMUI64VARBPROC GetUniformui64vARB;
        /*  837 */ PFNGLGETNUNIFORMI64VARBPROC GetnUniformi64vARB;
        /*  838 */ PFNGLGETNUNIFORMUI64VARBPROC GetnUniformui64vARB;
        /*  839 */ PFNGLPROGRAMUNIFORM1I64ARBPROC ProgramUniform1i64ARB;
        /*  840 */ PFNGLPROGRAMUNIFORM2I64ARBPROC ProgramUniform2i64ARB;
        /*  841 */ PFNGLPROGRAMUNIFORM3I64ARBPROC ProgramUniform3i64ARB;
        /*  842 */ PFNGLPROGRAMUNIFORM4I64ARBPROC ProgramUniform4i64ARB;
        /*  843 */ PFNGLPROGRAMUNIFORM1I64VARBPROC ProgramUniform1i64vARB;
        /*  844 */ PFNGLPROGRAMUNIFORM2I64VARBPROC ProgramUniform2i64vARB;
        /*  845 */ PFNGLPROGRAMUNIFORM3I64VARBPROC ProgramUniform3i64vARB;
        /*  846 */ PFNGLPROGRAMUNIFORM4I64VARBPROC ProgramUniform4i64vARB;
        /*  847 */ PFNGLPROGRAMUNIFORM1UI64ARBPROC ProgramUniform1ui64ARB;
        /*  848 */ PFNGLPROGRAMUNIFORM2UI64ARBPROC ProgramUniform2ui64ARB;
        /*  849 */ PFNGLPROGRAMUNIFORM3UI64ARBPROC ProgramUniform3ui64ARB;
        /*  850 */ PFNGLPROGRAMUNIFORM4UI64ARBPROC ProgramUniform4ui64ARB;
        /*  851 */ PFNGLPROGRAMUNIFORM1UI64VARBPROC ProgramUniform1ui64vARB;
        /*  852 */ PFNGLPROGRAMUNIFORM2UI64VARBPROC ProgramUniform2ui64vARB;
        /*  853 */ PFNGLPROGRAMUNIFORM3UI64VARBPROC ProgramUniform3ui64vARB;
        /*  854 */ PFNGLPROGRAMUNIFORM4UI64VARBPROC ProgramUniform4ui64vARB;
        /*  855 */ PFNGLMULTIDRAWARRAYSINDIRECTCOUNTARBPROC MultiDrawArraysIndirectCountARB;
        /*  856 */ PFNGLMULTIDRAWELEMENTSINDIRECTCOUNTARBPROC MultiDrawElementsIndirectCountARB;
        /*  857 */ PFNGLVERTEXATTRIBDIVISORARBPROC VertexAttribDivisorARB;
        /*  858 */ PFNGLCURRENTPALETTEMATRIXARBPROC CurrentPaletteMatrixARB;
        /*  859 */ PFNGLMATRIXINDEXUBVARBPROC MatrixIndexubvARB;
        /*  860 */ PFNGLMATRIXINDEXUSVARBPROC MatrixIndexusvARB;
        /*  861 */ PFNGLMATRIXINDEXUIVARBPROC MatrixIndexuivARB;
        /*  862 */ PFNGLMATRIXINDEXPOINTERARBPROC MatrixIndexPointerARB;
        /*  863 */ PFNGLSAMPLECOVERAGEARBPROC SampleCoverageARB;
        /*  864 */ PFNGLACTIVETEXTUREARBPROC ActiveTextureARB;
        /*  865 */ PFNGLCLIENTACTIVETEXTUREARBPROC ClientActiveTextureARB;
        /*  866 */ PFNGLMULTITEXCOORD1DARBPROC MultiTexCoord1dARB;
        /*  867 */ PFNGLMULTITEXCOORD1DVARBPROC MultiTexCoord1dvARB;
        /*  868 */ PFNGLMULTITEXCOORD1FARBPROC MultiTexCoord1fARB;
        /*  869 */ PFNGLMULTITEXCOORD1FVARBPROC MultiTexCoord1fvARB;
        /*  870 */ PFNGLMULTITEXCOORD1IARBPROC MultiTexCoord1iARB;
        /*  871 */ PFNGLMULTITEXCOORD1IVARBPROC MultiTexCoord1ivARB;
        /*  872 */ PFNGLMULTITEXCOORD1SARBPROC MultiTexCoord1sARB;
        /*  873 */ PFNGLMULTITEXCOORD1SVARBPROC MultiTexCoord1svARB;
        /*  874 */ PFNGLMULTITEXCOORD2DARBPROC MultiTexCoord2dARB;
        /*  875 */ PFNGLMULTITEXCOORD2DVARBPROC MultiTexCoord2dvARB;
        /*  876 */ PFNGLMULTITEXCOORD2FARBPROC MultiTexCoord2fARB;
        /*  877 */ PFNGLMULTITEXCOORD2FVARBPROC MultiTexCoord2fvARB;
        /*  878 */ PFNGLMULTITEXCOORD2IARBPROC MultiTexCoord2iARB;
        /*  879 */ PFNGLMULTITEXCOORD2IVARBPROC MultiTexCoord2ivARB;
        /*  880 */ PFNGLMULTITEXCOORD2SARBPROC MultiTexCoord2sARB;
        /*  881 */ PFNGLMULTITEXCOORD2SVARBPROC MultiTexCoord2svARB;
        /*  882 */ PFNGLMULTITEXCOORD3DARBPROC MultiTexCoord3dARB;
        /*  883 */ PFNGLMULTITEXCOORD3DVARBPROC MultiTexCoord3dvARB;
        /*  884 */ PFNGLMULTITEXCOORD3FARBPROC MultiTexCoord3fARB;
        /*  885 */ PFNGLMULTITEXCOORD3FVARBPROC MultiTexCoord3fvARB;
        /*  886 */ PFNGLMULTITEXCOORD3IARBPROC MultiTexCoord3iARB;
        /*  887 */ PFNGLMULTITEXCOORD3IVARBPROC MultiTexCoord3ivARB;
        /*  888 */ PFNGLMULTITEXCOORD3SARBPROC MultiTexCoord3sARB;
        /*  889 */ PFNGLMULTITEXCOORD3SVARBPROC MultiTexCoord3svARB;
        /*  890 */ PFNGLMULTITEXCOORD4DARBPROC MultiTexCoord4dARB;
        /*  891 */ PFNGLMULTITEXCOORD4DVARBPROC MultiTexCoord4dvARB;
        /*  892 */ PFNGLMULTITEXCOORD4FARBPROC MultiTexCoord4fARB;
        /*  893 */ PFNGLMULTITEXCOORD4FVARBPROC MultiTexCoord4fvARB;
        /*  894 */ PFNGLMULTITEXCOORD4IARBPROC MultiTexCoord4iARB;
        /*  895 */ PFNGLMULTITEXCOORD4IVARBPROC MultiTexCoord4ivARB;
        /*  896 */ PFNGLMULTITEXCOORD4SARBPROC MultiTexCoord4sARB;
        /*  897 */ PFNGLMULTITEXCOORD4SVARBPROC MultiTexCoord4svARB;
        /*  898 */ PFNGLGENQUERIESARBPROC GenQueriesARB;
        /*  899 */ PFNGLDELETEQUERIESARBPROC DeleteQueriesARB;
        /*  900 */ PFNGLISQUERYARBPROC IsQueryARB;
        /*  901 */ PFNGLBEGINQUERYARBPROC BeginQueryARB;
        /*  902 */ PFNGLENDQUERYARBPROC EndQueryARB;
        /*  903 */ PFNGLGETQUERYIVARBPROC GetQueryivARB;
        /*  904 */ PFNGLGETQUERYOBJECTIVARBPROC GetQueryObjectivARB;
        /*  905 */ PFNGLGETQUERYOBJECTUIVARBPROC GetQueryObjectuivARB;
        /*  906 */ PFNGLMAXSHADERCOMPILERTHREADSARBPROC MaxShaderCompilerThreadsARB;
        /*  907 */ PFNGLPOINTPARAMETERFARBPROC PointParameterfARB;
        /*  908 */ PFNGLPOINTPARAMETERFVARBPROC PointParameterfvARB;
        /*  909 */ PFNGLGETGRAPHICSRESETSTATUSARBPROC GetGraphicsResetStatusARB;
        /*  910 */ PFNGLGETNTEXIMAGEARBPROC GetnTexImageARB;
        /*  911 */ PFNGLREADNPIXELSARBPROC ReadnPixelsARB;
        /*  912 */ PFNGLGETNCOMPRESSEDTEXIMAGEARBPROC GetnCompressedTexImageARB;
        /*  913 */ PFNGLGETNUNIFORMFVARBPROC GetnUniformfvARB;
        /*  914 */ PFNGLGETNUNIFORMIVARBPROC GetnUniformivARB;
        /*  915 */ PFNGLGETNUNIFORMUIVARBPROC GetnUniformuivARB;
        /*  916 */ PFNGLGETNUNIFORMDVARBPROC GetnUniformdvARB;
        /*  917 */ PFNGLFRAMEBUFFERSAMPLELOCATIONSFVARBPROC FramebufferSampleLocationsfvARB;
        /*  918 */ PFNGLNAMEDFRAMEBUFFERSAMPLELOCATIONSFVARBPROC NamedFramebufferSampleLocationsfvARB;
        /*  919 */ PFNGLEVALUATEDEPTHVALUESARBPROC EvaluateDepthValuesARB;
        /*  920 */ PFNGLMINSAMPLESHADINGARBPROC MinSampleShadingARB;
        /*  921 */ PFNGLDELETEOBJECTARBPROC DeleteObjectARB;
        /*  922 */ PFNGLGETHANDLEARBPROC GetHandleARB;
        /*  923 */ PFNGLDETACHOBJECTARBPROC DetachObjectARB;
        /*  924 */ PFNGLCREATESHADEROBJECTARBPROC CreateShaderObjectARB;
        /*  925 */ PFNGLSHADERSOURCEARBPROC ShaderSourceARB;
        /*  926 */ PFNGLCOMPILESHADERARBPROC CompileShaderARB;
        /*  927 */ PFNGLCREATEPROGRAMOBJECTARBPROC CreateProgramObjectARB;
        /*  928 */ PFNGLATTACHOBJECTARBPROC AttachObjectARB;
        /*  929 */ PFNGLLINKPROGRAMARBPROC LinkProgramARB;
        /*  930 */ PFNGLUSEPROGRAMOBJECTARBPROC UseProgramObjectARB;
        /*  931 */ PFNGLVALIDATEPROGRAMARBPROC ValidateProgramARB;
        /*  932 */ PFNGLUNIFORM1FARBPROC Uniform1fARB;
        /*  933 */ PFNGLUNIFORM2FARBPROC Uniform2fARB;
        /*  934 */ PFNGLUNIFORM3FARBPROC Uniform3fARB;
        /*  935 */ PFNGLUNIFORM4FARBPROC Uniform4fARB;
        /*  936 */ PFNGLUNIFORM1IARBPROC Uniform1iARB;
        /*  937 */ PFNGLUNIFORM2IARBPROC Uniform2iARB;
        /*  938 */ PFNGLUNIFORM3IARBPROC Uniform3iARB;
        /*  939 */ PFNGLUNIFORM4IARBPROC Uniform4iARB;
        /*  940 */ PFNGLUNIFORM1FVARBPROC Uniform1fvARB;
        /*  941 */ PFNGLUNIFORM2FVARBPROC Uniform2fvARB;
        /*  942 */ PFNGLUNIFORM3FVARBPROC Uniform3fvARB;
        /*  943 */ PFNGLUNIFORM4FVARBPROC Uniform4fvARB;
        /*  944 */ PFNGLUNIFORM1IVARBPROC Uniform1ivARB;
        /*  945 */ PFNGLUNIFORM2IVARBPROC Uniform2ivARB;
        /*  946 */ PFNGLUNIFORM3IVARBPROC Uniform3ivARB;
        /*  947 */ PFNGLUNIFORM4IVARBPROC Uniform4ivARB;
        /*  948 */ PFNGLUNIFORMMATRIX2FVARBPROC UniformMatrix2fvARB;
        /*  949 */ PFNGLUNIFORMMATRIX3FVARBPROC UniformMatrix3fvARB;
        /*  950 */ PFNGLUNIFORMMATRIX4FVARBPROC UniformMatrix4fvARB;
        /*  951 */ PFNGLGETOBJECTPARAMETERFVARBPROC GetObjectParameterfvARB;
        /*  952 */ PFNGLGETOBJECTPARAMETERIVARBPROC GetObjectParameterivARB;
        /*  953 */ PFNGLGETINFOLOGARBPROC GetInfoLogARB;
        /*  954 */ PFNGLGETATTACHEDOBJECTSARBPROC GetAttachedObjectsARB;
        /*  955 */ PFNGLGETUNIFORMLOCATIONARBPROC GetUniformLocationARB;
        /*  956 */ PFNGLGETACTIVEUNIFORMARBPROC GetActiveUniformARB;
        /*  957 */ PFNGLGETUNIFORMFVARBPROC GetUniformfvARB;
        /*  958 */ PFNGLGETUNIFORMIVARBPROC GetUniformivARB;
        /*  959 */ PFNGLGETSHADERSOURCEARBPROC GetShaderSourceARB;
        /*  960 */ PFNGLNAMEDSTRINGARBPROC NamedStringARB;
        /*  961 */ PFNGLDELETENAMEDSTRINGARBPROC DeleteNamedStringARB;
        /*  962 */ PFNGLCOMPILESHADERINCLUDEARBPROC CompileShaderIncludeARB;
        /*  963 */ PFNGLISNAMEDSTRINGARBPROC IsNamedStringARB;
        /*  964 */ PFNGLGETNAMEDSTRINGARBPROC GetNamedStringARB;
        /*  965 */ PFNGLGETNAMEDSTRINGIVARBPROC GetNamedStringivARB;
        /*  966 */ PFNGLBUFFERPAGECOMMITMENTARBPROC BufferPageCommitmentARB;
        /*  967 */ PFNGLNAMEDBUFFERPAGECOMMITMENTEXTPROC NamedBufferPageCommitmentEXT;
        /*  968 */ PFNGLNAMEDBUFFERPAGECOMMITMENTARBPROC NamedBufferPageCommitmentARB;
        /*  969 */ PFNGLTEXPAGECOMMITMENTARBPROC TexPageCommitmentARB;
        /*  970 */ PFNGLTEXBUFFERARBPROC TexBufferARB;
        /*  971 */ PFNGLCOMPRESSEDTEXIMAGE3DARBPROC CompressedTexImage3DARB;
        /*  972 */ PFNGLCOMPRESSEDTEXIMAGE2DARBPROC CompressedTexImage2DARB;
        /*  973 */ PFNGLCOMPRESSEDTEXIMAGE1DARBPROC CompressedTexImage1DARB;
        /*  974 */ PFNGLCOMPRESSEDTEXSUBIMAGE3DARBPROC CompressedTexSubImage3DARB;
        /*  975 */ PFNGLCOMPRESSEDTEXSUBIMAGE2DARBPROC CompressedTexSubImage2DARB;
        /*  976 */ PFNGLCOMPRESSEDTEXSUBIMAGE1DARBPROC CompressedTexSubImage1DARB;
        /*  977 */ PFNGLGETCOMPRESSEDTEXIMAGEARBPROC GetCompressedTexImageARB;
        /*  978 */ PFNGLLOADTRANSPOSEMATRIXFARBPROC LoadTransposeMatrixfARB;
        /*  979 */ PFNGLLOADTRANSPOSEMATRIXDARBPROC LoadTransposeMatrixdARB;
        /*  980 */ PFNGLMULTTRANSPOSEMATRIXFARBPROC MultTransposeMatrixfARB;
        /*  981 */ PFNGLMULTTRANSPOSEMATRIXDARBPROC MultTransposeMatrixdARB;
        /*  982 */ PFNGLWEIGHTBVARBPROC WeightbvARB;
        /*  983 */ PFNGLWEIGHTSVARBPROC WeightsvARB;
        /*  984 */ PFNGLWEIGHTIVARBPROC WeightivARB;
        /*  985 */ PFNGLWEIGHTFVARBPROC WeightfvARB;
        /*  986 */ PFNGLWEIGHTDVARBPROC WeightdvARB;
        /*  987 */ PFNGLWEIGHTUBVARBPROC WeightubvARB;
        /*  988 */ PFNGLWEIGHTUSVARBPROC WeightusvARB;
        /*  989 */ PFNGLWEIGHTUIVARBPROC WeightuivARB;
        /*  990 */ PFNGLWEIGHTPOINTERARBPROC WeightPointerARB;
        /*  991 */ PFNGLVERTEXBLENDARBPROC VertexBlendARB;
        /*  992 */ PFNGLBINDBUFFERARBPROC BindBufferARB;
        /*  993 */ PFNGLDELETEBUFFERSARBPROC DeleteBuffersARB;
        /*  994 */ PFNGLGENBUFFERSARBPROC GenBuffersARB;
        /*  995 */ PFNGLISBUFFERARBPROC IsBufferARB;
        /*  996 */ PFNGLBUFFERDATAARBPROC BufferDataARB;
        /*  997 */ PFNGLBUFFERSUBDATAARBPROC BufferSubDataARB;
        /*  998 */ PFNGLGETBUFFERSUBDATAARBPROC GetBufferSubDataARB;
        /*  999 */ PFNGLMAPBUFFERARBPROC MapBufferARB;
        /* 1000 */ PFNGLUNMAPBUFFERARBPROC UnmapBufferARB;
        /* 1001 */ PFNGLGETBUFFERPARAMETERIVARBPROC GetBufferParameterivARB;
        /* 1002 */ PFNGLGETBUFFERPOINTERVARBPROC GetBufferPointervARB;
        /* 1003 */ PFNGLVERTEXATTRIB1DARBPROC VertexAttrib1dARB;
        /* 1004 */ PFNGLVERTEXATTRIB1DVARBPROC VertexAttrib1dvARB;
        /* 1005 */ PFNGLVERTEXATTRIB1FARBPROC VertexAttrib1fARB;
        /* 1006 */ PFNGLVERTEXATTRIB1FVARBPROC VertexAttrib1fvARB;
        /* 1007 */ PFNGLVERTEXATTRIB1SARBPROC VertexAttrib1sARB;
        /* 1008 */ PFNGLVERTEXATTRIB1SVARBPROC VertexAttrib1svARB;
        /* 1009 */ PFNGLVERTEXATTRIB2DARBPROC VertexAttrib2dARB;
        /* 1010 */ PFNGLVERTEXATTRIB2DVARBPROC VertexAttrib2dvARB;
        /* 1011 */ PFNGLVERTEXATTRIB2FARBPROC VertexAttrib2fARB;
        /* 1012 */ PFNGLVERTEXATTRIB2FVARBPROC VertexAttrib2fvARB;
        /* 1013 */ PFNGLVERTEXATTRIB2SARBPROC VertexAttrib2sARB;
        /* 1014 */ PFNGLVERTEXATTRIB2SVARBPROC VertexAttrib2svARB;
        /* 1015 */ PFNGLVERTEXATTRIB3DARBPROC VertexAttrib3dARB;
        /* 1016 */ PFNGLVERTEXATTRIB3DVARBPROC VertexAttrib3dvARB;
        /* 1017 */ PFNGLVERTEXATTRIB3FARBPROC VertexAttrib3fARB;
        /* 1018 */ PFNGLVERTEXATTRIB3FVARBPROC VertexAttrib3fvARB;
        /* 1019 */ PFNGLVERTEXATTRIB3SARBPROC VertexAttrib3sARB;
        /* 1020 */ PFNGLVERTEXATTRIB3SVARBPROC VertexAttrib3svARB;
        /* 1021 */ PFNGLVERTEXATTRIB4NBVARBPROC VertexAttrib4NbvARB;
        /* 1022 */ PFNGLVERTEXATTRIB4NIVARBPROC VertexAttrib4NivARB;
        /* 1023 */ PFNGLVERTEXATTRIB4NSVARBPROC VertexAttrib4NsvARB;
        /* 1024 */ PFNGLVERTEXATTRIB4NUBARBPROC VertexAttrib4NubARB;
        /* 1025 */ PFNGLVERTEXATTRIB4NUBVARBPROC VertexAttrib4NubvARB;
        /* 1026 */ PFNGLVERTEXATTRIB4NUIVARBPROC VertexAttrib4NuivARB;
        /* 1027 */ PFNGLVERTEXATTRIB4NUSVARBPROC VertexAttrib4NusvARB;
        /* 1028 */ PFNGLVERTEXATTRIB4BVARBPROC VertexAttrib4bvARB;
        /* 1029 */ PFNGLVERTEXATTRIB4DARBPROC VertexAttrib4dARB;
        /* 1030 */ PFNGLVERTEXATTRIB4DVARBPROC VertexAttrib4dvARB;
        /* 1031 */ PFNGLVERTEXATTRIB4FARBPROC VertexAttrib4fARB;
        /* 1032 */ PFNGLVERTEXATTRIB4FVARBPROC VertexAttrib4fvARB;
        /* 1033 */ PFNGLVERTEXATTRIB4IVARBPROC VertexAttrib4ivARB;
        /* 1034 */ PFNGLVERTEXATTRIB4SARBPROC VertexAttrib4sARB;
        /* 1035 */ PFNGLVERTEXATTRIB4SVARBPROC VertexAttrib4svARB;
        /* 1036 */ PFNGLVERTEXATTRIB4UBVARBPROC VertexAttrib4ubvARB;
        /* 1037 */ PFNGLVERTEXATTRIB4UIVARBPROC VertexAttrib4uivARB;
        /* 1038 */ PFNGLVERTEXATTRIB4USVARBPROC VertexAttrib4usvARB;
        /* 1039 */ PFNGLVERTEXATTRIBPOINTERARBPROC VertexAttribPointerARB;
        /* 1040 */ PFNGLENABLEVERTEXATTRIBARRAYARBPROC EnableVertexAttribArrayARB;
        /* 1041 */ PFNGLDISABLEVERTEXATTRIBARRAYARBPROC DisableVertexAttribArrayARB;
        /* 1042 */ PFNGLGETVERTEXATTRIBDVARBPROC GetVertexAttribdvARB;
        /* 1043 */ PFNGLGETVERTEXATTRIBFVARBPROC GetVertexAttribfvARB;
        /* 1044 */ PFNGLGETVERTEXATTRIBIVARBPROC GetVertexAttribivARB;
        /* 1045 */ PFNGLGETVERTEXATTRIBPOINTERVARBPROC GetVertexAttribPointervARB;
        /* 1046 */ PFNGLBINDATTRIBLOCATIONARBPROC BindAttribLocationARB;
        /* 1047 */ PFNGLGETACTIVEATTRIBARBPROC GetActiveAttribARB;
        /* 1048 */ PFNGLGETATTRIBLOCATIONARBPROC GetAttribLocationARB;
        /* 1049 */ PFNGLDEPTHRANGEARRAYDVNVPROC DepthRangeArraydvNV;
        /* 1050 */ PFNGLDEPTHRANGEINDEXEDDNVPROC DepthRangeIndexeddNV;
        /* 1051 */ PFNGLWINDOWPOS2DARBPROC WindowPos2dARB;
        /* 1052 */ PFNGLWINDOWPOS2DVARBPROC WindowPos2dvARB;
        /* 1053 */ PFNGLWINDOWPOS2FARBPROC WindowPos2fARB;
        /* 1054 */ PFNGLWINDOWPOS2FVARBPROC WindowPos2fvARB;
        /* 1055 */ PFNGLWINDOWPOS2IARBPROC WindowPos2iARB;
        /* 1056 */ PFNGLWINDOWPOS2IVARBPROC WindowPos2ivARB;
        /* 1057 */ PFNGLWINDOWPOS2SARBPROC WindowPos2sARB;
        /* 1058 */ PFNGLWINDOWPOS2SVARBPROC WindowPos2svARB;
        /* 1059 */ PFNGLWINDOWPOS3DARBPROC WindowPos3dARB;
        /* 1060 */ PFNGLWINDOWPOS3DVARBPROC WindowPos3dvARB;
        /* 1061 */ PFNGLWINDOWPOS3FARBPROC WindowPos3fARB;
        /* 1062 */ PFNGLWINDOWPOS3FVARBPROC WindowPos3fvARB;
        /* 1063 */ PFNGLWINDOWPOS3IARBPROC WindowPos3iARB;
        /* 1064 */ PFNGLWINDOWPOS3IVARBPROC WindowPos3ivARB;
        /* 1065 */ PFNGLWINDOWPOS3SARBPROC WindowPos3sARB;
        /* 1066 */ PFNGLWINDOWPOS3SVARBPROC WindowPos3svARB;
        /* 1067 */ PFNGLDRAWBUFFERSATIPROC DrawBuffersATI;
        /* 1068 */ PFNGLELEMENTPOINTERATIPROC ElementPointerATI;
        /* 1069 */ PFNGLDRAWELEMENTARRAYATIPROC DrawElementArrayATI;
        /* 1070 */ PFNGLDRAWRANGEELEMENTARRAYATIPROC DrawRangeElementArrayATI;
        /* 1071 */ PFNGLTEXBUMPPARAMETERIVATIPROC TexBumpParameterivATI;
        /* 1072 */ PFNGLTEXBUMPPARAMETERFVATIPROC TexBumpParameterfvATI;
        /* 1073 */ PFNGLGETTEXBUMPPARAMETERIVATIPROC GetTexBumpParameterivATI;
        /* 1074 */ PFNGLGETTEXBUMPPARAMETERFVATIPROC GetTexBumpParameterfvATI;
        /* 1075 */ PFNGLGENFRAGMENTSHADERSATIPROC GenFragmentShadersATI;
        /* 1076 */ PFNGLBINDFRAGMENTSHADERATIPROC BindFragmentShaderATI;
        /* 1077 */ PFNGLDELETEFRAGMENTSHADERATIPROC DeleteFragmentShaderATI;
        /* 1078 */ PFNGLBEGINFRAGMENTSHADERATIPROC BeginFragmentShaderATI;
        /* 1079 */ PFNGLENDFRAGMENTSHADERATIPROC EndFragmentShaderATI;
        /* 1080 */ PFNGLPASSTEXCOORDATIPROC PassTexCoordATI;
        /* 1081 */ PFNGLSAMPLEMAPATIPROC SampleMapATI;
        /* 1082 */ PFNGLCOLORFRAGMENTOP1ATIPROC ColorFragmentOp1ATI;
        /* 1083 */ PFNGLCOLORFRAGMENTOP2ATIPROC ColorFragmentOp2ATI;
        /* 1084 */ PFNGLCOLORFRAGMENTOP3ATIPROC ColorFragmentOp3ATI;
        /* 1085 */ PFNGLALPHAFRAGMENTOP1ATIPROC AlphaFragmentOp1ATI;
        /* 1086 */ PFNGLALPHAFRAGMENTOP2ATIPROC AlphaFragmentOp2ATI;
        /* 1087 */ PFNGLALPHAFRAGMENTOP3ATIPROC AlphaFragmentOp3ATI;
        /* 1088 */ PFNGLSETFRAGMENTSHADERCONSTANTATIPROC SetFragmentShaderConstantATI;
        /* 1089 */ PFNGLMAPOBJECTBUFFERATIPROC MapObjectBufferATI;
        /* 1090 */ PFNGLUNMAPOBJECTBUFFERATIPROC UnmapObjectBufferATI;
        /* 1091 */ PFNGLPNTRIANGLESIATIPROC PNTrianglesiATI;
        /* 1092 */ PFNGLPNTRIANGLESFATIPROC PNTrianglesfATI;
        /* 1093 */ PFNGLSTENCILOPSEPARATEATIPROC StencilOpSeparateATI;
        /* 1094 */ PFNGLSTENCILFUNCSEPARATEATIPROC StencilFuncSeparateATI;
        /* 1095 */ PFNGLNEWOBJECTBUFFERATIPROC NewObjectBufferATI;
        /* 1096 */ PFNGLISOBJECTBUFFERATIPROC IsObjectBufferATI;
        /* 1097 */ PFNGLUPDATEOBJECTBUFFERATIPROC UpdateObjectBufferATI;
        /* 1098 */ PFNGLGETOBJECTBUFFERFVATIPROC GetObjectBufferfvATI;
        /* 1099 */ PFNGLGETOBJECTBUFFERIVATIPROC GetObjectBufferivATI;
        /* 1100 */ PFNGLFREEOBJECTBUFFERATIPROC FreeObjectBufferATI;
        /* 1101 */ PFNGLARRAYOBJECTATIPROC ArrayObjectATI;
        /* 1102 */ PFNGLGETARRAYOBJECTFVATIPROC GetArrayObjectfvATI;
        /* 1103 */ PFNGLGETARRAYOBJECTIVATIPROC GetArrayObjectivATI;
        /* 1104 */ PFNGLVARIANTARRAYOBJECTATIPROC VariantArrayObjectATI;
        /* 1105 */ PFNGLGETVARIANTARRAYOBJECTFVATIPROC GetVariantArrayObjectfvATI;
        /* 1106 */ PFNGLGETVARIANTARRAYOBJECTIVATIPROC GetVariantArrayObjectivATI;
        /* 1107 */ PFNGLVERTEXATTRIBARRAYOBJECTATIPROC VertexAttribArrayObjectATI;
        /* 1108 */ PFNGLGETVERTEXATTRIBARRAYOBJECTFVATIPROC GetVertexAttribArrayObjectfvATI;
        /* 1109 */ PFNGLGETVERTEXATTRIBARRAYOBJECTIVATIPROC GetVertexAttribArrayObjectivATI;
        /* 1110 */ PFNGLVERTEXSTREAM1SATIPROC VertexStream1sATI;
        /* 1111 */ PFNGLVERTEXSTREAM1SVATIPROC VertexStream1svATI;
        /* 1112 */ PFNGLVERTEXSTREAM1IATIPROC VertexStream1iATI;
        /* 1113 */ PFNGLVERTEXSTREAM1IVATIPROC VertexStream1ivATI;
        /* 1114 */ PFNGLVERTEXSTREAM1FATIPROC VertexStream1fATI;
        /* 1115 */ PFNGLVERTEXSTREAM1FVATIPROC VertexStream1fvATI;
        /* 1116 */ PFNGLVERTEXSTREAM1DATIPROC VertexStream1dATI;
        /* 1117 */ PFNGLVERTEXSTREAM1DVATIPROC VertexStream1dvATI;
        /* 1118 */ PFNGLVERTEXSTREAM2SATIPROC VertexStream2sATI;
        /* 1119 */ PFNGLVERTEXSTREAM2SVATIPROC VertexStream2svATI;
        /* 1120 */ PFNGLVERTEXSTREAM2IATIPROC VertexStream2iATI;
        /* 1121 */ PFNGLVERTEXSTREAM2IVATIPROC VertexStream2ivATI;
        /* 1122 */ PFNGLVERTEXSTREAM2FATIPROC VertexStream2fATI;
        /* 1123 */ PFNGLVERTEXSTREAM2FVATIPROC VertexStream2fvATI;
        /* 1124 */ PFNGLVERTEXSTREAM2DATIPROC VertexStream2dATI;
        /* 1125 */ PFNGLVERTEXSTREAM2DVATIPROC VertexStream2dvATI;
        /* 1126 */ PFNGLVERTEXSTREAM3SATIPROC VertexStream3sATI;
        /* 1127 */ PFNGLVERTEXSTREAM3SVATIPROC VertexStream3svATI;
        /* 1128 */ PFNGLVERTEXSTREAM3IATIPROC VertexStream3iATI;
        /* 1129 */ PFNGLVERTEXSTREAM3IVATIPROC VertexStream3ivATI;
        /* 1130 */ PFNGLVERTEXSTREAM3FATIPROC VertexStream3fATI;
        /* 1131 */ PFNGLVERTEXSTREAM3FVATIPROC VertexStream3fvATI;
        /* 1132 */ PFNGLVERTEXSTREAM3DATIPROC VertexStream3dATI;
        /* 1133 */ PFNGLVERTEXSTREAM3DVATIPROC VertexStream3dvATI;
        /* 1134 */ PFNGLVERTEXSTREAM4SATIPROC VertexStream4sATI;
        /* 1135 */ PFNGLVERTEXSTREAM4SVATIPROC VertexStream4svATI;
        /* 1136 */ PFNGLVERTEXSTREAM4IATIPROC VertexStream4iATI;
        /* 1137 */ PFNGLVERTEXSTREAM4IVATIPROC VertexStream4ivATI;
        /* 1138 */ PFNGLVERTEXSTREAM4FATIPROC VertexStream4fATI;
        /* 1139 */ PFNGLVERTEXSTREAM4FVATIPROC VertexStream4fvATI;
        /* 1140 */ PFNGLVERTEXSTREAM4DATIPROC VertexStream4dATI;
        /* 1141 */ PFNGLVERTEXSTREAM4DVATIPROC VertexStream4dvATI;
        /* 1142 */ PFNGLNORMALSTREAM3BATIPROC NormalStream3bATI;
        /* 1143 */ PFNGLNORMALSTREAM3BVATIPROC NormalStream3bvATI;
        /* 1144 */ PFNGLNORMALSTREAM3SATIPROC NormalStream3sATI;
        /* 1145 */ PFNGLNORMALSTREAM3SVATIPROC NormalStream3svATI;
        /* 1146 */ PFNGLNORMALSTREAM3IATIPROC NormalStream3iATI;
        /* 1147 */ PFNGLNORMALSTREAM3IVATIPROC NormalStream3ivATI;
        /* 1148 */ PFNGLNORMALSTREAM3FATIPROC NormalStream3fATI;
        /* 1149 */ PFNGLNORMALSTREAM3FVATIPROC NormalStream3fvATI;
        /* 1150 */ PFNGLNORMALSTREAM3DATIPROC NormalStream3dATI;
        /* 1151 */ PFNGLNORMALSTREAM3DVATIPROC NormalStream3dvATI;
        /* 1152 */ PFNGLCLIENTACTIVEVERTEXSTREAMATIPROC ClientActiveVertexStreamATI;
        /* 1153 */ PFNGLVERTEXBLENDENVIATIPROC VertexBlendEnviATI;
        /* 1154 */ PFNGLVERTEXBLENDENVFATIPROC VertexBlendEnvfATI;
        /* 1155 */ PFNGLEGLIMAGETARGETTEXSTORAGEEXTPROC EGLImageTargetTexStorageEXT;
        /* 1156 */ PFNGLEGLIMAGETARGETTEXTURESTORAGEEXTPROC EGLImageTargetTextureStorageEXT;
        /* 1157 */ PFNGLUNIFORMBUFFEREXTPROC UniformBufferEXT;
        /* 1158 */ PFNGLGETUNIFORMBUFFERSIZEEXTPROC GetUniformBufferSizeEXT;
        /* 1159 */ PFNGLGETUNIFORMOFFSETEXTPROC GetUniformOffsetEXT;
        /* 1160 */ PFNGLBLENDCOLOREXTPROC BlendColorEXT;
        /* 1161 */ PFNGLBLENDEQUATIONSEPARATEEXTPROC BlendEquationSeparateEXT;
        /* 1162 */ PFNGLBINDFRAGDATALOCATIONEXTPROC BindFragDataLocationEXT;
        /* 1163 */ PFNGLBLENDFUNCSEPARATEEXTPROC BlendFuncSeparateEXT;
        /* 1164 */ PFNGLBLENDEQUATIONEXTPROC BlendEquationEXT;
        /* 1165 */ PFNGLCOLORSUBTABLEEXTPROC ColorSubTableEXT;
        /* 1166 */ PFNGLCOPYCOLORSUBTABLEEXTPROC CopyColorSubTableEXT;
        /* 1167 */ PFNGLLOCKARRAYSEXTPROC LockArraysEXT;
        /* 1168 */ PFNGLUNLOCKARRAYSEXTPROC UnlockArraysEXT;
        /* 1169 */ PFNGLCONVOLUTIONFILTER1DEXTPROC ConvolutionFilter1DEXT;
        /* 1170 */ PFNGLCONVOLUTIONFILTER2DEXTPROC ConvolutionFilter2DEXT;
        /* 1171 */ PFNGLCONVOLUTIONPARAMETERFEXTPROC ConvolutionParameterfEXT;
        /* 1172 */ PFNGLCONVOLUTIONPARAMETERFVEXTPROC ConvolutionParameterfvEXT;
        /* 1173 */ PFNGLCONVOLUTIONPARAMETERIEXTPROC ConvolutionParameteriEXT;
        /* 1174 */ PFNGLCONVOLUTIONPARAMETERIVEXTPROC ConvolutionParameterivEXT;
        /* 1175 */ PFNGLCOPYCONVOLUTIONFILTER1DEXTPROC CopyConvolutionFilter1DEXT;
        /* 1176 */ PFNGLCOPYCONVOLUTIONFILTER2DEXTPROC CopyConvolutionFilter2DEXT;
        /* 1177 */ PFNGLGETCONVOLUTIONFILTEREXTPROC GetConvolutionFilterEXT;
        /* 1178 */ PFNGLGETCONVOLUTIONPARAMETERFVEXTPROC GetConvolutionParameterfvEXT;
        /* 1179 */ PFNGLGETCONVOLUTIONPARAMETERIVEXTPROC GetConvolutionParameterivEXT;
        /* 1180 */ PFNGLGETSEPARABLEFILTEREXTPROC GetSeparableFilterEXT;
        /* 1181 */ PFNGLSEPARABLEFILTER2DEXTPROC SeparableFilter2DEXT;
        /* 1182 */ PFNGLTANGENT3BEXTPROC Tangent3bEXT;
        /* 1183 */ PFNGLTANGENT3BVEXTPROC Tangent3bvEXT;
        /* 1184 */ PFNGLTANGENT3DEXTPROC Tangent3dEXT;
        /* 1185 */ PFNGLTANGENT3DVEXTPROC Tangent3dvEXT;
        /* 1186 */ PFNGLTANGENT3FEXTPROC Tangent3fEXT;
        /* 1187 */ PFNGLTANGENT3FVEXTPROC Tangent3fvEXT;
        /* 1188 */ PFNGLTANGENT3IEXTPROC Tangent3iEXT;
        /* 1189 */ PFNGLTANGENT3IVEXTPROC Tangent3ivEXT;
        /* 1190 */ PFNGLTANGENT3SEXTPROC Tangent3sEXT;
        /* 1191 */ PFNGLTANGENT3SVEXTPROC Tangent3svEXT;
        /* 1192 */ PFNGLBINORMAL3BEXTPROC Binormal3bEXT;
        /* 1193 */ PFNGLBINORMAL3BVEXTPROC Binormal3bvEXT;
        /* 1194 */ PFNGLBINORMAL3DEXTPROC Binormal3dEXT;
        /* 1195 */ PFNGLBINORMAL3DVEXTPROC Binormal3dvEXT;
        /* 1196 */ PFNGLBINORMAL3FEXTPROC Binormal3fEXT;
        /* 1197 */ PFNGLBINORMAL3FVEXTPROC Binormal3fvEXT;
        /* 1198 */ PFNGLBINORMAL3IEXTPROC Binormal3iEXT;
        /* 1199 */ PFNGLBINORMAL3IVEXTPROC Binormal3ivEXT;
        /* 1200 */ PFNGLBINORMAL3SEXTPROC Binormal3sEXT;
        /* 1201 */ PFNGLBINORMAL3SVEXTPROC Binormal3svEXT;
        /* 1202 */ PFNGLTANGENTPOINTEREXTPROC TangentPointerEXT;
        /* 1203 */ PFNGLBINORMALPOINTEREXTPROC BinormalPointerEXT;
        /* 1204 */ PFNGLCOPYTEXIMAGE1DEXTPROC CopyTexImage1DEXT;
        /* 1205 */ PFNGLCOPYTEXIMAGE2DEXTPROC CopyTexImage2DEXT;
        /* 1206 */ PFNGLCOPYTEXSUBIMAGE1DEXTPROC CopyTexSubImage1DEXT;
        /* 1207 */ PFNGLCOPYTEXSUBIMAGE2DEXTPROC CopyTexSubImage2DEXT;
        /* 1208 */ PFNGLCOPYTEXSUBIMAGE3DEXTPROC CopyTexSubImage3DEXT;
        /* 1209 */ PFNGLCULLPARAMETERDVEXTPROC CullParameterdvEXT;
        /* 1210 */ PFNGLCULLPARAMETERFVEXTPROC CullParameterfvEXT;
        /* 1211 */ PFNGLLABELOBJECTEXTPROC LabelObjectEXT;
        /* 1212 */ PFNGLGETOBJECTLABELEXTPROC GetObjectLabelEXT;
        /* 1213 */ PFNGLINSERTEVENTMARKEREXTPROC InsertEventMarkerEXT;
        /* 1214 */ PFNGLPUSHGROUPMARKEREXTPROC PushGroupMarkerEXT;
        /* 1215 */ PFNGLPOPGROUPMARKEREXTPROC PopGroupMarkerEXT;
        /* 1216 */ PFNGLDEPTHBOUNDSEXTPROC DepthBoundsEXT;
        /* 1217 */ PFNGLMATRIXLOADFEXTPROC MatrixLoadfEXT;
        /* 1218 */ PFNGLMATRIXLOADDEXTPROC MatrixLoaddEXT;
        /* 1219 */ PFNGLMATRIXMULTFEXTPROC MatrixMultfEXT;
        /* 1220 */ PFNGLMATRIXMULTDEXTPROC MatrixMultdEXT;
        /* 1221 */ PFNGLMATRIXLOADIDENTITYEXTPROC MatrixLoadIdentityEXT;
        /* 1222 */ PFNGLMATRIXROTATEFEXTPROC MatrixRotatefEXT;
        /* 1223 */ PFNGLMATRIXROTATEDEXTPROC MatrixRotatedEXT;
        /* 1224 */ PFNGLMATRIXSCALEFEXTPROC MatrixScalefEXT;
        /* 1225 */ PFNGLMATRIXSCALEDEXTPROC MatrixScaledEXT;
        /* 1226 */ PFNGLMATRIXTRANSLATEFEXTPROC MatrixTranslatefEXT;
        /* 1227 */ PFNGLMATRIXTRANSLATEDEXTPROC MatrixTranslatedEXT;
        /* 1228 */ PFNGLMATRIXFRUSTUMEXTPROC MatrixFrustumEXT;
        /* 1229 */ PFNGLMATRIXORTHOEXTPROC MatrixOrthoEXT;
        /* 1230 */ PFNGLMATRIXPOPEXTPROC MatrixPopEXT;
        /* 1231 */ PFNGLMATRIXPUSHEXTPROC MatrixPushEXT;
        /* 1232 */ PFNGLCLIENTATTRIBDEFAULTEXTPROC ClientAttribDefaultEXT;
        /* 1233 */ PFNGLPUSHCLIENTATTRIBDEFAULTEXTPROC PushClientAttribDefaultEXT;
        /* 1234 */ PFNGLTEXTUREPARAMETERFEXTPROC TextureParameterfEXT;
        /* 1235 */ PFNGLTEXTUREPARAMETERFVEXTPROC TextureParameterfvEXT;
        /* 1236 */ PFNGLTEXTUREPARAMETERIEXTPROC TextureParameteriEXT;
        /* 1237 */ PFNGLTEXTUREPARAMETERIVEXTPROC TextureParameterivEXT;
        /* 1238 */ PFNGLTEXTUREIMAGE1DEXTPROC TextureImage1DEXT;
        /* 1239 */ PFNGLTEXTUREIMAGE2DEXTPROC TextureImage2DEXT;
        /* 1240 */ PFNGLTEXTURESUBIMAGE1DEXTPROC TextureSubImage1DEXT;
        /* 1241 */ PFNGLTEXTURESUBIMAGE2DEXTPROC TextureSubImage2DEXT;
        /* 1242 */ PFNGLCOPYTEXTUREIMAGE1DEXTPROC CopyTextureImage1DEXT;
        /* 1243 */ PFNGLCOPYTEXTUREIMAGE2DEXTPROC CopyTextureImage2DEXT;
        /* 1244 */ PFNGLCOPYTEXTURESUBIMAGE1DEXTPROC CopyTextureSubImage1DEXT;
        /* 1245 */ PFNGLCOPYTEXTURESUBIMAGE2DEXTPROC CopyTextureSubImage2DEXT;
        /* 1246 */ PFNGLGETTEXTUREIMAGEEXTPROC GetTextureImageEXT;
        /* 1247 */ PFNGLGETTEXTUREPARAMETERFVEXTPROC GetTextureParameterfvEXT;
        /* 1248 */ PFNGLGETTEXTUREPARAMETERIVEXTPROC GetTextureParameterivEXT;
        /* 1249 */ PFNGLGETTEXTURELEVELPARAMETERFVEXTPROC GetTextureLevelParameterfvEXT;
        /* 1250 */ PFNGLGETTEXTURELEVELPARAMETERIVEXTPROC GetTextureLevelParameterivEXT;
        /* 1251 */ PFNGLTEXTUREIMAGE3DEXTPROC TextureImage3DEXT;
        /* 1252 */ PFNGLTEXTURESUBIMAGE3DEXTPROC TextureSubImage3DEXT;
        /* 1253 */ PFNGLCOPYTEXTURESUBIMAGE3DEXTPROC CopyTextureSubImage3DEXT;
        /* 1254 */ PFNGLBINDMULTITEXTUREEXTPROC BindMultiTextureEXT;
        /* 1255 */ PFNGLMULTITEXCOORDPOINTEREXTPROC MultiTexCoordPointerEXT;
        /* 1256 */ PFNGLMULTITEXENVFEXTPROC MultiTexEnvfEXT;
        /* 1257 */ PFNGLMULTITEXENVFVEXTPROC MultiTexEnvfvEXT;
        /* 1258 */ PFNGLMULTITEXENVIEXTPROC MultiTexEnviEXT;
        /* 1259 */ PFNGLMULTITEXENVIVEXTPROC MultiTexEnvivEXT;
        /* 1260 */ PFNGLMULTITEXGENDEXTPROC MultiTexGendEXT;
        /* 1261 */ PFNGLMULTITEXGENDVEXTPROC MultiTexGendvEXT;
        /* 1262 */ PFNGLMULTITEXGENFEXTPROC MultiTexGenfEXT;
        /* 1263 */ PFNGLMULTITEXGENFVEXTPROC MultiTexGenfvEXT;
        /* 1264 */ PFNGLMULTITEXGENIEXTPROC MultiTexGeniEXT;
        /* 1265 */ PFNGLMULTITEXGENIVEXTPROC MultiTexGenivEXT;
        /* 1266 */ PFNGLGETMULTITEXENVFVEXTPROC GetMultiTexEnvfvEXT;
        /* 1267 */ PFNGLGETMULTITEXENVIVEXTPROC GetMultiTexEnvivEXT;
        /* 1268 */ PFNGLGETMULTITEXGENDVEXTPROC GetMultiTexGendvEXT;
        /* 1269 */ PFNGLGETMULTITEXGENFVEXTPROC GetMultiTexGenfvEXT;
        /* 1270 */ PFNGLGETMULTITEXGENIVEXTPROC GetMultiTexGenivEXT;
        /* 1271 */ PFNGLMULTITEXPARAMETERIEXTPROC MultiTexParameteriEXT;
        /* 1272 */ PFNGLMULTITEXPARAMETERIVEXTPROC MultiTexParameterivEXT;
        /* 1273 */ PFNGLMULTITEXPARAMETERFEXTPROC MultiTexParameterfEXT;
        /* 1274 */ PFNGLMULTITEXPARAMETERFVEXTPROC MultiTexParameterfvEXT;
        /* 1275 */ PFNGLMULTITEXIMAGE1DEXTPROC MultiTexImage1DEXT;
        /* 1276 */ PFNGLMULTITEXIMAGE2DEXTPROC MultiTexImage2DEXT;
        /* 1277 */ PFNGLMULTITEXSUBIMAGE1DEXTPROC MultiTexSubImage1DEXT;
        /* 1278 */ PFNGLMULTITEXSUBIMAGE2DEXTPROC MultiTexSubImage2DEXT;
        /* 1279 */ PFNGLCOPYMULTITEXIMAGE1DEXTPROC CopyMultiTexImage1DEXT;
        /* 1280 */ PFNGLCOPYMULTITEXIMAGE2DEXTPROC CopyMultiTexImage2DEXT;
        /* 1281 */ PFNGLCOPYMULTITEXSUBIMAGE1DEXTPROC CopyMultiTexSubImage1DEXT;
        /* 1282 */ PFNGLCOPYMULTITEXSUBIMAGE2DEXTPROC CopyMultiTexSubImage2DEXT;
        /* 1283 */ PFNGLGETMULTITEXIMAGEEXTPROC GetMultiTexImageEXT;
        /* 1284 */ PFNGLGETMULTITEXPARAMETERFVEXTPROC GetMultiTexParameterfvEXT;
        /* 1285 */ PFNGLGETMULTITEXPARAMETERIVEXTPROC GetMultiTexParameterivEXT;
        /* 1286 */ PFNGLGETMULTITEXLEVELPARAMETERFVEXTPROC GetMultiTexLevelParameterfvEXT;
        /* 1287 */ PFNGLGETMULTITEXLEVELPARAMETERIVEXTPROC GetMultiTexLevelParameterivEXT;
        /* 1288 */ PFNGLMULTITEXIMAGE3DEXTPROC MultiTexImage3DEXT;
        /* 1289 */ PFNGLMULTITEXSUBIMAGE3DEXTPROC MultiTexSubImage3DEXT;
        /* 1290 */ PFNGLCOPYMULTITEXSUBIMAGE3DEXTPROC CopyMultiTexSubImage3DEXT;
        /* 1291 */ PFNGLENABLECLIENTSTATEINDEXEDEXTPROC EnableClientStateIndexedEXT;
        /* 1292 */ PFNGLDISABLECLIENTSTATEINDEXEDEXTPROC DisableClientStateIndexedEXT;
        /* 1293 */ PFNGLGETFLOATINDEXEDVEXTPROC GetFloatIndexedvEXT;
        /* 1294 */ PFNGLGETDOUBLEINDEXEDVEXTPROC GetDoubleIndexedvEXT;
        /* 1295 */ PFNGLGETPOINTERINDEXEDVEXTPROC GetPointerIndexedvEXT;
        /* 1296 */ PFNGLENABLEINDEXEDEXTPROC EnableIndexedEXT;
        /* 1297 */ PFNGLDISABLEINDEXEDEXTPROC DisableIndexedEXT;
        /* 1298 */ PFNGLISENABLEDINDEXEDEXTPROC IsEnabledIndexedEXT;
        /* 1299 */ PFNGLGETINTEGERINDEXEDVEXTPROC GetIntegerIndexedvEXT;
        /* 1300 */ PFNGLGETBOOLEANINDEXEDVEXTPROC GetBooleanIndexedvEXT;
        /* 1301 */ PFNGLCOMPRESSEDTEXTUREIMAGE3DEXTPROC CompressedTextureImage3DEXT;
        /* 1302 */ PFNGLCOMPRESSEDTEXTUREIMAGE2DEXTPROC CompressedTextureImage2DEXT;
        /* 1303 */ PFNGLCOMPRESSEDTEXTUREIMAGE1DEXTPROC CompressedTextureImage1DEXT;
        /* 1304 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE3DEXTPROC CompressedTextureSubImage3DEXT;
        /* 1305 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE2DEXTPROC CompressedTextureSubImage2DEXT;
        /* 1306 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE1DEXTPROC CompressedTextureSubImage1DEXT;
        /* 1307 */ PFNGLGETCOMPRESSEDTEXTUREIMAGEEXTPROC GetCompressedTextureImageEXT;
        /* 1308 */ PFNGLCOMPRESSEDMULTITEXIMAGE3DEXTPROC CompressedMultiTexImage3DEXT;
        /* 1309 */ PFNGLCOMPRESSEDMULTITEXIMAGE2DEXTPROC CompressedMultiTexImage2DEXT;
        /* 1310 */ PFNGLCOMPRESSEDMULTITEXIMAGE1DEXTPROC CompressedMultiTexImage1DEXT;
        /* 1311 */ PFNGLCOMPRESSEDMULTITEXSUBIMAGE3DEXTPROC CompressedMultiTexSubImage3DEXT;
        /* 1312 */ PFNGLCOMPRESSEDMULTITEXSUBIMAGE2DEXTPROC CompressedMultiTexSubImage2DEXT;
        /* 1313 */ PFNGLCOMPRESSEDMULTITEXSUBIMAGE1DEXTPROC CompressedMultiTexSubImage1DEXT;
        /* 1314 */ PFNGLGETCOMPRESSEDMULTITEXIMAGEEXTPROC GetCompressedMultiTexImageEXT;
        /* 1315 */ PFNGLMATRIXLOADTRANSPOSEFEXTPROC MatrixLoadTransposefEXT;
        /* 1316 */ PFNGLMATRIXLOADTRANSPOSEDEXTPROC MatrixLoadTransposedEXT;
        /* 1317 */ PFNGLMATRIXMULTTRANSPOSEFEXTPROC MatrixMultTransposefEXT;
        /* 1318 */ PFNGLMATRIXMULTTRANSPOSEDEXTPROC MatrixMultTransposedEXT;
        /* 1319 */ PFNGLNAMEDBUFFERDATAEXTPROC NamedBufferDataEXT;
        /* 1320 */ PFNGLNAMEDBUFFERSUBDATAEXTPROC NamedBufferSubDataEXT;
        /* 1321 */ PFNGLMAPNAMEDBUFFEREXTPROC MapNamedBufferEXT;
        /* 1322 */ PFNGLUNMAPNAMEDBUFFEREXTPROC UnmapNamedBufferEXT;
        /* 1323 */ PFNGLGETNAMEDBUFFERPARAMETERIVEXTPROC GetNamedBufferParameterivEXT;
        /* 1324 */ PFNGLGETNAMEDBUFFERPOINTERVEXTPROC GetNamedBufferPointervEXT;
        /* 1325 */ PFNGLGETNAMEDBUFFERSUBDATAEXTPROC GetNamedBufferSubDataEXT;
        /* 1326 */ PFNGLPROGRAMUNIFORM1FEXTPROC ProgramUniform1fEXT;
        /* 1327 */ PFNGLPROGRAMUNIFORM2FEXTPROC ProgramUniform2fEXT;
        /* 1328 */ PFNGLPROGRAMUNIFORM3FEXTPROC ProgramUniform3fEXT;
        /* 1329 */ PFNGLPROGRAMUNIFORM4FEXTPROC ProgramUniform4fEXT;
        /* 1330 */ PFNGLPROGRAMUNIFORM1IEXTPROC ProgramUniform1iEXT;
        /* 1331 */ PFNGLPROGRAMUNIFORM2IEXTPROC ProgramUniform2iEXT;
        /* 1332 */ PFNGLPROGRAMUNIFORM3IEXTPROC ProgramUniform3iEXT;
        /* 1333 */ PFNGLPROGRAMUNIFORM4IEXTPROC ProgramUniform4iEXT;
        /* 1334 */ PFNGLPROGRAMUNIFORM1FVEXTPROC ProgramUniform1fvEXT;
        /* 1335 */ PFNGLPROGRAMUNIFORM2FVEXTPROC ProgramUniform2fvEXT;
        /* 1336 */ PFNGLPROGRAMUNIFORM3FVEXTPROC ProgramUniform3fvEXT;
        /* 1337 */ PFNGLPROGRAMUNIFORM4FVEXTPROC ProgramUniform4fvEXT;
        /* 1338 */ PFNGLPROGRAMUNIFORM1IVEXTPROC ProgramUniform1ivEXT;
        /* 1339 */ PFNGLPROGRAMUNIFORM2IVEXTPROC ProgramUniform2ivEXT;
        /* 1340 */ PFNGLPROGRAMUNIFORM3IVEXTPROC ProgramUniform3ivEXT;
        /* 1341 */ PFNGLPROGRAMUNIFORM4IVEXTPROC ProgramUniform4ivEXT;
        /* 1342 */ PFNGLPROGRAMUNIFORMMATRIX2FVEXTPROC ProgramUniformMatrix2fvEXT;
        /* 1343 */ PFNGLPROGRAMUNIFORMMATRIX3FVEXTPROC ProgramUniformMatrix3fvEXT;
        /* 1344 */ PFNGLPROGRAMUNIFORMMATRIX4FVEXTPROC ProgramUniformMatrix4fvEXT;
        /* 1345 */ PFNGLPROGRAMUNIFORMMATRIX2X3FVEXTPROC ProgramUniformMatrix2x3fvEXT;
        /* 1346 */ PFNGLPROGRAMUNIFORMMATRIX3X2FVEXTPROC ProgramUniformMatrix3x2fvEXT;
        /* 1347 */ PFNGLPROGRAMUNIFORMMATRIX2X4FVEXTPROC ProgramUniformMatrix2x4fvEXT;
        /* 1348 */ PFNGLPROGRAMUNIFORMMATRIX4X2FVEXTPROC ProgramUniformMatrix4x2fvEXT;
        /* 1349 */ PFNGLPROGRAMUNIFORMMATRIX3X4FVEXTPROC ProgramUniformMatrix3x4fvEXT;
        /* 1350 */ PFNGLPROGRAMUNIFORMMATRIX4X3FVEXTPROC ProgramUniformMatrix4x3fvEXT;
        /* 1351 */ PFNGLTEXTUREBUFFEREXTPROC TextureBufferEXT;
        /* 1352 */ PFNGLMULTITEXBUFFEREXTPROC MultiTexBufferEXT;
        /* 1353 */ PFNGLTEXTUREPARAMETERIIVEXTPROC TextureParameterIivEXT;
        /* 1354 */ PFNGLTEXTUREPARAMETERIUIVEXTPROC TextureParameterIuivEXT;
        /* 1355 */ PFNGLGETTEXTUREPARAMETERIIVEXTPROC GetTextureParameterIivEXT;
        /* 1356 */ PFNGLGETTEXTUREPARAMETERIUIVEXTPROC GetTextureParameterIuivEXT;
        /* 1357 */ PFNGLMULTITEXPARAMETERIIVEXTPROC MultiTexParameterIivEXT;
        /* 1358 */ PFNGLMULTITEXPARAMETERIUIVEXTPROC MultiTexParameterIuivEXT;
        /* 1359 */ PFNGLGETMULTITEXPARAMETERIIVEXTPROC GetMultiTexParameterIivEXT;
        /* 1360 */ PFNGLGETMULTITEXPARAMETERIUIVEXTPROC GetMultiTexParameterIuivEXT;
        /* 1361 */ PFNGLPROGRAMUNIFORM1UIEXTPROC ProgramUniform1uiEXT;
        /* 1362 */ PFNGLPROGRAMUNIFORM2UIEXTPROC ProgramUniform2uiEXT;
        /* 1363 */ PFNGLPROGRAMUNIFORM3UIEXTPROC ProgramUniform3uiEXT;
        /* 1364 */ PFNGLPROGRAMUNIFORM4UIEXTPROC ProgramUniform4uiEXT;
        /* 1365 */ PFNGLPROGRAMUNIFORM1UIVEXTPROC ProgramUniform1uivEXT;
        /* 1366 */ PFNGLPROGRAMUNIFORM2UIVEXTPROC ProgramUniform2uivEXT;
        /* 1367 */ PFNGLPROGRAMUNIFORM3UIVEXTPROC ProgramUniform3uivEXT;
        /* 1368 */ PFNGLPROGRAMUNIFORM4UIVEXTPROC ProgramUniform4uivEXT;
        /* 1369 */ PFNGLNAMEDPROGRAMLOCALPARAMETERS4FVEXTPROC NamedProgramLocalParameters4fvEXT;
        /* 1370 */ PFNGLNAMEDPROGRAMLOCALPARAMETERI4IEXTPROC NamedProgramLocalParameterI4iEXT;
        /* 1371 */ PFNGLNAMEDPROGRAMLOCALPARAMETERI4IVEXTPROC NamedProgramLocalParameterI4ivEXT;
        /* 1372 */ PFNGLNAMEDPROGRAMLOCALPARAMETERSI4IVEXTPROC NamedProgramLocalParametersI4ivEXT;
        /* 1373 */ PFNGLNAMEDPROGRAMLOCALPARAMETERI4UIEXTPROC NamedProgramLocalParameterI4uiEXT;
        /* 1374 */ PFNGLNAMEDPROGRAMLOCALPARAMETERI4UIVEXTPROC NamedProgramLocalParameterI4uivEXT;
        /* 1375 */ PFNGLNAMEDPROGRAMLOCALPARAMETERSI4UIVEXTPROC NamedProgramLocalParametersI4uivEXT;
        /* 1376 */ PFNGLGETNAMEDPROGRAMLOCALPARAMETERIIVEXTPROC GetNamedProgramLocalParameterIivEXT;
        /* 1377 */ PFNGLGETNAMEDPROGRAMLOCALPARAMETERIUIVEXTPROC GetNamedProgramLocalParameterIuivEXT;
        /* 1378 */ PFNGLENABLECLIENTSTATEIEXTPROC EnableClientStateiEXT;
        /* 1379 */ PFNGLDISABLECLIENTSTATEIEXTPROC DisableClientStateiEXT;
        /* 1380 */ PFNGLGETFLOATI_VEXTPROC GetFloati_vEXT;
        /* 1381 */ PFNGLGETDOUBLEI_VEXTPROC GetDoublei_vEXT;
        /* 1382 */ PFNGLGETPOINTERI_VEXTPROC GetPointeri_vEXT;
        /* 1383 */ PFNGLNAMEDPROGRAMSTRINGEXTPROC NamedProgramStringEXT;
        /* 1384 */ PFNGLNAMEDPROGRAMLOCALPARAMETER4DEXTPROC NamedProgramLocalParameter4dEXT;
        /* 1385 */ PFNGLNAMEDPROGRAMLOCALPARAMETER4DVEXTPROC NamedProgramLocalParameter4dvEXT;
        /* 1386 */ PFNGLNAMEDPROGRAMLOCALPARAMETER4FEXTPROC NamedProgramLocalParameter4fEXT;
        /* 1387 */ PFNGLNAMEDPROGRAMLOCALPARAMETER4FVEXTPROC NamedProgramLocalParameter4fvEXT;
        /* 1388 */ PFNGLGETNAMEDPROGRAMLOCALPARAMETERDVEXTPROC GetNamedProgramLocalParameterdvEXT;
        /* 1389 */ PFNGLGETNAMEDPROGRAMLOCALPARAMETERFVEXTPROC GetNamedProgramLocalParameterfvEXT;
        /* 1390 */ PFNGLGETNAMEDPROGRAMIVEXTPROC GetNamedProgramivEXT;
        /* 1391 */ PFNGLGETNAMEDPROGRAMSTRINGEXTPROC GetNamedProgramStringEXT;
        /* 1392 */ PFNGLNAMEDRENDERBUFFERSTORAGEEXTPROC NamedRenderbufferStorageEXT;
        /* 1393 */ PFNGLGETNAMEDRENDERBUFFERPARAMETERIVEXTPROC GetNamedRenderbufferParameterivEXT;
        /* 1394 */ PFNGLNAMEDRENDERBUFFERSTORAGEMULTISAMPLEEXTPROC NamedRenderbufferStorageMultisampleEXT;
        /* 1395 */ PFNGLNAMEDRENDERBUFFERSTORAGEMULTISAMPLECOVERAGEEXTPROC NamedRenderbufferStorageMultisampleCoverageEXT;
        /* 1396 */ PFNGLCHECKNAMEDFRAMEBUFFERSTATUSEXTPROC CheckNamedFramebufferStatusEXT;
        /* 1397 */ PFNGLNAMEDFRAMEBUFFERTEXTURE1DEXTPROC NamedFramebufferTexture1DEXT;
        /* 1398 */ PFNGLNAMEDFRAMEBUFFERTEXTURE2DEXTPROC NamedFramebufferTexture2DEXT;
        /* 1399 */ PFNGLNAMEDFRAMEBUFFERTEXTURE3DEXTPROC NamedFramebufferTexture3DEXT;
        /* 1400 */ PFNGLNAMEDFRAMEBUFFERRENDERBUFFEREXTPROC NamedFramebufferRenderbufferEXT;
        /* 1401 */ PFNGLGETNAMEDFRAMEBUFFERATTACHMENTPARAMETERIVEXTPROC GetNamedFramebufferAttachmentParameterivEXT;
        /* 1402 */ PFNGLGENERATETEXTUREMIPMAPEXTPROC GenerateTextureMipmapEXT;
        /* 1403 */ PFNGLGENERATEMULTITEXMIPMAPEXTPROC GenerateMultiTexMipmapEXT;
        /* 1404 */ PFNGLFRAMEBUFFERDRAWBUFFEREXTPROC FramebufferDrawBufferEXT;
        /* 1405 */ PFNGLFRAMEBUFFERDRAWBUFFERSEXTPROC FramebufferDrawBuffersEXT;
        /* 1406 */ PFNGLFRAMEBUFFERREADBUFFEREXTPROC FramebufferReadBufferEXT;
        /* 1407 */ PFNGLGETFRAMEBUFFERPARAMETERIVEXTPROC GetFramebufferParameterivEXT;
        /* 1408 */ PFNGLNAMEDCOPYBUFFERSUBDATAEXTPROC NamedCopyBufferSubDataEXT;
        /* 1409 */ PFNGLNAMEDFRAMEBUFFERTEXTUREEXTPROC NamedFramebufferTextureEXT;
        /* 1410 */ PFNGLNAMEDFRAMEBUFFERTEXTURELAYEREXTPROC NamedFramebufferTextureLayerEXT;
        /* 1411 */ PFNGLNAMEDFRAMEBUFFERTEXTUREFACEEXTPROC NamedFramebufferTextureFaceEXT;
        /* 1412 */ PFNGLTEXTURERENDERBUFFEREXTPROC TextureRenderbufferEXT;
        /* 1413 */ PFNGLMULTITEXRENDERBUFFEREXTPROC MultiTexRenderbufferEXT;
        /* 1414 */ PFNGLVERTEXARRAYVERTEXOFFSETEXTPROC VertexArrayVertexOffsetEXT;
        /* 1415 */ PFNGLVERTEXARRAYCOLOROFFSETEXTPROC VertexArrayColorOffsetEXT;
        /* 1416 */ PFNGLVERTEXARRAYEDGEFLAGOFFSETEXTPROC VertexArrayEdgeFlagOffsetEXT;
        /* 1417 */ PFNGLVERTEXARRAYINDEXOFFSETEXTPROC VertexArrayIndexOffsetEXT;
        /* 1418 */ PFNGLVERTEXARRAYNORMALOFFSETEXTPROC VertexArrayNormalOffsetEXT;
        /* 1419 */ PFNGLVERTEXARRAYTEXCOORDOFFSETEXTPROC VertexArrayTexCoordOffsetEXT;
        /* 1420 */ PFNGLVERTEXARRAYMULTITEXCOORDOFFSETEXTPROC VertexArrayMultiTexCoordOffsetEXT;
        /* 1421 */ PFNGLVERTEXARRAYFOGCOORDOFFSETEXTPROC VertexArrayFogCoordOffsetEXT;
        /* 1422 */ PFNGLVERTEXARRAYSECONDARYCOLOROFFSETEXTPROC VertexArraySecondaryColorOffsetEXT;
        /* 1423 */ PFNGLVERTEXARRAYVERTEXATTRIBOFFSETEXTPROC VertexArrayVertexAttribOffsetEXT;
        /* 1424 */ PFNGLVERTEXARRAYVERTEXATTRIBIOFFSETEXTPROC VertexArrayVertexAttribIOffsetEXT;
        /* 1425 */ PFNGLENABLEVERTEXARRAYEXTPROC EnableVertexArrayEXT;
        /* 1426 */ PFNGLDISABLEVERTEXARRAYEXTPROC DisableVertexArrayEXT;
        /* 1427 */ PFNGLENABLEVERTEXARRAYATTRIBEXTPROC EnableVertexArrayAttribEXT;
        /* 1428 */ PFNGLDISABLEVERTEXARRAYATTRIBEXTPROC DisableVertexArrayAttribEXT;
        /* 1429 */ PFNGLGETVERTEXARRAYINTEGERVEXTPROC GetVertexArrayIntegervEXT;
        /* 1430 */ PFNGLGETVERTEXARRAYPOINTERVEXTPROC GetVertexArrayPointervEXT;
        /* 1431 */ PFNGLGETVERTEXARRAYINTEGERI_VEXTPROC GetVertexArrayIntegeri_vEXT;
        /* 1432 */ PFNGLGETVERTEXARRAYPOINTERI_VEXTPROC GetVertexArrayPointeri_vEXT;
        /* 1433 */ PFNGLMAPNAMEDBUFFERRANGEEXTPROC MapNamedBufferRangeEXT;
        /* 1434 */ PFNGLFLUSHMAPPEDNAMEDBUFFERRANGEEXTPROC FlushMappedNamedBufferRangeEXT;
        /* 1435 */ PFNGLNAMEDBUFFERSTORAGEEXTPROC NamedBufferStorageEXT;
        /* 1436 */ PFNGLCLEARNAMEDBUFFERDATAEXTPROC ClearNamedBufferDataEXT;
        /* 1437 */ PFNGLCLEARNAMEDBUFFERSUBDATAEXTPROC ClearNamedBufferSubDataEXT;
        /* 1438 */ PFNGLNAMEDFRAMEBUFFERPARAMETERIEXTPROC NamedFramebufferParameteriEXT;
        /* 1439 */ PFNGLGETNAMEDFRAMEBUFFERPARAMETERIVEXTPROC GetNamedFramebufferParameterivEXT;
        /* 1440 */ PFNGLPROGRAMUNIFORM1DEXTPROC ProgramUniform1dEXT;
        /* 1441 */ PFNGLPROGRAMUNIFORM2DEXTPROC ProgramUniform2dEXT;
        /* 1442 */ PFNGLPROGRAMUNIFORM3DEXTPROC ProgramUniform3dEXT;
        /* 1443 */ PFNGLPROGRAMUNIFORM4DEXTPROC ProgramUniform4dEXT;
        /* 1444 */ PFNGLPROGRAMUNIFORM1DVEXTPROC ProgramUniform1dvEXT;
        /* 1445 */ PFNGLPROGRAMUNIFORM2DVEXTPROC ProgramUniform2dvEXT;
        /* 1446 */ PFNGLPROGRAMUNIFORM3DVEXTPROC ProgramUniform3dvEXT;
        /* 1447 */ PFNGLPROGRAMUNIFORM4DVEXTPROC ProgramUniform4dvEXT;
        /* 1448 */ PFNGLPROGRAMUNIFORMMATRIX2DVEXTPROC ProgramUniformMatrix2dvEXT;
        /* 1449 */ PFNGLPROGRAMUNIFORMMATRIX3DVEXTPROC ProgramUniformMatrix3dvEXT;
        /* 1450 */ PFNGLPROGRAMUNIFORMMATRIX4DVEXTPROC ProgramUniformMatrix4dvEXT;
        /* 1451 */ PFNGLPROGRAMUNIFORMMATRIX2X3DVEXTPROC ProgramUniformMatrix2x3dvEXT;
        /* 1452 */ PFNGLPROGRAMUNIFORMMATRIX2X4DVEXTPROC ProgramUniformMatrix2x4dvEXT;
        /* 1453 */ PFNGLPROGRAMUNIFORMMATRIX3X2DVEXTPROC ProgramUniformMatrix3x2dvEXT;
        /* 1454 */ PFNGLPROGRAMUNIFORMMATRIX3X4DVEXTPROC ProgramUniformMatrix3x4dvEXT;
        /* 1455 */ PFNGLPROGRAMUNIFORMMATRIX4X2DVEXTPROC ProgramUniformMatrix4x2dvEXT;
        /* 1456 */ PFNGLPROGRAMUNIFORMMATRIX4X3DVEXTPROC ProgramUniformMatrix4x3dvEXT;
        /* 1457 */ PFNGLTEXTUREBUFFERRANGEEXTPROC TextureBufferRangeEXT;
        /* 1458 */ PFNGLTEXTURESTORAGE1DEXTPROC TextureStorage1DEXT;
        /* 1459 */ PFNGLTEXTURESTORAGE2DEXTPROC TextureStorage2DEXT;
        /* 1460 */ PFNGLTEXTURESTORAGE3DEXTPROC TextureStorage3DEXT;
        /* 1461 */ PFNGLTEXTURESTORAGE2DMULTISAMPLEEXTPROC TextureStorage2DMultisampleEXT;
        /* 1462 */ PFNGLTEXTURESTORAGE3DMULTISAMPLEEXTPROC TextureStorage3DMultisampleEXT;
        /* 1463 */ PFNGLVERTEXARRAYBINDVERTEXBUFFEREXTPROC VertexArrayBindVertexBufferEXT;
        /* 1464 */ PFNGLVERTEXARRAYVERTEXATTRIBFORMATEXTPROC VertexArrayVertexAttribFormatEXT;
        /* 1465 */ PFNGLVERTEXARRAYVERTEXATTRIBIFORMATEXTPROC VertexArrayVertexAttribIFormatEXT;
        /* 1466 */ PFNGLVERTEXARRAYVERTEXATTRIBLFORMATEXTPROC VertexArrayVertexAttribLFormatEXT;
        /* 1467 */ PFNGLVERTEXARRAYVERTEXATTRIBBINDINGEXTPROC VertexArrayVertexAttribBindingEXT;
        /* 1468 */ PFNGLVERTEXARRAYVERTEXBINDINGDIVISOREXTPROC VertexArrayVertexBindingDivisorEXT;
        /* 1469 */ PFNGLVERTEXARRAYVERTEXATTRIBLOFFSETEXTPROC VertexArrayVertexAttribLOffsetEXT;
        /* 1470 */ PFNGLTEXTUREPAGECOMMITMENTEXTPROC TexturePageCommitmentEXT;
        /* 1471 */ PFNGLVERTEXARRAYVERTEXATTRIBDIVISOREXTPROC VertexArrayVertexAttribDivisorEXT;
        /* 1472 */ PFNGLGETQUERYOBJECTI64VEXTPROC GetQueryObjecti64vEXT;
        /* 1473 */ PFNGLGETQUERYOBJECTUI64VEXTPROC GetQueryObjectui64vEXT;
        /* 1474 */ PFNGLCOLORMASKINDEXEDEXTPROC ColorMaskIndexedEXT;
        /* 1475 */ PFNGLDRAWARRAYSINSTANCEDEXTPROC DrawArraysInstancedEXT;
        /* 1476 */ PFNGLDRAWELEMENTSINSTANCEDEXTPROC DrawElementsInstancedEXT;
        /* 1477 */ PFNGLDRAWRANGEELEMENTSEXTPROC DrawRangeElementsEXT;
        /* 1478 */ PFNGLBUFFERSTORAGEEXTERNALEXTPROC BufferStorageExternalEXT;
        /* 1479 */ PFNGLNAMEDBUFFERSTORAGEEXTERNALEXTPROC NamedBufferStorageExternalEXT;
        /* 1480 */ PFNGLFOGCOORDFEXTPROC FogCoordfEXT;
        /* 1481 */ PFNGLFOGCOORDFVEXTPROC FogCoordfvEXT;
        /* 1482 */ PFNGLFOGCOORDDEXTPROC FogCoorddEXT;
        /* 1483 */ PFNGLFOGCOORDDVEXTPROC FogCoorddvEXT;
        /* 1484 */ PFNGLFOGCOORDPOINTEREXTPROC FogCoordPointerEXT;
        /* 1485 */ PFNGLBLITFRAMEBUFFEREXTPROC BlitFramebufferEXT;
        /* 1486 */ PFNGLBLITFRAMEBUFFERLAYERSEXTPROC BlitFramebufferLayersEXT;
        /* 1487 */ PFNGLBLITFRAMEBUFFERLAYEREXTPROC BlitFramebufferLayerEXT;
        /* 1488 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEEXTPROC RenderbufferStorageMultisampleEXT;
        /* 1489 */ PFNGLISRENDERBUFFEREXTPROC IsRenderbufferEXT;
        /* 1490 */ PFNGLBINDRENDERBUFFEREXTPROC BindRenderbufferEXT;
        /* 1491 */ PFNGLDELETERENDERBUFFERSEXTPROC DeleteRenderbuffersEXT;
        /* 1492 */ PFNGLGENRENDERBUFFERSEXTPROC GenRenderbuffersEXT;
        /* 1493 */ PFNGLRENDERBUFFERSTORAGEEXTPROC RenderbufferStorageEXT;
        /* 1494 */ PFNGLGETRENDERBUFFERPARAMETERIVEXTPROC GetRenderbufferParameterivEXT;
        /* 1495 */ PFNGLISFRAMEBUFFEREXTPROC IsFramebufferEXT;
        /* 1496 */ PFNGLBINDFRAMEBUFFEREXTPROC BindFramebufferEXT;
        /* 1497 */ PFNGLDELETEFRAMEBUFFERSEXTPROC DeleteFramebuffersEXT;
        /* 1498 */ PFNGLGENFRAMEBUFFERSEXTPROC GenFramebuffersEXT;
        /* 1499 */ PFNGLCHECKFRAMEBUFFERSTATUSEXTPROC CheckFramebufferStatusEXT;
        /* 1500 */ PFNGLFRAMEBUFFERTEXTURE1DEXTPROC FramebufferTexture1DEXT;
        /* 1501 */ PFNGLFRAMEBUFFERTEXTURE2DEXTPROC FramebufferTexture2DEXT;
        /* 1502 */ PFNGLFRAMEBUFFERTEXTURE3DEXTPROC FramebufferTexture3DEXT;
        /* 1503 */ PFNGLFRAMEBUFFERRENDERBUFFEREXTPROC FramebufferRenderbufferEXT;
        /* 1504 */ PFNGLGETFRAMEBUFFERATTACHMENTPARAMETERIVEXTPROC GetFramebufferAttachmentParameterivEXT;
        /* 1505 */ PFNGLGENERATEMIPMAPEXTPROC GenerateMipmapEXT;
        /* 1506 */ PFNGLFRAMEBUFFERTEXTUREEXTPROC FramebufferTextureEXT;
        /* 1507 */ PFNGLPROGRAMPARAMETERIEXTPROC ProgramParameteriEXT;
        /* 1508 */ PFNGLPROGRAMENVPARAMETERS4FVEXTPROC ProgramEnvParameters4fvEXT;
        /* 1509 */ PFNGLPROGRAMLOCALPARAMETERS4FVEXTPROC ProgramLocalParameters4fvEXT;
        /* 1510 */ PFNGLGETUNIFORMUIVEXTPROC GetUniformuivEXT;
        /* 1511 */ PFNGLGETFRAGDATALOCATIONEXTPROC GetFragDataLocationEXT;
        /* 1512 */ PFNGLUNIFORM1UIEXTPROC Uniform1uiEXT;
        /* 1513 */ PFNGLUNIFORM2UIEXTPROC Uniform2uiEXT;
        /* 1514 */ PFNGLUNIFORM3UIEXTPROC Uniform3uiEXT;
        /* 1515 */ PFNGLUNIFORM4UIEXTPROC Uniform4uiEXT;
        /* 1516 */ PFNGLUNIFORM1UIVEXTPROC Uniform1uivEXT;
        /* 1517 */ PFNGLUNIFORM2UIVEXTPROC Uniform2uivEXT;
        /* 1518 */ PFNGLUNIFORM3UIVEXTPROC Uniform3uivEXT;
        /* 1519 */ PFNGLUNIFORM4UIVEXTPROC Uniform4uivEXT;
        /* 1520 */ PFNGLVERTEXATTRIBI1IEXTPROC VertexAttribI1iEXT;
        /* 1521 */ PFNGLVERTEXATTRIBI2IEXTPROC VertexAttribI2iEXT;
        /* 1522 */ PFNGLVERTEXATTRIBI3IEXTPROC VertexAttribI3iEXT;
        /* 1523 */ PFNGLVERTEXATTRIBI4IEXTPROC VertexAttribI4iEXT;
        /* 1524 */ PFNGLVERTEXATTRIBI1UIEXTPROC VertexAttribI1uiEXT;
        /* 1525 */ PFNGLVERTEXATTRIBI2UIEXTPROC VertexAttribI2uiEXT;
        /* 1526 */ PFNGLVERTEXATTRIBI3UIEXTPROC VertexAttribI3uiEXT;
        /* 1527 */ PFNGLVERTEXATTRIBI4UIEXTPROC VertexAttribI4uiEXT;
        /* 1528 */ PFNGLVERTEXATTRIBI1IVEXTPROC VertexAttribI1ivEXT;
        /* 1529 */ PFNGLVERTEXATTRIBI2IVEXTPROC VertexAttribI2ivEXT;
        /* 1530 */ PFNGLVERTEXATTRIBI3IVEXTPROC VertexAttribI3ivEXT;
        /* 1531 */ PFNGLVERTEXATTRIBI4IVEXTPROC VertexAttribI4ivEXT;
        /* 1532 */ PFNGLVERTEXATTRIBI1UIVEXTPROC VertexAttribI1uivEXT;
        /* 1533 */ PFNGLVERTEXATTRIBI2UIVEXTPROC VertexAttribI2uivEXT;
        /* 1534 */ PFNGLVERTEXATTRIBI3UIVEXTPROC VertexAttribI3uivEXT;
        /* 1535 */ PFNGLVERTEXATTRIBI4UIVEXTPROC VertexAttribI4uivEXT;
        /* 1536 */ PFNGLVERTEXATTRIBI4BVEXTPROC VertexAttribI4bvEXT;
        /* 1537 */ PFNGLVERTEXATTRIBI4SVEXTPROC VertexAttribI4svEXT;
        /* 1538 */ PFNGLVERTEXATTRIBI4UBVEXTPROC VertexAttribI4ubvEXT;
        /* 1539 */ PFNGLVERTEXATTRIBI4USVEXTPROC VertexAttribI4usvEXT;
        /* 1540 */ PFNGLVERTEXATTRIBIPOINTEREXTPROC VertexAttribIPointerEXT;
        /* 1541 */ PFNGLGETVERTEXATTRIBIIVEXTPROC GetVertexAttribIivEXT;
        /* 1542 */ PFNGLGETVERTEXATTRIBIUIVEXTPROC GetVertexAttribIuivEXT;
        /* 1543 */ PFNGLGETHISTOGRAMEXTPROC GetHistogramEXT;
        /* 1544 */ PFNGLGETHISTOGRAMPARAMETERFVEXTPROC GetHistogramParameterfvEXT;
        /* 1545 */ PFNGLGETHISTOGRAMPARAMETERIVEXTPROC GetHistogramParameterivEXT;
        /* 1546 */ PFNGLGETMINMAXEXTPROC GetMinmaxEXT;
        /* 1547 */ PFNGLGETMINMAXPARAMETERFVEXTPROC GetMinmaxParameterfvEXT;
        /* 1548 */ PFNGLGETMINMAXPARAMETERIVEXTPROC GetMinmaxParameterivEXT;
        /* 1549 */ PFNGLHISTOGRAMEXTPROC HistogramEXT;
        /* 1550 */ PFNGLMINMAXEXTPROC MinmaxEXT;
        /* 1551 */ PFNGLRESETHISTOGRAMEXTPROC ResetHistogramEXT;
        /* 1552 */ PFNGLRESETMINMAXEXTPROC ResetMinmaxEXT;
        /* 1553 */ PFNGLINDEXFUNCEXTPROC IndexFuncEXT;
        /* 1554 */ PFNGLINDEXMATERIALEXTPROC IndexMaterialEXT;
        /* 1555 */ PFNGLAPPLYTEXTUREEXTPROC ApplyTextureEXT;
        /* 1556 */ PFNGLTEXTURELIGHTEXTPROC TextureLightEXT;
        /* 1557 */ PFNGLTEXTUREMATERIALEXTPROC TextureMaterialEXT;
        /* 1558 */ PFNGLGETUNSIGNEDBYTEVEXTPROC GetUnsignedBytevEXT;
        /* 1559 */ PFNGLGETUNSIGNEDBYTEI_VEXTPROC GetUnsignedBytei_vEXT;
        /* 1560 */ PFNGLDELETEMEMORYOBJECTSEXTPROC DeleteMemoryObjectsEXT;
        /* 1561 */ PFNGLISMEMORYOBJECTEXTPROC IsMemoryObjectEXT;
        /* 1562 */ PFNGLCREATEMEMORYOBJECTSEXTPROC CreateMemoryObjectsEXT;
        /* 1563 */ PFNGLMEMORYOBJECTPARAMETERIVEXTPROC MemoryObjectParameterivEXT;
        /* 1564 */ PFNGLGETMEMORYOBJECTPARAMETERIVEXTPROC GetMemoryObjectParameterivEXT;
        /* 1565 */ PFNGLTEXSTORAGEMEM2DEXTPROC TexStorageMem2DEXT;
        /* 1566 */ PFNGLTEXSTORAGEMEM2DMULTISAMPLEEXTPROC TexStorageMem2DMultisampleEXT;
        /* 1567 */ PFNGLTEXSTORAGEMEM3DEXTPROC TexStorageMem3DEXT;
        /* 1568 */ PFNGLTEXSTORAGEMEM3DMULTISAMPLEEXTPROC TexStorageMem3DMultisampleEXT;
        /* 1569 */ PFNGLBUFFERSTORAGEMEMEXTPROC BufferStorageMemEXT;
        /* 1570 */ PFNGLTEXTURESTORAGEMEM2DEXTPROC TextureStorageMem2DEXT;
        /* 1571 */ PFNGLTEXTURESTORAGEMEM2DMULTISAMPLEEXTPROC TextureStorageMem2DMultisampleEXT;
        /* 1572 */ PFNGLTEXTURESTORAGEMEM3DEXTPROC TextureStorageMem3DEXT;
        /* 1573 */ PFNGLTEXTURESTORAGEMEM3DMULTISAMPLEEXTPROC TextureStorageMem3DMultisampleEXT;
        /* 1574 */ PFNGLNAMEDBUFFERSTORAGEMEMEXTPROC NamedBufferStorageMemEXT;
        /* 1575 */ PFNGLTEXSTORAGEMEM1DEXTPROC TexStorageMem1DEXT;
        /* 1576 */ PFNGLTEXTURESTORAGEMEM1DEXTPROC TextureStorageMem1DEXT;
        /* 1577 */ PFNGLIMPORTMEMORYFDEXTPROC ImportMemoryFdEXT;
        /* 1578 */ PFNGLIMPORTMEMORYWIN32HANDLEEXTPROC ImportMemoryWin32HandleEXT;
        /* 1579 */ PFNGLIMPORTMEMORYWIN32NAMEEXTPROC ImportMemoryWin32NameEXT;
        /* 1580 */ PFNGLMULTIDRAWARRAYSEXTPROC MultiDrawArraysEXT;
        /* 1581 */ PFNGLMULTIDRAWELEMENTSEXTPROC MultiDrawElementsEXT;
        /* 1582 */ PFNGLSAMPLEMASKEXTPROC SampleMaskEXT;
        /* 1583 */ PFNGLSAMPLEPATTERNEXTPROC SamplePatternEXT;
        /* 1584 */ PFNGLCOLORTABLEEXTPROC ColorTableEXT;
        /* 1585 */ PFNGLGETCOLORTABLEEXTPROC GetColorTableEXT;
        /* 1586 */ PFNGLGETCOLORTABLEPARAMETERIVEXTPROC GetColorTableParameterivEXT;
        /* 1587 */ PFNGLGETCOLORTABLEPARAMETERFVEXTPROC GetColorTableParameterfvEXT;
        /* 1588 */ PFNGLPIXELTRANSFORMPARAMETERIEXTPROC PixelTransformParameteriEXT;
        /* 1589 */ PFNGLPIXELTRANSFORMPARAMETERFEXTPROC PixelTransformParameterfEXT;
        /* 1590 */ PFNGLPIXELTRANSFORMPARAMETERIVEXTPROC PixelTransformParameterivEXT;
        /* 1591 */ PFNGLPIXELTRANSFORMPARAMETERFVEXTPROC PixelTransformParameterfvEXT;
        /* 1592 */ PFNGLGETPIXELTRANSFORMPARAMETERIVEXTPROC GetPixelTransformParameterivEXT;
        /* 1593 */ PFNGLGETPIXELTRANSFORMPARAMETERFVEXTPROC GetPixelTransformParameterfvEXT;
        /* 1594 */ PFNGLPOINTPARAMETERFEXTPROC PointParameterfEXT;
        /* 1595 */ PFNGLPOINTPARAMETERFVEXTPROC PointParameterfvEXT;
        /* 1596 */ PFNGLPOLYGONOFFSETEXTPROC PolygonOffsetEXT;
        /* 1597 */ PFNGLPOLYGONOFFSETCLAMPEXTPROC PolygonOffsetClampEXT;
        /* 1598 */ PFNGLPROVOKINGVERTEXEXTPROC ProvokingVertexEXT;
        /* 1599 */ PFNGLRASTERSAMPLESEXTPROC RasterSamplesEXT;
        /* 1600 */ PFNGLGENSEMAPHORESEXTPROC GenSemaphoresEXT;
        /* 1601 */ PFNGLDELETESEMAPHORESEXTPROC DeleteSemaphoresEXT;
        /* 1602 */ PFNGLISSEMAPHOREEXTPROC IsSemaphoreEXT;
        /* 1603 */ PFNGLSEMAPHOREPARAMETERUI64VEXTPROC SemaphoreParameterui64vEXT;
        /* 1604 */ PFNGLGETSEMAPHOREPARAMETERUI64VEXTPROC GetSemaphoreParameterui64vEXT;
        /* 1605 */ PFNGLWAITSEMAPHOREEXTPROC WaitSemaphoreEXT;
        /* 1606 */ PFNGLSIGNALSEMAPHOREEXTPROC SignalSemaphoreEXT;
        /* 1607 */ PFNGLIMPORTSEMAPHOREFDEXTPROC ImportSemaphoreFdEXT;
        /* 1608 */ PFNGLIMPORTSEMAPHOREWIN32HANDLEEXTPROC ImportSemaphoreWin32HandleEXT;
        /* 1609 */ PFNGLIMPORTSEMAPHOREWIN32NAMEEXTPROC ImportSemaphoreWin32NameEXT;
        /* 1610 */ PFNGLSECONDARYCOLOR3BEXTPROC SecondaryColor3bEXT;
        /* 1611 */ PFNGLSECONDARYCOLOR3BVEXTPROC SecondaryColor3bvEXT;
        /* 1612 */ PFNGLSECONDARYCOLOR3DEXTPROC SecondaryColor3dEXT;
        /* 1613 */ PFNGLSECONDARYCOLOR3DVEXTPROC SecondaryColor3dvEXT;
        /* 1614 */ PFNGLSECONDARYCOLOR3FEXTPROC SecondaryColor3fEXT;
        /* 1615 */ PFNGLSECONDARYCOLOR3FVEXTPROC SecondaryColor3fvEXT;
        /* 1616 */ PFNGLSECONDARYCOLOR3IEXTPROC SecondaryColor3iEXT;
        /* 1617 */ PFNGLSECONDARYCOLOR3IVEXTPROC SecondaryColor3ivEXT;
        /* 1618 */ PFNGLSECONDARYCOLOR3SEXTPROC SecondaryColor3sEXT;
        /* 1619 */ PFNGLSECONDARYCOLOR3SVEXTPROC SecondaryColor3svEXT;
        /* 1620 */ PFNGLSECONDARYCOLOR3UBEXTPROC SecondaryColor3ubEXT;
        /* 1621 */ PFNGLSECONDARYCOLOR3UBVEXTPROC SecondaryColor3ubvEXT;
        /* 1622 */ PFNGLSECONDARYCOLOR3UIEXTPROC SecondaryColor3uiEXT;
        /* 1623 */ PFNGLSECONDARYCOLOR3UIVEXTPROC SecondaryColor3uivEXT;
        /* 1624 */ PFNGLSECONDARYCOLOR3USEXTPROC SecondaryColor3usEXT;
        /* 1625 */ PFNGLSECONDARYCOLOR3USVEXTPROC SecondaryColor3usvEXT;
        /* 1626 */ PFNGLSECONDARYCOLORPOINTEREXTPROC SecondaryColorPointerEXT;
        /* 1627 */ PFNGLUSESHADERPROGRAMEXTPROC UseShaderProgramEXT;
        /* 1628 */ PFNGLACTIVEPROGRAMEXTPROC ActiveProgramEXT;
        /* 1629 */ PFNGLCREATESHADERPROGRAMEXTPROC CreateShaderProgramEXT;
        /* 1630 */ PFNGLFRAMEBUFFERFETCHBARRIEREXTPROC FramebufferFetchBarrierEXT;
        /* 1631 */ PFNGLBINDIMAGETEXTUREEXTPROC BindImageTextureEXT;
        /* 1632 */ PFNGLMEMORYBARRIEREXTPROC MemoryBarrierEXT;
        /* 1633 */ PFNGLSTENCILCLEARTAGEXTPROC StencilClearTagEXT;
        /* 1634 */ PFNGLACTIVESTENCILFACEEXTPROC ActiveStencilFaceEXT;
        /* 1635 */ PFNGLTEXSUBIMAGE1DEXTPROC TexSubImage1DEXT;
        /* 1636 */ PFNGLTEXSUBIMAGE2DEXTPROC TexSubImage2DEXT;
        /* 1637 */ PFNGLTEXIMAGE3DEXTPROC TexImage3DEXT;
        /* 1638 */ PFNGLTEXSUBIMAGE3DEXTPROC TexSubImage3DEXT;
        /* 1639 */ PFNGLFRAMEBUFFERTEXTURELAYEREXTPROC FramebufferTextureLayerEXT;
        /* 1640 */ PFNGLTEXPARAMETERIIVEXTPROC TexParameterIivEXT;
        /* 1641 */ PFNGLTEXPARAMETERIUIVEXTPROC TexParameterIuivEXT;
        /* 1642 */ PFNGLGETTEXPARAMETERIIVEXTPROC GetTexParameterIivEXT;
        /* 1643 */ PFNGLGETTEXPARAMETERIUIVEXTPROC GetTexParameterIuivEXT;
        /* 1644 */ PFNGLTEXBUFFEREXTPROC TexBufferEXT;
        /* 1645 */ PFNGLCLEARCOLORIIEXTPROC ClearColorIiEXT;
        /* 1646 */ PFNGLCLEARCOLORIUIEXTPROC ClearColorIuiEXT;
        /* 1647 */ PFNGLARETEXTURESRESIDENTEXTPROC AreTexturesResidentEXT;
        /* 1648 */ PFNGLBINDTEXTUREEXTPROC BindTextureEXT;
        /* 1649 */ PFNGLDELETETEXTURESEXTPROC DeleteTexturesEXT;
        /* 1650 */ PFNGLGENTEXTURESEXTPROC GenTexturesEXT;
        /* 1651 */ PFNGLISTEXTUREEXTPROC IsTextureEXT;
        /* 1652 */ PFNGLPRIORITIZETEXTURESEXTPROC PrioritizeTexturesEXT;
        /* 1653 */ PFNGLTEXTURENORMALEXTPROC TextureNormalEXT;
        /* 1654 */ PFNGLTEXSTORAGE1DEXTPROC TexStorage1DEXT;
        /* 1655 */ PFNGLTEXSTORAGE2DEXTPROC TexStorage2DEXT;
        /* 1656 */ PFNGLTEXSTORAGE3DEXTPROC TexStorage3DEXT;
        /* 1657 */ PFNGLCREATESEMAPHORESNVPROC CreateSemaphoresNV;
        /* 1658 */ PFNGLSEMAPHOREPARAMETERIVNVPROC SemaphoreParameterivNV;
        /* 1659 */ PFNGLGETSEMAPHOREPARAMETERIVNVPROC GetSemaphoreParameterivNV;
        /* 1660 */ PFNGLBEGINTRANSFORMFEEDBACKEXTPROC BeginTransformFeedbackEXT;
        /* 1661 */ PFNGLENDTRANSFORMFEEDBACKEXTPROC EndTransformFeedbackEXT;
        /* 1662 */ PFNGLBINDBUFFERRANGEEXTPROC BindBufferRangeEXT;
        /* 1663 */ PFNGLBINDBUFFEROFFSETEXTPROC BindBufferOffsetEXT;
        /* 1664 */ PFNGLBINDBUFFERBASEEXTPROC BindBufferBaseEXT;
        /* 1665 */ PFNGLTRANSFORMFEEDBACKVARYINGSEXTPROC TransformFeedbackVaryingsEXT;
        /* 1666 */ PFNGLGETTRANSFORMFEEDBACKVARYINGEXTPROC GetTransformFeedbackVaryingEXT;
        /* 1667 */ PFNGLARRAYELEMENTEXTPROC ArrayElementEXT;
        /* 1668 */ PFNGLCOLORPOINTEREXTPROC ColorPointerEXT;
        /* 1669 */ PFNGLDRAWARRAYSEXTPROC DrawArraysEXT;
        /* 1670 */ PFNGLEDGEFLAGPOINTEREXTPROC EdgeFlagPointerEXT;
        /* 1671 */ PFNGLGETPOINTERVEXTPROC GetPointervEXT;
        /* 1672 */ PFNGLINDEXPOINTEREXTPROC IndexPointerEXT;
        /* 1673 */ PFNGLNORMALPOINTEREXTPROC NormalPointerEXT;
        /* 1674 */ PFNGLTEXCOORDPOINTEREXTPROC TexCoordPointerEXT;
        /* 1675 */ PFNGLVERTEXPOINTEREXTPROC VertexPointerEXT;
        /* 1676 */ PFNGLVERTEXATTRIBL1DEXTPROC VertexAttribL1dEXT;
        /* 1677 */ PFNGLVERTEXATTRIBL2DEXTPROC VertexAttribL2dEXT;
        /* 1678 */ PFNGLVERTEXATTRIBL3DEXTPROC VertexAttribL3dEXT;
        /* 1679 */ PFNGLVERTEXATTRIBL4DEXTPROC VertexAttribL4dEXT;
        /* 1680 */ PFNGLVERTEXATTRIBL1DVEXTPROC VertexAttribL1dvEXT;
        /* 1681 */ PFNGLVERTEXATTRIBL2DVEXTPROC VertexAttribL2dvEXT;
        /* 1682 */ PFNGLVERTEXATTRIBL3DVEXTPROC VertexAttribL3dvEXT;
        /* 1683 */ PFNGLVERTEXATTRIBL4DVEXTPROC VertexAttribL4dvEXT;
        /* 1684 */ PFNGLVERTEXATTRIBLPOINTEREXTPROC VertexAttribLPointerEXT;
        /* 1685 */ PFNGLGETVERTEXATTRIBLDVEXTPROC GetVertexAttribLdvEXT;
        /* 1686 */ PFNGLBEGINVERTEXSHADEREXTPROC BeginVertexShaderEXT;
        /* 1687 */ PFNGLENDVERTEXSHADEREXTPROC EndVertexShaderEXT;
        /* 1688 */ PFNGLBINDVERTEXSHADEREXTPROC BindVertexShaderEXT;
        /* 1689 */ PFNGLGENVERTEXSHADERSEXTPROC GenVertexShadersEXT;
        /* 1690 */ PFNGLDELETEVERTEXSHADEREXTPROC DeleteVertexShaderEXT;
        /* 1691 */ PFNGLSHADEROP1EXTPROC ShaderOp1EXT;
        /* 1692 */ PFNGLSHADEROP2EXTPROC ShaderOp2EXT;
        /* 1693 */ PFNGLSHADEROP3EXTPROC ShaderOp3EXT;
        /* 1694 */ PFNGLSWIZZLEEXTPROC SwizzleEXT;
        /* 1695 */ PFNGLWRITEMASKEXTPROC WriteMaskEXT;
        /* 1696 */ PFNGLINSERTCOMPONENTEXTPROC InsertComponentEXT;
        /* 1697 */ PFNGLEXTRACTCOMPONENTEXTPROC ExtractComponentEXT;
        /* 1698 */ PFNGLGENSYMBOLSEXTPROC GenSymbolsEXT;
        /* 1699 */ PFNGLSETINVARIANTEXTPROC SetInvariantEXT;
        /* 1700 */ PFNGLSETLOCALCONSTANTEXTPROC SetLocalConstantEXT;
        /* 1701 */ PFNGLVARIANTBVEXTPROC VariantbvEXT;
        /* 1702 */ PFNGLVARIANTSVEXTPROC VariantsvEXT;
        /* 1703 */ PFNGLVARIANTIVEXTPROC VariantivEXT;
        /* 1704 */ PFNGLVARIANTFVEXTPROC VariantfvEXT;
        /* 1705 */ PFNGLVARIANTDVEXTPROC VariantdvEXT;
        /* 1706 */ PFNGLVARIANTUBVEXTPROC VariantubvEXT;
        /* 1707 */ PFNGLVARIANTUSVEXTPROC VariantusvEXT;
        /* 1708 */ PFNGLVARIANTUIVEXTPROC VariantuivEXT;
        /* 1709 */ PFNGLVARIANTPOINTEREXTPROC VariantPointerEXT;
        /* 1710 */ PFNGLENABLEVARIANTCLIENTSTATEEXTPROC EnableVariantClientStateEXT;
        /* 1711 */ PFNGLDISABLEVARIANTCLIENTSTATEEXTPROC DisableVariantClientStateEXT;
        /* 1712 */ PFNGLBINDLIGHTPARAMETEREXTPROC BindLightParameterEXT;
        /* 1713 */ PFNGLBINDMATERIALPARAMETEREXTPROC BindMaterialParameterEXT;
        /* 1714 */ PFNGLBINDTEXGENPARAMETEREXTPROC BindTexGenParameterEXT;
        /* 1715 */ PFNGLBINDTEXTUREUNITPARAMETEREXTPROC BindTextureUnitParameterEXT;
        /* 1716 */ PFNGLBINDPARAMETEREXTPROC BindParameterEXT;
        /* 1717 */ PFNGLISVARIANTENABLEDEXTPROC IsVariantEnabledEXT;
        /* 1718 */ PFNGLGETVARIANTBOOLEANVEXTPROC GetVariantBooleanvEXT;
        /* 1719 */ PFNGLGETVARIANTINTEGERVEXTPROC GetVariantIntegervEXT;
        /* 1720 */ PFNGLGETVARIANTFLOATVEXTPROC GetVariantFloatvEXT;
        /* 1721 */ PFNGLGETVARIANTPOINTERVEXTPROC GetVariantPointervEXT;
        /* 1722 */ PFNGLGETINVARIANTBOOLEANVEXTPROC GetInvariantBooleanvEXT;
        /* 1723 */ PFNGLGETINVARIANTINTEGERVEXTPROC GetInvariantIntegervEXT;
        /* 1724 */ PFNGLGETINVARIANTFLOATVEXTPROC GetInvariantFloatvEXT;
        /* 1725 */ PFNGLGETLOCALCONSTANTBOOLEANVEXTPROC GetLocalConstantBooleanvEXT;
        /* 1726 */ PFNGLGETLOCALCONSTANTINTEGERVEXTPROC GetLocalConstantIntegervEXT;
        /* 1727 */ PFNGLGETLOCALCONSTANTFLOATVEXTPROC GetLocalConstantFloatvEXT;
        /* 1728 */ PFNGLVERTEXWEIGHTFEXTPROC VertexWeightfEXT;
        /* 1729 */ PFNGLVERTEXWEIGHTFVEXTPROC VertexWeightfvEXT;
        /* 1730 */ PFNGLVERTEXWEIGHTPOINTEREXTPROC VertexWeightPointerEXT;
        /* 1731 */ PFNGLACQUIREKEYEDMUTEXWIN32EXTPROC AcquireKeyedMutexWin32EXT;
        /* 1732 */ PFNGLRELEASEKEYEDMUTEXWIN32EXTPROC ReleaseKeyedMutexWin32EXT;
        /* 1733 */ PFNGLWINDOWRECTANGLESEXTPROC WindowRectanglesEXT;
        /* 1734 */ PFNGLIMPORTSYNCEXTPROC ImportSyncEXT;
        /* 1735 */ PFNGLFRAMETERMINATORGREMEDYPROC FrameTerminatorGREMEDY;
        /* 1736 */ PFNGLSTRINGMARKERGREMEDYPROC StringMarkerGREMEDY;
        /* 1737 */ PFNGLIMAGETRANSFORMPARAMETERIHPPROC ImageTransformParameteriHP;
        /* 1738 */ PFNGLIMAGETRANSFORMPARAMETERFHPPROC ImageTransformParameterfHP;
        /* 1739 */ PFNGLIMAGETRANSFORMPARAMETERIVHPPROC ImageTransformParameterivHP;
        /* 1740 */ PFNGLIMAGETRANSFORMPARAMETERFVHPPROC ImageTransformParameterfvHP;
        /* 1741 */ PFNGLGETIMAGETRANSFORMPARAMETERIVHPPROC GetImageTransformParameterivHP;
        /* 1742 */ PFNGLGETIMAGETRANSFORMPARAMETERFVHPPROC GetImageTransformParameterfvHP;
        /* 1743 */ PFNGLMULTIMODEDRAWARRAYSIBMPROC MultiModeDrawArraysIBM;
        /* 1744 */ PFNGLMULTIMODEDRAWELEMENTSIBMPROC MultiModeDrawElementsIBM;
        /* 1745 */ PFNGLFLUSHSTATICDATAIBMPROC FlushStaticDataIBM;
        /* 1746 */ PFNGLCOLORPOINTERLISTIBMPROC ColorPointerListIBM;
        /* 1747 */ PFNGLSECONDARYCOLORPOINTERLISTIBMPROC SecondaryColorPointerListIBM;
        /* 1748 */ PFNGLEDGEFLAGPOINTERLISTIBMPROC EdgeFlagPointerListIBM;
        /* 1749 */ PFNGLFOGCOORDPOINTERLISTIBMPROC FogCoordPointerListIBM;
        /* 1750 */ PFNGLINDEXPOINTERLISTIBMPROC IndexPointerListIBM;
        /* 1751 */ PFNGLNORMALPOINTERLISTIBMPROC NormalPointerListIBM;
        /* 1752 */ PFNGLTEXCOORDPOINTERLISTIBMPROC TexCoordPointerListIBM;
        /* 1753 */ PFNGLVERTEXPOINTERLISTIBMPROC VertexPointerListIBM;
        /* 1754 */ PFNGLBLENDFUNCSEPARATEINGRPROC BlendFuncSeparateINGR;
        /* 1755 */ PFNGLAPPLYFRAMEBUFFERATTACHMENTCMAAINTELPROC ApplyFramebufferAttachmentCMAAINTEL;
        /* 1756 */ PFNGLSYNCTEXTUREINTELPROC SyncTextureINTEL;
        /* 1757 */ PFNGLUNMAPTEXTURE2DINTELPROC UnmapTexture2DINTEL;
        /* 1758 */ PFNGLMAPTEXTURE2DINTELPROC MapTexture2DINTEL;
        /* 1759 */ PFNGLVERTEXPOINTERVINTELPROC VertexPointervINTEL;
        /* 1760 */ PFNGLNORMALPOINTERVINTELPROC NormalPointervINTEL;
        /* 1761 */ PFNGLCOLORPOINTERVINTELPROC ColorPointervINTEL;
        /* 1762 */ PFNGLTEXCOORDPOINTERVINTELPROC TexCoordPointervINTEL;
        /* 1763 */ PFNGLBEGINPERFQUERYINTELPROC BeginPerfQueryINTEL;
        /* 1764 */ PFNGLCREATEPERFQUERYINTELPROC CreatePerfQueryINTEL;
        /* 1765 */ PFNGLDELETEPERFQUERYINTELPROC DeletePerfQueryINTEL;
        /* 1766 */ PFNGLENDPERFQUERYINTELPROC EndPerfQueryINTEL;
        /* 1767 */ PFNGLGETFIRSTPERFQUERYIDINTELPROC GetFirstPerfQueryIdINTEL;
        /* 1768 */ PFNGLGETNEXTPERFQUERYIDINTELPROC GetNextPerfQueryIdINTEL;
        /* 1769 */ PFNGLGETPERFCOUNTERINFOINTELPROC GetPerfCounterInfoINTEL;
        /* 1770 */ PFNGLGETPERFQUERYDATAINTELPROC GetPerfQueryDataINTEL;
        /* 1771 */ PFNGLGETPERFQUERYIDBYNAMEINTELPROC GetPerfQueryIdByNameINTEL;
        /* 1772 */ PFNGLGETPERFQUERYINFOINTELPROC GetPerfQueryInfoINTEL;
        /* 1773 */ PFNGLBLENDBARRIERKHRPROC BlendBarrierKHR;
        /* 1774 */ PFNGLMAXSHADERCOMPILERTHREADSKHRPROC MaxShaderCompilerThreadsKHR;
        /* 1775 */ PFNGLFRAMEBUFFERPARAMETERIMESAPROC FramebufferParameteriMESA;
        /* 1776 */ PFNGLGETFRAMEBUFFERPARAMETERIVMESAPROC GetFramebufferParameterivMESA;
        /* 1777 */ PFNGLRESIZEBUFFERSMESAPROC ResizeBuffersMESA;
        /* 1778 */ PFNGLWINDOWPOS2DMESAPROC WindowPos2dMESA;
        /* 1779 */ PFNGLWINDOWPOS2DVMESAPROC WindowPos2dvMESA;
        /* 1780 */ PFNGLWINDOWPOS2FMESAPROC WindowPos2fMESA;
        /* 1781 */ PFNGLWINDOWPOS2FVMESAPROC WindowPos2fvMESA;
        /* 1782 */ PFNGLWINDOWPOS2IMESAPROC WindowPos2iMESA;
        /* 1783 */ PFNGLWINDOWPOS2IVMESAPROC WindowPos2ivMESA;
        /* 1784 */ PFNGLWINDOWPOS2SMESAPROC WindowPos2sMESA;
        /* 1785 */ PFNGLWINDOWPOS2SVMESAPROC WindowPos2svMESA;
        /* 1786 */ PFNGLWINDOWPOS3DMESAPROC WindowPos3dMESA;
        /* 1787 */ PFNGLWINDOWPOS3DVMESAPROC WindowPos3dvMESA;
        /* 1788 */ PFNGLWINDOWPOS3FMESAPROC WindowPos3fMESA;
        /* 1789 */ PFNGLWINDOWPOS3FVMESAPROC WindowPos3fvMESA;
        /* 1790 */ PFNGLWINDOWPOS3IMESAPROC WindowPos3iMESA;
        /* 1791 */ PFNGLWINDOWPOS3IVMESAPROC WindowPos3ivMESA;
        /* 1792 */ PFNGLWINDOWPOS3SMESAPROC WindowPos3sMESA;
        /* 1793 */ PFNGLWINDOWPOS3SVMESAPROC WindowPos3svMESA;
        /* 1794 */ PFNGLWINDOWPOS4DMESAPROC WindowPos4dMESA;
        /* 1795 */ PFNGLWINDOWPOS4DVMESAPROC WindowPos4dvMESA;
        /* 1796 */ PFNGLWINDOWPOS4FMESAPROC WindowPos4fMESA;
        /* 1797 */ PFNGLWINDOWPOS4FVMESAPROC WindowPos4fvMESA;
        /* 1798 */ PFNGLWINDOWPOS4IMESAPROC WindowPos4iMESA;
        /* 1799 */ PFNGLWINDOWPOS4IVMESAPROC WindowPos4ivMESA;
        /* 1800 */ PFNGLWINDOWPOS4SMESAPROC WindowPos4sMESA;
        /* 1801 */ PFNGLWINDOWPOS4SVMESAPROC WindowPos4svMESA;
        /* 1802 */ PFNGLBEGINCONDITIONALRENDERNVXPROC BeginConditionalRenderNVX;
        /* 1803 */ PFNGLENDCONDITIONALRENDERNVXPROC EndConditionalRenderNVX;
        /* 1804 */ PFNGLLGPUNAMEDBUFFERSUBDATANVXPROC LGPUNamedBufferSubDataNVX;
        /* 1805 */ PFNGLLGPUCOPYIMAGESUBDATANVXPROC LGPUCopyImageSubDataNVX;
        /* 1806 */ PFNGLLGPUINTERLOCKNVXPROC LGPUInterlockNVX;
        /* 1807 */ PFNGLALPHATOCOVERAGEDITHERCONTROLNVPROC AlphaToCoverageDitherControlNV;
        /* 1808 */ PFNGLMULTIDRAWARRAYSINDIRECTBINDLESSNVPROC MultiDrawArraysIndirectBindlessNV;
        /* 1809 */ PFNGLMULTIDRAWELEMENTSINDIRECTBINDLESSNVPROC MultiDrawElementsIndirectBindlessNV;
        /* 1810 */ PFNGLMULTIDRAWARRAYSINDIRECTBINDLESSCOUNTNVPROC MultiDrawArraysIndirectBindlessCountNV;
        /* 1811 */ PFNGLMULTIDRAWELEMENTSINDIRECTBINDLESSCOUNTNVPROC MultiDrawElementsIndirectBindlessCountNV;
        /* 1812 */ PFNGLGETTEXTUREHANDLENVPROC GetTextureHandleNV;
        /* 1813 */ PFNGLGETTEXTURESAMPLERHANDLENVPROC GetTextureSamplerHandleNV;
        /* 1814 */ PFNGLMAKETEXTUREHANDLERESIDENTNVPROC MakeTextureHandleResidentNV;
        /* 1815 */ PFNGLMAKETEXTUREHANDLENONRESIDENTNVPROC MakeTextureHandleNonResidentNV;
        /* 1816 */ PFNGLGETIMAGEHANDLENVPROC GetImageHandleNV;
        /* 1817 */ PFNGLMAKEIMAGEHANDLERESIDENTNVPROC MakeImageHandleResidentNV;
        /* 1818 */ PFNGLMAKEIMAGEHANDLENONRESIDENTNVPROC MakeImageHandleNonResidentNV;
        /* 1819 */ PFNGLUNIFORMHANDLEUI64NVPROC UniformHandleui64NV;
        /* 1820 */ PFNGLUNIFORMHANDLEUI64VNVPROC UniformHandleui64vNV;
        /* 1821 */ PFNGLPROGRAMUNIFORMHANDLEUI64NVPROC ProgramUniformHandleui64NV;
        /* 1822 */ PFNGLPROGRAMUNIFORMHANDLEUI64VNVPROC ProgramUniformHandleui64vNV;
        /* 1823 */ PFNGLISTEXTUREHANDLERESIDENTNVPROC IsTextureHandleResidentNV;
        /* 1824 */ PFNGLISIMAGEHANDLERESIDENTNVPROC IsImageHandleResidentNV;
        /* 1825 */ PFNGLBLENDPARAMETERINVPROC BlendParameteriNV;
        /* 1826 */ PFNGLBLENDBARRIERNVPROC BlendBarrierNV;
        /* 1827 */ PFNGLVIEWPORTPOSITIONWSCALENVPROC ViewportPositionWScaleNV;
        /* 1828 */ PFNGLCREATESTATESNVPROC CreateStatesNV;
        /* 1829 */ PFNGLDELETESTATESNVPROC DeleteStatesNV;
        /* 1830 */ PFNGLISSTATENVPROC IsStateNV;
        /* 1831 */ PFNGLSTATECAPTURENVPROC StateCaptureNV;
        /* 1832 */ PFNGLGETCOMMANDHEADERNVPROC GetCommandHeaderNV;
        /* 1833 */ PFNGLGETSTAGEINDEXNVPROC GetStageIndexNV;
        /* 1834 */ PFNGLDRAWCOMMANDSNVPROC DrawCommandsNV;
        /* 1835 */ PFNGLDRAWCOMMANDSADDRESSNVPROC DrawCommandsAddressNV;
        /* 1836 */ PFNGLDRAWCOMMANDSSTATESNVPROC DrawCommandsStatesNV;
        /* 1837 */ PFNGLDRAWCOMMANDSSTATESADDRESSNVPROC DrawCommandsStatesAddressNV;
        /* 1838 */ PFNGLCREATECOMMANDLISTSNVPROC CreateCommandListsNV;
        /* 1839 */ PFNGLDELETECOMMANDLISTSNVPROC DeleteCommandListsNV;
        /* 1840 */ PFNGLISCOMMANDLISTNVPROC IsCommandListNV;
        /* 1841 */ PFNGLLISTDRAWCOMMANDSSTATESCLIENTNVPROC ListDrawCommandsStatesClientNV;
        /* 1842 */ PFNGLCOMMANDLISTSEGMENTSNVPROC CommandListSegmentsNV;
        /* 1843 */ PFNGLCOMPILECOMMANDLISTNVPROC CompileCommandListNV;
        /* 1844 */ PFNGLCALLCOMMANDLISTNVPROC CallCommandListNV;
        /* 1845 */ PFNGLBEGINCONDITIONALRENDERNVPROC BeginConditionalRenderNV;
        /* 1846 */ PFNGLENDCONDITIONALRENDERNVPROC EndConditionalRenderNV;
        /* 1847 */ PFNGLSUBPIXELPRECISIONBIASNVPROC SubpixelPrecisionBiasNV;
        /* 1848 */ PFNGLCONSERVATIVERASTERPARAMETERFNVPROC ConservativeRasterParameterfNV;
        /* 1849 */ PFNGLCONSERVATIVERASTERPARAMETERINVPROC ConservativeRasterParameteriNV;
        /* 1850 */ PFNGLCOPYIMAGESUBDATANVPROC CopyImageSubDataNV;
        /* 1851 */ PFNGLDEPTHRANGEDNVPROC DepthRangedNV;
        /* 1852 */ PFNGLCLEARDEPTHDNVPROC ClearDepthdNV;
        /* 1853 */ PFNGLDEPTHBOUNDSDNVPROC DepthBoundsdNV;
        /* 1854 */ PFNGLDRAWTEXTURENVPROC DrawTextureNV;
        /* 1855 */ PFNGLDRAWVKIMAGENVPROC DrawVkImageNV;
        /* 1856 */ PFNGLGETVKPROCADDRNVPROC GetVkProcAddrNV;
        /* 1857 */ PFNGLWAITVKSEMAPHORENVPROC WaitVkSemaphoreNV;
        /* 1858 */ PFNGLSIGNALVKSEMAPHORENVPROC SignalVkSemaphoreNV;
        /* 1859 */ PFNGLSIGNALVKFENCENVPROC SignalVkFenceNV;
        /* 1860 */ PFNGLMAPCONTROLPOINTSNVPROC MapControlPointsNV;
        /* 1861 */ PFNGLMAPPARAMETERIVNVPROC MapParameterivNV;
        /* 1862 */ PFNGLMAPPARAMETERFVNVPROC MapParameterfvNV;
        /* 1863 */ PFNGLGETMAPCONTROLPOINTSNVPROC GetMapControlPointsNV;
        /* 1864 */ PFNGLGETMAPPARAMETERIVNVPROC GetMapParameterivNV;
        /* 1865 */ PFNGLGETMAPPARAMETERFVNVPROC GetMapParameterfvNV;
        /* 1866 */ PFNGLGETMAPATTRIBPARAMETERIVNVPROC GetMapAttribParameterivNV;
        /* 1867 */ PFNGLGETMAPATTRIBPARAMETERFVNVPROC GetMapAttribParameterfvNV;
        /* 1868 */ PFNGLEVALMAPSNVPROC EvalMapsNV;
        /* 1869 */ PFNGLGETMULTISAMPLEFVNVPROC GetMultisamplefvNV;
        /* 1870 */ PFNGLSAMPLEMASKINDEXEDNVPROC SampleMaskIndexedNV;
        /* 1871 */ PFNGLTEXRENDERBUFFERNVPROC TexRenderbufferNV;
        /* 1872 */ PFNGLDELETEFENCESNVPROC DeleteFencesNV;
        /* 1873 */ PFNGLGENFENCESNVPROC GenFencesNV;
        /* 1874 */ PFNGLISFENCENVPROC IsFenceNV;
        /* 1875 */ PFNGLTESTFENCENVPROC TestFenceNV;
        /* 1876 */ PFNGLGETFENCEIVNVPROC GetFenceivNV;
        /* 1877 */ PFNGLFINISHFENCENVPROC FinishFenceNV;
        /* 1878 */ PFNGLSETFENCENVPROC SetFenceNV;
        /* 1879 */ PFNGLFRAGMENTCOVERAGECOLORNVPROC FragmentCoverageColorNV;
        /* 1880 */ PFNGLPROGRAMNAMEDPARAMETER4FNVPROC ProgramNamedParameter4fNV;
        /* 1881 */ PFNGLPROGRAMNAMEDPARAMETER4FVNVPROC ProgramNamedParameter4fvNV;
        /* 1882 */ PFNGLPROGRAMNAMEDPARAMETER4DNVPROC ProgramNamedParameter4dNV;
        /* 1883 */ PFNGLPROGRAMNAMEDPARAMETER4DVNVPROC ProgramNamedParameter4dvNV;
        /* 1884 */ PFNGLGETPROGRAMNAMEDPARAMETERFVNVPROC GetProgramNamedParameterfvNV;
        /* 1885 */ PFNGLGETPROGRAMNAMEDPARAMETERDVNVPROC GetProgramNamedParameterdvNV;
        /* 1886 */ PFNGLCOVERAGEMODULATIONTABLENVPROC CoverageModulationTableNV;
        /* 1887 */ PFNGLGETCOVERAGEMODULATIONTABLENVPROC GetCoverageModulationTableNV;
        /* 1888 */ PFNGLCOVERAGEMODULATIONNVPROC CoverageModulationNV;
        /* 1889 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLECOVERAGENVPROC RenderbufferStorageMultisampleCoverageNV;
        /* 1890 */ PFNGLPROGRAMVERTEXLIMITNVPROC ProgramVertexLimitNV;
        /* 1891 */ PFNGLFRAMEBUFFERTEXTUREFACEEXTPROC FramebufferTextureFaceEXT;
        /* 1892 */ PFNGLPROGRAMLOCALPARAMETERI4INVPROC ProgramLocalParameterI4iNV;
        /* 1893 */ PFNGLPROGRAMLOCALPARAMETERI4IVNVPROC ProgramLocalParameterI4ivNV;
        /* 1894 */ PFNGLPROGRAMLOCALPARAMETERSI4IVNVPROC ProgramLocalParametersI4ivNV;
        /* 1895 */ PFNGLPROGRAMLOCALPARAMETERI4UINVPROC ProgramLocalParameterI4uiNV;
        /* 1896 */ PFNGLPROGRAMLOCALPARAMETERI4UIVNVPROC ProgramLocalParameterI4uivNV;
        /* 1897 */ PFNGLPROGRAMLOCALPARAMETERSI4UIVNVPROC ProgramLocalParametersI4uivNV;
        /* 1898 */ PFNGLPROGRAMENVPARAMETERI4INVPROC ProgramEnvParameterI4iNV;
        /* 1899 */ PFNGLPROGRAMENVPARAMETERI4IVNVPROC ProgramEnvParameterI4ivNV;
        /* 1900 */ PFNGLPROGRAMENVPARAMETERSI4IVNVPROC ProgramEnvParametersI4ivNV;
        /* 1901 */ PFNGLPROGRAMENVPARAMETERI4UINVPROC ProgramEnvParameterI4uiNV;
        /* 1902 */ PFNGLPROGRAMENVPARAMETERI4UIVNVPROC ProgramEnvParameterI4uivNV;
        /* 1903 */ PFNGLPROGRAMENVPARAMETERSI4UIVNVPROC ProgramEnvParametersI4uivNV;
        /* 1904 */ PFNGLGETPROGRAMLOCALPARAMETERIIVNVPROC GetProgramLocalParameterIivNV;
        /* 1905 */ PFNGLGETPROGRAMLOCALPARAMETERIUIVNVPROC GetProgramLocalParameterIuivNV;
        /* 1906 */ PFNGLGETPROGRAMENVPARAMETERIIVNVPROC GetProgramEnvParameterIivNV;
        /* 1907 */ PFNGLGETPROGRAMENVPARAMETERIUIVNVPROC GetProgramEnvParameterIuivNV;
        /* 1908 */ PFNGLPROGRAMSUBROUTINEPARAMETERSUIVNVPROC ProgramSubroutineParametersuivNV;
        /* 1909 */ PFNGLGETPROGRAMSUBROUTINEPARAMETERUIVNVPROC GetProgramSubroutineParameteruivNV;
        /* 1910 */ PFNGLVERTEX2HNVPROC Vertex2hNV;
        /* 1911 */ PFNGLVERTEX2HVNVPROC Vertex2hvNV;
        /* 1912 */ PFNGLVERTEX3HNVPROC Vertex3hNV;
        /* 1913 */ PFNGLVERTEX3HVNVPROC Vertex3hvNV;
        /* 1914 */ PFNGLVERTEX4HNVPROC Vertex4hNV;
        /* 1915 */ PFNGLVERTEX4HVNVPROC Vertex4hvNV;
        /* 1916 */ PFNGLNORMAL3HNVPROC Normal3hNV;
        /* 1917 */ PFNGLNORMAL3HVNVPROC Normal3hvNV;
        /* 1918 */ PFNGLCOLOR3HNVPROC Color3hNV;
        /* 1919 */ PFNGLCOLOR3HVNVPROC Color3hvNV;
        /* 1920 */ PFNGLCOLOR4HNVPROC Color4hNV;
        /* 1921 */ PFNGLCOLOR4HVNVPROC Color4hvNV;
        /* 1922 */ PFNGLTEXCOORD1HNVPROC TexCoord1hNV;
        /* 1923 */ PFNGLTEXCOORD1HVNVPROC TexCoord1hvNV;
        /* 1924 */ PFNGLTEXCOORD2HNVPROC TexCoord2hNV;
        /* 1925 */ PFNGLTEXCOORD2HVNVPROC TexCoord2hvNV;
        /* 1926 */ PFNGLTEXCOORD3HNVPROC TexCoord3hNV;
        /* 1927 */ PFNGLTEXCOORD3HVNVPROC TexCoord3hvNV;
        /* 1928 */ PFNGLTEXCOORD4HNVPROC TexCoord4hNV;
        /* 1929 */ PFNGLTEXCOORD4HVNVPROC TexCoord4hvNV;
        /* 1930 */ PFNGLMULTITEXCOORD1HNVPROC MultiTexCoord1hNV;
        /* 1931 */ PFNGLMULTITEXCOORD1HVNVPROC MultiTexCoord1hvNV;
        /* 1932 */ PFNGLMULTITEXCOORD2HNVPROC MultiTexCoord2hNV;
        /* 1933 */ PFNGLMULTITEXCOORD2HVNVPROC MultiTexCoord2hvNV;
        /* 1934 */ PFNGLMULTITEXCOORD3HNVPROC MultiTexCoord3hNV;
        /* 1935 */ PFNGLMULTITEXCOORD3HVNVPROC MultiTexCoord3hvNV;
        /* 1936 */ PFNGLMULTITEXCOORD4HNVPROC MultiTexCoord4hNV;
        /* 1937 */ PFNGLMULTITEXCOORD4HVNVPROC MultiTexCoord4hvNV;
        /* 1938 */ PFNGLVERTEXATTRIB1HNVPROC VertexAttrib1hNV;
        /* 1939 */ PFNGLVERTEXATTRIB1HVNVPROC VertexAttrib1hvNV;
        /* 1940 */ PFNGLVERTEXATTRIB2HNVPROC VertexAttrib2hNV;
        /* 1941 */ PFNGLVERTEXATTRIB2HVNVPROC VertexAttrib2hvNV;
        /* 1942 */ PFNGLVERTEXATTRIB3HNVPROC VertexAttrib3hNV;
        /* 1943 */ PFNGLVERTEXATTRIB3HVNVPROC VertexAttrib3hvNV;
        /* 1944 */ PFNGLVERTEXATTRIB4HNVPROC VertexAttrib4hNV;
        /* 1945 */ PFNGLVERTEXATTRIB4HVNVPROC VertexAttrib4hvNV;
        /* 1946 */ PFNGLVERTEXATTRIBS1HVNVPROC VertexAttribs1hvNV;
        /* 1947 */ PFNGLVERTEXATTRIBS2HVNVPROC VertexAttribs2hvNV;
        /* 1948 */ PFNGLVERTEXATTRIBS3HVNVPROC VertexAttribs3hvNV;
        /* 1949 */ PFNGLVERTEXATTRIBS4HVNVPROC VertexAttribs4hvNV;
        /* 1950 */ PFNGLFOGCOORDHNVPROC FogCoordhNV;
        /* 1951 */ PFNGLFOGCOORDHVNVPROC FogCoordhvNV;
        /* 1952 */ PFNGLSECONDARYCOLOR3HNVPROC SecondaryColor3hNV;
        /* 1953 */ PFNGLSECONDARYCOLOR3HVNVPROC SecondaryColor3hvNV;
        /* 1954 */ PFNGLVERTEXWEIGHTHNVPROC VertexWeighthNV;
        /* 1955 */ PFNGLVERTEXWEIGHTHVNVPROC VertexWeighthvNV;
        /* 1956 */ PFNGLGETINTERNALFORMATSAMPLEIVNVPROC GetInternalformatSampleivNV;
        /* 1957 */ PFNGLRENDERGPUMASKNVPROC RenderGpuMaskNV;
        /* 1958 */ PFNGLMULTICASTBUFFERSUBDATANVPROC MulticastBufferSubDataNV;
        /* 1959 */ PFNGLMULTICASTCOPYBUFFERSUBDATANVPROC MulticastCopyBufferSubDataNV;
        /* 1960 */ PFNGLMULTICASTCOPYIMAGESUBDATANVPROC MulticastCopyImageSubDataNV;
        /* 1961 */ PFNGLMULTICASTBLITFRAMEBUFFERNVPROC MulticastBlitFramebufferNV;
        /* 1962 */ PFNGLMULTICASTFRAMEBUFFERSAMPLELOCATIONSFVNVPROC MulticastFramebufferSampleLocationsfvNV;
        /* 1963 */ PFNGLMULTICASTBARRIERNVPROC MulticastBarrierNV;
        /* 1964 */ PFNGLMULTICASTWAITSYNCNVPROC MulticastWaitSyncNV;
        /* 1965 */ PFNGLMULTICASTGETQUERYOBJECTIVNVPROC MulticastGetQueryObjectivNV;
        /* 1966 */ PFNGLMULTICASTGETQUERYOBJECTUIVNVPROC MulticastGetQueryObjectuivNV;
        /* 1967 */ PFNGLMULTICASTGETQUERYOBJECTI64VNVPROC MulticastGetQueryObjecti64vNV;
        /* 1968 */ PFNGLMULTICASTGETQUERYOBJECTUI64VNVPROC MulticastGetQueryObjectui64vNV;
        /* 1969 */ PFNGLUPLOADGPUMASKNVXPROC UploadGpuMaskNVX;
        /* 1970 */ PFNGLMULTICASTVIEWPORTARRAYVNVXPROC MulticastViewportArrayvNVX;
        /* 1971 */ PFNGLMULTICASTVIEWPORTPOSITIONWSCALENVXPROC MulticastViewportPositionWScaleNVX;
        /* 1972 */ PFNGLMULTICASTSCISSORARRAYVNVXPROC MulticastScissorArrayvNVX;
        /* 1973 */ PFNGLASYNCCOPYBUFFERSUBDATANVXPROC AsyncCopyBufferSubDataNVX;
        /* 1974 */ PFNGLASYNCCOPYIMAGESUBDATANVXPROC AsyncCopyImageSubDataNVX;
        /* 1975 */ PFNGLCREATEPROGRESSFENCENVXPROC CreateProgressFenceNVX;
        /* 1976 */ PFNGLSIGNALSEMAPHOREUI64NVXPROC SignalSemaphoreui64NVX;
        /* 1977 */ PFNGLWAITSEMAPHOREUI64NVXPROC WaitSemaphoreui64NVX;
        /* 1978 */ PFNGLCLIENTWAITSEMAPHOREUI64NVXPROC ClientWaitSemaphoreui64NVX;
        /* 1979 */ PFNGLGETMEMORYOBJECTDETACHEDRESOURCESUIVNVPROC GetMemoryObjectDetachedResourcesuivNV;
        /* 1980 */ PFNGLRESETMEMORYOBJECTPARAMETERNVPROC ResetMemoryObjectParameterNV;
        /* 1981 */ PFNGLTEXATTACHMEMORYNVPROC TexAttachMemoryNV;
        /* 1982 */ PFNGLBUFFERATTACHMEMORYNVPROC BufferAttachMemoryNV;
        /* 1983 */ PFNGLTEXTUREATTACHMEMORYNVPROC TextureAttachMemoryNV;
        /* 1984 */ PFNGLNAMEDBUFFERATTACHMEMORYNVPROC NamedBufferAttachMemoryNV;
        /* 1985 */ PFNGLBUFFERPAGECOMMITMENTMEMNVPROC BufferPageCommitmentMemNV;
        /* 1986 */ PFNGLTEXPAGECOMMITMENTMEMNVPROC TexPageCommitmentMemNV;
        /* 1987 */ PFNGLNAMEDBUFFERPAGECOMMITMENTMEMNVPROC NamedBufferPageCommitmentMemNV;
        /* 1988 */ PFNGLTEXTUREPAGECOMMITMENTMEMNVPROC TexturePageCommitmentMemNV;
        /* 1989 */ PFNGLDRAWMESHTASKSNVPROC DrawMeshTasksNV;
        /* 1990 */ PFNGLDRAWMESHTASKSINDIRECTNVPROC DrawMeshTasksIndirectNV;
        /* 1991 */ PFNGLMULTIDRAWMESHTASKSINDIRECTNVPROC MultiDrawMeshTasksIndirectNV;
        /* 1992 */ PFNGLMULTIDRAWMESHTASKSINDIRECTCOUNTNVPROC MultiDrawMeshTasksIndirectCountNV;
        /* 1993 */ PFNGLGENOCCLUSIONQUERIESNVPROC GenOcclusionQueriesNV;
        /* 1994 */ PFNGLDELETEOCCLUSIONQUERIESNVPROC DeleteOcclusionQueriesNV;
        /* 1995 */ PFNGLISOCCLUSIONQUERYNVPROC IsOcclusionQueryNV;
        /* 1996 */ PFNGLBEGINOCCLUSIONQUERYNVPROC BeginOcclusionQueryNV;
        /* 1997 */ PFNGLENDOCCLUSIONQUERYNVPROC EndOcclusionQueryNV;
        /* 1998 */ PFNGLGETOCCLUSIONQUERYIVNVPROC GetOcclusionQueryivNV;
        /* 1999 */ PFNGLGETOCCLUSIONQUERYUIVNVPROC GetOcclusionQueryuivNV;
        /* 2000 */ PFNGLPROGRAMBUFFERPARAMETERSFVNVPROC ProgramBufferParametersfvNV;
        /* 2001 */ PFNGLPROGRAMBUFFERPARAMETERSIIVNVPROC ProgramBufferParametersIivNV;
        /* 2002 */ PFNGLPROGRAMBUFFERPARAMETERSIUIVNVPROC ProgramBufferParametersIuivNV;
        /* 2003 */ PFNGLGENPATHSNVPROC GenPathsNV;
        /* 2004 */ PFNGLDELETEPATHSNVPROC DeletePathsNV;
        /* 2005 */ PFNGLISPATHNVPROC IsPathNV;
        /* 2006 */ PFNGLPATHCOMMANDSNVPROC PathCommandsNV;
        /* 2007 */ PFNGLPATHCOORDSNVPROC PathCoordsNV;
        /* 2008 */ PFNGLPATHSUBCOMMANDSNVPROC PathSubCommandsNV;
        /* 2009 */ PFNGLPATHSUBCOORDSNVPROC PathSubCoordsNV;
        /* 2010 */ PFNGLPATHSTRINGNVPROC PathStringNV;
        /* 2011 */ PFNGLPATHGLYPHSNVPROC PathGlyphsNV;
        /* 2012 */ PFNGLPATHGLYPHRANGENVPROC PathGlyphRangeNV;
        /* 2013 */ PFNGLWEIGHTPATHSNVPROC WeightPathsNV;
        /* 2014 */ PFNGLCOPYPATHNVPROC CopyPathNV;
        /* 2015 */ PFNGLINTERPOLATEPATHSNVPROC InterpolatePathsNV;
        /* 2016 */ PFNGLTRANSFORMPATHNVPROC TransformPathNV;
        /* 2017 */ PFNGLPATHPARAMETERIVNVPROC PathParameterivNV;
        /* 2018 */ PFNGLPATHPARAMETERINVPROC PathParameteriNV;
        /* 2019 */ PFNGLPATHPARAMETERFVNVPROC PathParameterfvNV;
        /* 2020 */ PFNGLPATHPARAMETERFNVPROC PathParameterfNV;
        /* 2021 */ PFNGLPATHDASHARRAYNVPROC PathDashArrayNV;
        /* 2022 */ PFNGLPATHSTENCILFUNCNVPROC PathStencilFuncNV;
        /* 2023 */ PFNGLPATHSTENCILDEPTHOFFSETNVPROC PathStencilDepthOffsetNV;
        /* 2024 */ PFNGLSTENCILFILLPATHNVPROC StencilFillPathNV;
        /* 2025 */ PFNGLSTENCILSTROKEPATHNVPROC StencilStrokePathNV;
        /* 2026 */ PFNGLSTENCILFILLPATHINSTANCEDNVPROC StencilFillPathInstancedNV;
        /* 2027 */ PFNGLSTENCILSTROKEPATHINSTANCEDNVPROC StencilStrokePathInstancedNV;
        /* 2028 */ PFNGLPATHCOVERDEPTHFUNCNVPROC PathCoverDepthFuncNV;
        /* 2029 */ PFNGLCOVERFILLPATHNVPROC CoverFillPathNV;
        /* 2030 */ PFNGLCOVERSTROKEPATHNVPROC CoverStrokePathNV;
        /* 2031 */ PFNGLCOVERFILLPATHINSTANCEDNVPROC CoverFillPathInstancedNV;
        /* 2032 */ PFNGLCOVERSTROKEPATHINSTANCEDNVPROC CoverStrokePathInstancedNV;
        /* 2033 */ PFNGLGETPATHPARAMETERIVNVPROC GetPathParameterivNV;
        /* 2034 */ PFNGLGETPATHPARAMETERFVNVPROC GetPathParameterfvNV;
        /* 2035 */ PFNGLGETPATHCOMMANDSNVPROC GetPathCommandsNV;
        /* 2036 */ PFNGLGETPATHCOORDSNVPROC GetPathCoordsNV;
        /* 2037 */ PFNGLGETPATHDASHARRAYNVPROC GetPathDashArrayNV;
        /* 2038 */ PFNGLGETPATHMETRICSNVPROC GetPathMetricsNV;
        /* 2039 */ PFNGLGETPATHMETRICRANGENVPROC GetPathMetricRangeNV;
        /* 2040 */ PFNGLGETPATHSPACINGNVPROC GetPathSpacingNV;
        /* 2041 */ PFNGLISPOINTINFILLPATHNVPROC IsPointInFillPathNV;
        /* 2042 */ PFNGLISPOINTINSTROKEPATHNVPROC IsPointInStrokePathNV;
        /* 2043 */ PFNGLGETPATHLENGTHNVPROC GetPathLengthNV;
        /* 2044 */ PFNGLPOINTALONGPATHNVPROC PointAlongPathNV;
        /* 2045 */ PFNGLMATRIXLOAD3X2FNVPROC MatrixLoad3x2fNV;
        /* 2046 */ PFNGLMATRIXLOAD3X3FNVPROC MatrixLoad3x3fNV;
        /* 2047 */ PFNGLMATRIXLOADTRANSPOSE3X3FNVPROC MatrixLoadTranspose3x3fNV;
        /* 2048 */ PFNGLMATRIXMULT3X2FNVPROC MatrixMult3x2fNV;
        /* 2049 */ PFNGLMATRIXMULT3X3FNVPROC MatrixMult3x3fNV;
        /* 2050 */ PFNGLMATRIXMULTTRANSPOSE3X3FNVPROC MatrixMultTranspose3x3fNV;
        /* 2051 */ PFNGLSTENCILTHENCOVERFILLPATHNVPROC StencilThenCoverFillPathNV;
        /* 2052 */ PFNGLSTENCILTHENCOVERSTROKEPATHNVPROC StencilThenCoverStrokePathNV;
        /* 2053 */ PFNGLSTENCILTHENCOVERFILLPATHINSTANCEDNVPROC StencilThenCoverFillPathInstancedNV;
        /* 2054 */ PFNGLSTENCILTHENCOVERSTROKEPATHINSTANCEDNVPROC StencilThenCoverStrokePathInstancedNV;
        /* 2055 */ PFNGLPATHGLYPHINDEXRANGENVPROC PathGlyphIndexRangeNV;
        /* 2056 */ PFNGLPATHGLYPHINDEXARRAYNVPROC PathGlyphIndexArrayNV;
        /* 2057 */ PFNGLPATHMEMORYGLYPHINDEXARRAYNVPROC PathMemoryGlyphIndexArrayNV;
        /* 2058 */ PFNGLPROGRAMPATHFRAGMENTINPUTGENNVPROC ProgramPathFragmentInputGenNV;
        /* 2059 */ PFNGLGETPROGRAMRESOURCEFVNVPROC GetProgramResourcefvNV;
        /* 2060 */ PFNGLPIXELDATARANGENVPROC PixelDataRangeNV;
        /* 2061 */ PFNGLFLUSHPIXELDATARANGENVPROC FlushPixelDataRangeNV;
        /* 2062 */ PFNGLPOINTPARAMETERINVPROC PointParameteriNV;
        /* 2063 */ PFNGLPOINTPARAMETERIVNVPROC PointParameterivNV;
        /* 2064 */ PFNGLPRESENTFRAMEKEYEDNVPROC PresentFrameKeyedNV;
        /* 2065 */ PFNGLPRESENTFRAMEDUALFILLNVPROC PresentFrameDualFillNV;
        /* 2066 */ PFNGLGETVIDEOIVNVPROC GetVideoivNV;
        /* 2067 */ PFNGLGETVIDEOUIVNVPROC GetVideouivNV;
        /* 2068 */ PFNGLGETVIDEOI64VNVPROC GetVideoi64vNV;
        /* 2069 */ PFNGLGETVIDEOUI64VNVPROC GetVideoui64vNV;
        /* 2070 */ PFNGLPRIMITIVERESTARTNVPROC PrimitiveRestartNV;
        /* 2071 */ PFNGLPRIMITIVERESTARTINDEXNVPROC PrimitiveRestartIndexNV;
        /* 2072 */ PFNGLQUERYRESOURCENVPROC QueryResourceNV;
        /* 2073 */ PFNGLGENQUERYRESOURCETAGNVPROC GenQueryResourceTagNV;
        /* 2074 */ PFNGLDELETEQUERYRESOURCETAGNVPROC DeleteQueryResourceTagNV;
        /* 2075 */ PFNGLQUERYRESOURCETAGNVPROC QueryResourceTagNV;
        /* 2076 */ PFNGLCOMBINERPARAMETERFVNVPROC CombinerParameterfvNV;
        /* 2077 */ PFNGLCOMBINERPARAMETERFNVPROC CombinerParameterfNV;
        /* 2078 */ PFNGLCOMBINERPARAMETERIVNVPROC CombinerParameterivNV;
        /* 2079 */ PFNGLCOMBINERPARAMETERINVPROC CombinerParameteriNV;
        /* 2080 */ PFNGLCOMBINERINPUTNVPROC CombinerInputNV;
        /* 2081 */ PFNGLCOMBINEROUTPUTNVPROC CombinerOutputNV;
        /* 2082 */ PFNGLFINALCOMBINERINPUTNVPROC FinalCombinerInputNV;
        /* 2083 */ PFNGLGETCOMBINERINPUTPARAMETERFVNVPROC GetCombinerInputParameterfvNV;
        /* 2084 */ PFNGLGETCOMBINERINPUTPARAMETERIVNVPROC GetCombinerInputParameterivNV;
        /* 2085 */ PFNGLGETCOMBINEROUTPUTPARAMETERFVNVPROC GetCombinerOutputParameterfvNV;
        /* 2086 */ PFNGLGETCOMBINEROUTPUTPARAMETERIVNVPROC GetCombinerOutputParameterivNV;
        /* 2087 */ PFNGLGETFINALCOMBINERINPUTPARAMETERFVNVPROC GetFinalCombinerInputParameterfvNV;
        /* 2088 */ PFNGLGETFINALCOMBINERINPUTPARAMETERIVNVPROC GetFinalCombinerInputParameterivNV;
        /* 2089 */ PFNGLCOMBINERSTAGEPARAMETERFVNVPROC CombinerStageParameterfvNV;
        /* 2090 */ PFNGLGETCOMBINERSTAGEPARAMETERFVNVPROC GetCombinerStageParameterfvNV;
        /* 2091 */ PFNGLFRAMEBUFFERSAMPLELOCATIONSFVNVPROC FramebufferSampleLocationsfvNV;
        /* 2092 */ PFNGLNAMEDFRAMEBUFFERSAMPLELOCATIONSFVNVPROC NamedFramebufferSampleLocationsfvNV;
        /* 2093 */ PFNGLRESOLVEDEPTHVALUESNVPROC ResolveDepthValuesNV;
        /* 2094 */ PFNGLSCISSOREXCLUSIVENVPROC ScissorExclusiveNV;
        /* 2095 */ PFNGLSCISSOREXCLUSIVEARRAYVNVPROC ScissorExclusiveArrayvNV;
        /* 2096 */ PFNGLMAKEBUFFERRESIDENTNVPROC MakeBufferResidentNV;
        /* 2097 */ PFNGLMAKEBUFFERNONRESIDENTNVPROC MakeBufferNonResidentNV;
        /* 2098 */ PFNGLISBUFFERRESIDENTNVPROC IsBufferResidentNV;
        /* 2099 */ PFNGLMAKENAMEDBUFFERRESIDENTNVPROC MakeNamedBufferResidentNV;
        /* 2100 */ PFNGLMAKENAMEDBUFFERNONRESIDENTNVPROC MakeNamedBufferNonResidentNV;
        /* 2101 */ PFNGLISNAMEDBUFFERRESIDENTNVPROC IsNamedBufferResidentNV;
        /* 2102 */ PFNGLGETBUFFERPARAMETERUI64VNVPROC GetBufferParameterui64vNV;
        /* 2103 */ PFNGLGETNAMEDBUFFERPARAMETERUI64VNVPROC GetNamedBufferParameterui64vNV;
        /* 2104 */ PFNGLGETINTEGERUI64VNVPROC GetIntegerui64vNV;
        /* 2105 */ PFNGLUNIFORMUI64NVPROC Uniformui64NV;
        /* 2106 */ PFNGLUNIFORMUI64VNVPROC Uniformui64vNV;
        /* 2107 */ PFNGLPROGRAMUNIFORMUI64NVPROC ProgramUniformui64NV;
        /* 2108 */ PFNGLPROGRAMUNIFORMUI64VNVPROC ProgramUniformui64vNV;
        /* 2109 */ PFNGLBINDSHADINGRATEIMAGENVPROC BindShadingRateImageNV;
        /* 2110 */ PFNGLGETSHADINGRATEIMAGEPALETTENVPROC GetShadingRateImagePaletteNV;
        /* 2111 */ PFNGLGETSHADINGRATESAMPLELOCATIONIVNVPROC GetShadingRateSampleLocationivNV;
        /* 2112 */ PFNGLSHADINGRATEIMAGEBARRIERNVPROC ShadingRateImageBarrierNV;
        /* 2113 */ PFNGLSHADINGRATEIMAGEPALETTENVPROC ShadingRateImagePaletteNV;
        /* 2114 */ PFNGLSHADINGRATESAMPLEORDERNVPROC ShadingRateSampleOrderNV;
        /* 2115 */ PFNGLSHADINGRATESAMPLEORDERCUSTOMNVPROC ShadingRateSampleOrderCustomNV;
        /* 2116 */ PFNGLTEXTUREBARRIERNVPROC TextureBarrierNV;
        /* 2117 */ PFNGLTEXIMAGE2DMULTISAMPLECOVERAGENVPROC TexImage2DMultisampleCoverageNV;
        /* 2118 */ PFNGLTEXIMAGE3DMULTISAMPLECOVERAGENVPROC TexImage3DMultisampleCoverageNV;
        /* 2119 */ PFNGLTEXTUREIMAGE2DMULTISAMPLENVPROC TextureImage2DMultisampleNV;
        /* 2120 */ PFNGLTEXTUREIMAGE3DMULTISAMPLENVPROC TextureImage3DMultisampleNV;
        /* 2121 */ PFNGLTEXTUREIMAGE2DMULTISAMPLECOVERAGENVPROC TextureImage2DMultisampleCoverageNV;
        /* 2122 */ PFNGLTEXTUREIMAGE3DMULTISAMPLECOVERAGENVPROC TextureImage3DMultisampleCoverageNV;
        /* 2123 */ PFNGLBEGINTRANSFORMFEEDBACKNVPROC BeginTransformFeedbackNV;
        /* 2124 */ PFNGLENDTRANSFORMFEEDBACKNVPROC EndTransformFeedbackNV;
        /* 2125 */ PFNGLTRANSFORMFEEDBACKATTRIBSNVPROC TransformFeedbackAttribsNV;
        /* 2126 */ PFNGLBINDBUFFERRANGENVPROC BindBufferRangeNV;
        /* 2127 */ PFNGLBINDBUFFEROFFSETNVPROC BindBufferOffsetNV;
        /* 2128 */ PFNGLBINDBUFFERBASENVPROC BindBufferBaseNV;
        /* 2129 */ PFNGLTRANSFORMFEEDBACKVARYINGSNVPROC TransformFeedbackVaryingsNV;
        /* 2130 */ PFNGLACTIVEVARYINGNVPROC ActiveVaryingNV;
        /* 2131 */ PFNGLGETVARYINGLOCATIONNVPROC GetVaryingLocationNV;
        /* 2132 */ PFNGLGETACTIVEVARYINGNVPROC GetActiveVaryingNV;
        /* 2133 */ PFNGLGETTRANSFORMFEEDBACKVARYINGNVPROC GetTransformFeedbackVaryingNV;
        /* 2134 */ PFNGLTRANSFORMFEEDBACKSTREAMATTRIBSNVPROC TransformFeedbackStreamAttribsNV;
        /* 2135 */ PFNGLBINDTRANSFORMFEEDBACKNVPROC BindTransformFeedbackNV;
        /* 2136 */ PFNGLDELETETRANSFORMFEEDBACKSNVPROC DeleteTransformFeedbacksNV;
        /* 2137 */ PFNGLGENTRANSFORMFEEDBACKSNVPROC GenTransformFeedbacksNV;
        /* 2138 */ PFNGLISTRANSFORMFEEDBACKNVPROC IsTransformFeedbackNV;
        /* 2139 */ PFNGLPAUSETRANSFORMFEEDBACKNVPROC PauseTransformFeedbackNV;
        /* 2140 */ PFNGLRESUMETRANSFORMFEEDBACKNVPROC ResumeTransformFeedbackNV;
        /* 2141 */ PFNGLDRAWTRANSFORMFEEDBACKNVPROC DrawTransformFeedbackNV;
        /* 2142 */ PFNGLVDPAUINITNVPROC VDPAUInitNV;
        /* 2143 */ PFNGLVDPAUFININVPROC VDPAUFiniNV;
        /* 2144 */ PFNGLVDPAUREGISTERVIDEOSURFACENVPROC VDPAURegisterVideoSurfaceNV;
        /* 2145 */ PFNGLVDPAUREGISTEROUTPUTSURFACENVPROC VDPAURegisterOutputSurfaceNV;
        /* 2146 */ PFNGLVDPAUISSURFACENVPROC VDPAUIsSurfaceNV;
        /* 2147 */ PFNGLVDPAUUNREGISTERSURFACENVPROC VDPAUUnregisterSurfaceNV;
        /* 2148 */ PFNGLVDPAUGETSURFACEIVNVPROC VDPAUGetSurfaceivNV;
        /* 2149 */ PFNGLVDPAUSURFACEACCESSNVPROC VDPAUSurfaceAccessNV;
        /* 2150 */ PFNGLVDPAUMAPSURFACESNVPROC VDPAUMapSurfacesNV;
        /* 2151 */ PFNGLVDPAUUNMAPSURFACESNVPROC VDPAUUnmapSurfacesNV;
        /* 2152 */ PFNGLVDPAUREGISTERVIDEOSURFACEWITHPICTURESTRUCTURENVPROC VDPAURegisterVideoSurfaceWithPictureStructureNV;
        /* 2153 */ PFNGLFLUSHVERTEXARRAYRANGENVPROC FlushVertexArrayRangeNV;
        /* 2154 */ PFNGLVERTEXARRAYRANGENVPROC VertexArrayRangeNV;
        /* 2155 */ PFNGLVERTEXATTRIBL1I64NVPROC VertexAttribL1i64NV;
        /* 2156 */ PFNGLVERTEXATTRIBL2I64NVPROC VertexAttribL2i64NV;
        /* 2157 */ PFNGLVERTEXATTRIBL3I64NVPROC VertexAttribL3i64NV;
        /* 2158 */ PFNGLVERTEXATTRIBL4I64NVPROC VertexAttribL4i64NV;
        /* 2159 */ PFNGLVERTEXATTRIBL1I64VNVPROC VertexAttribL1i64vNV;
        /* 2160 */ PFNGLVERTEXATTRIBL2I64VNVPROC VertexAttribL2i64vNV;
        /* 2161 */ PFNGLVERTEXATTRIBL3I64VNVPROC VertexAttribL3i64vNV;
        /* 2162 */ PFNGLVERTEXATTRIBL4I64VNVPROC VertexAttribL4i64vNV;
        /* 2163 */ PFNGLVERTEXATTRIBL1UI64NVPROC VertexAttribL1ui64NV;
        /* 2164 */ PFNGLVERTEXATTRIBL2UI64NVPROC VertexAttribL2ui64NV;
        /* 2165 */ PFNGLVERTEXATTRIBL3UI64NVPROC VertexAttribL3ui64NV;
        /* 2166 */ PFNGLVERTEXATTRIBL4UI64NVPROC VertexAttribL4ui64NV;
        /* 2167 */ PFNGLVERTEXATTRIBL1UI64VNVPROC VertexAttribL1ui64vNV;
        /* 2168 */ PFNGLVERTEXATTRIBL2UI64VNVPROC VertexAttribL2ui64vNV;
        /* 2169 */ PFNGLVERTEXATTRIBL3UI64VNVPROC VertexAttribL3ui64vNV;
        /* 2170 */ PFNGLVERTEXATTRIBL4UI64VNVPROC VertexAttribL4ui64vNV;
        /* 2171 */ PFNGLGETVERTEXATTRIBLI64VNVPROC GetVertexAttribLi64vNV;
        /* 2172 */ PFNGLGETVERTEXATTRIBLUI64VNVPROC GetVertexAttribLui64vNV;
        /* 2173 */ PFNGLVERTEXATTRIBLFORMATNVPROC VertexAttribLFormatNV;
        /* 2174 */ PFNGLBUFFERADDRESSRANGENVPROC BufferAddressRangeNV;
        /* 2175 */ PFNGLVERTEXFORMATNVPROC VertexFormatNV;
        /* 2176 */ PFNGLNORMALFORMATNVPROC NormalFormatNV;
        /* 2177 */ PFNGLCOLORFORMATNVPROC ColorFormatNV;
        /* 2178 */ PFNGLINDEXFORMATNVPROC IndexFormatNV;
        /* 2179 */ PFNGLTEXCOORDFORMATNVPROC TexCoordFormatNV;
        /* 2180 */ PFNGLEDGEFLAGFORMATNVPROC EdgeFlagFormatNV;
        /* 2181 */ PFNGLSECONDARYCOLORFORMATNVPROC SecondaryColorFormatNV;
        /* 2182 */ PFNGLFOGCOORDFORMATNVPROC FogCoordFormatNV;
        /* 2183 */ PFNGLVERTEXATTRIBFORMATNVPROC VertexAttribFormatNV;
        /* 2184 */ PFNGLVERTEXATTRIBIFORMATNVPROC VertexAttribIFormatNV;
        /* 2185 */ PFNGLGETINTEGERUI64I_VNVPROC GetIntegerui64i_vNV;
        /* 2186 */ PFNGLAREPROGRAMSRESIDENTNVPROC AreProgramsResidentNV;
        /* 2187 */ PFNGLBINDPROGRAMNVPROC BindProgramNV;
        /* 2188 */ PFNGLDELETEPROGRAMSNVPROC DeleteProgramsNV;
        /* 2189 */ PFNGLEXECUTEPROGRAMNVPROC ExecuteProgramNV;
        /* 2190 */ PFNGLGENPROGRAMSNVPROC GenProgramsNV;
        /* 2191 */ PFNGLGETPROGRAMPARAMETERDVNVPROC GetProgramParameterdvNV;
        /* 2192 */ PFNGLGETPROGRAMPARAMETERFVNVPROC GetProgramParameterfvNV;
        /* 2193 */ PFNGLGETPROGRAMIVNVPROC GetProgramivNV;
        /* 2194 */ PFNGLGETPROGRAMSTRINGNVPROC GetProgramStringNV;
        /* 2195 */ PFNGLGETTRACKMATRIXIVNVPROC GetTrackMatrixivNV;
        /* 2196 */ PFNGLGETVERTEXATTRIBDVNVPROC GetVertexAttribdvNV;
        /* 2197 */ PFNGLGETVERTEXATTRIBFVNVPROC GetVertexAttribfvNV;
        /* 2198 */ PFNGLGETVERTEXATTRIBIVNVPROC GetVertexAttribivNV;
        /* 2199 */ PFNGLGETVERTEXATTRIBPOINTERVNVPROC GetVertexAttribPointervNV;
        /* 2200 */ PFNGLISPROGRAMNVPROC IsProgramNV;
        /* 2201 */ PFNGLLOADPROGRAMNVPROC LoadProgramNV;
        /* 2202 */ PFNGLPROGRAMPARAMETER4DNVPROC ProgramParameter4dNV;
        /* 2203 */ PFNGLPROGRAMPARAMETER4DVNVPROC ProgramParameter4dvNV;
        /* 2204 */ PFNGLPROGRAMPARAMETER4FNVPROC ProgramParameter4fNV;
        /* 2205 */ PFNGLPROGRAMPARAMETER4FVNVPROC ProgramParameter4fvNV;
        /* 2206 */ PFNGLPROGRAMPARAMETERS4DVNVPROC ProgramParameters4dvNV;
        /* 2207 */ PFNGLPROGRAMPARAMETERS4FVNVPROC ProgramParameters4fvNV;
        /* 2208 */ PFNGLREQUESTRESIDENTPROGRAMSNVPROC RequestResidentProgramsNV;
        /* 2209 */ PFNGLTRACKMATRIXNVPROC TrackMatrixNV;
        /* 2210 */ PFNGLVERTEXATTRIBPOINTERNVPROC VertexAttribPointerNV;
        /* 2211 */ PFNGLVERTEXATTRIB1DNVPROC VertexAttrib1dNV;
        /* 2212 */ PFNGLVERTEXATTRIB1DVNVPROC VertexAttrib1dvNV;
        /* 2213 */ PFNGLVERTEXATTRIB1FNVPROC VertexAttrib1fNV;
        /* 2214 */ PFNGLVERTEXATTRIB1FVNVPROC VertexAttrib1fvNV;
        /* 2215 */ PFNGLVERTEXATTRIB1SNVPROC VertexAttrib1sNV;
        /* 2216 */ PFNGLVERTEXATTRIB1SVNVPROC VertexAttrib1svNV;
        /* 2217 */ PFNGLVERTEXATTRIB2DNVPROC VertexAttrib2dNV;
        /* 2218 */ PFNGLVERTEXATTRIB2DVNVPROC VertexAttrib2dvNV;
        /* 2219 */ PFNGLVERTEXATTRIB2FNVPROC VertexAttrib2fNV;
        /* 2220 */ PFNGLVERTEXATTRIB2FVNVPROC VertexAttrib2fvNV;
        /* 2221 */ PFNGLVERTEXATTRIB2SNVPROC VertexAttrib2sNV;
        /* 2222 */ PFNGLVERTEXATTRIB2SVNVPROC VertexAttrib2svNV;
        /* 2223 */ PFNGLVERTEXATTRIB3DNVPROC VertexAttrib3dNV;
        /* 2224 */ PFNGLVERTEXATTRIB3DVNVPROC VertexAttrib3dvNV;
        /* 2225 */ PFNGLVERTEXATTRIB3FNVPROC VertexAttrib3fNV;
        /* 2226 */ PFNGLVERTEXATTRIB3FVNVPROC VertexAttrib3fvNV;
        /* 2227 */ PFNGLVERTEXATTRIB3SNVPROC VertexAttrib3sNV;
        /* 2228 */ PFNGLVERTEXATTRIB3SVNVPROC VertexAttrib3svNV;
        /* 2229 */ PFNGLVERTEXATTRIB4DNVPROC VertexAttrib4dNV;
        /* 2230 */ PFNGLVERTEXATTRIB4DVNVPROC VertexAttrib4dvNV;
        /* 2231 */ PFNGLVERTEXATTRIB4FNVPROC VertexAttrib4fNV;
        /* 2232 */ PFNGLVERTEXATTRIB4FVNVPROC VertexAttrib4fvNV;
        /* 2233 */ PFNGLVERTEXATTRIB4SNVPROC VertexAttrib4sNV;
        /* 2234 */ PFNGLVERTEXATTRIB4SVNVPROC VertexAttrib4svNV;
        /* 2235 */ PFNGLVERTEXATTRIB4UBNVPROC VertexAttrib4ubNV;
        /* 2236 */ PFNGLVERTEXATTRIB4UBVNVPROC VertexAttrib4ubvNV;
        /* 2237 */ PFNGLVERTEXATTRIBS1DVNVPROC VertexAttribs1dvNV;
        /* 2238 */ PFNGLVERTEXATTRIBS1FVNVPROC VertexAttribs1fvNV;
        /* 2239 */ PFNGLVERTEXATTRIBS1SVNVPROC VertexAttribs1svNV;
        /* 2240 */ PFNGLVERTEXATTRIBS2DVNVPROC VertexAttribs2dvNV;
        /* 2241 */ PFNGLVERTEXATTRIBS2FVNVPROC VertexAttribs2fvNV;
        /* 2242 */ PFNGLVERTEXATTRIBS2SVNVPROC VertexAttribs2svNV;
        /* 2243 */ PFNGLVERTEXATTRIBS3DVNVPROC VertexAttribs3dvNV;
        /* 2244 */ PFNGLVERTEXATTRIBS3FVNVPROC VertexAttribs3fvNV;
        /* 2245 */ PFNGLVERTEXATTRIBS3SVNVPROC VertexAttribs3svNV;
        /* 2246 */ PFNGLVERTEXATTRIBS4DVNVPROC VertexAttribs4dvNV;
        /* 2247 */ PFNGLVERTEXATTRIBS4FVNVPROC VertexAttribs4fvNV;
        /* 2248 */ PFNGLVERTEXATTRIBS4SVNVPROC VertexAttribs4svNV;
        /* 2249 */ PFNGLVERTEXATTRIBS4UBVNVPROC VertexAttribs4ubvNV;
        /* 2250 */ PFNGLBEGINVIDEOCAPTURENVPROC BeginVideoCaptureNV;
        /* 2251 */ PFNGLBINDVIDEOCAPTURESTREAMBUFFERNVPROC BindVideoCaptureStreamBufferNV;
        /* 2252 */ PFNGLBINDVIDEOCAPTURESTREAMTEXTURENVPROC BindVideoCaptureStreamTextureNV;
        /* 2253 */ PFNGLENDVIDEOCAPTURENVPROC EndVideoCaptureNV;
        /* 2254 */ PFNGLGETVIDEOCAPTUREIVNVPROC GetVideoCaptureivNV;
        /* 2255 */ PFNGLGETVIDEOCAPTURESTREAMIVNVPROC GetVideoCaptureStreamivNV;
        /* 2256 */ PFNGLGETVIDEOCAPTURESTREAMFVNVPROC GetVideoCaptureStreamfvNV;
        /* 2257 */ PFNGLGETVIDEOCAPTURESTREAMDVNVPROC GetVideoCaptureStreamdvNV;
        /* 2258 */ PFNGLVIDEOCAPTURENVPROC VideoCaptureNV;
        /* 2259 */ PFNGLVIDEOCAPTURESTREAMPARAMETERIVNVPROC VideoCaptureStreamParameterivNV;
        /* 2260 */ PFNGLVIDEOCAPTURESTREAMPARAMETERFVNVPROC VideoCaptureStreamParameterfvNV;
        /* 2261 */ PFNGLVIDEOCAPTURESTREAMPARAMETERDVNVPROC VideoCaptureStreamParameterdvNV;
        /* 2262 */ PFNGLVIEWPORTSWIZZLENVPROC ViewportSwizzleNV;
        /* 2263 */ PFNGLMULTITEXCOORD1BOESPROC MultiTexCoord1bOES;
        /* 2264 */ PFNGLMULTITEXCOORD1BVOESPROC MultiTexCoord1bvOES;
        /* 2265 */ PFNGLMULTITEXCOORD2BOESPROC MultiTexCoord2bOES;
        /* 2266 */ PFNGLMULTITEXCOORD2BVOESPROC MultiTexCoord2bvOES;
        /* 2267 */ PFNGLMULTITEXCOORD3BOESPROC MultiTexCoord3bOES;
        /* 2268 */ PFNGLMULTITEXCOORD3BVOESPROC MultiTexCoord3bvOES;
        /* 2269 */ PFNGLMULTITEXCOORD4BOESPROC MultiTexCoord4bOES;
        /* 2270 */ PFNGLMULTITEXCOORD4BVOESPROC MultiTexCoord4bvOES;
        /* 2271 */ PFNGLTEXCOORD1BOESPROC TexCoord1bOES;
        /* 2272 */ PFNGLTEXCOORD1BVOESPROC TexCoord1bvOES;
        /* 2273 */ PFNGLTEXCOORD2BOESPROC TexCoord2bOES;
        /* 2274 */ PFNGLTEXCOORD2BVOESPROC TexCoord2bvOES;
        /* 2275 */ PFNGLTEXCOORD3BOESPROC TexCoord3bOES;
        /* 2276 */ PFNGLTEXCOORD3BVOESPROC TexCoord3bvOES;
        /* 2277 */ PFNGLTEXCOORD4BOESPROC TexCoord4bOES;
        /* 2278 */ PFNGLTEXCOORD4BVOESPROC TexCoord4bvOES;
        /* 2279 */ PFNGLVERTEX2BOESPROC Vertex2bOES;
        /* 2280 */ PFNGLVERTEX2BVOESPROC Vertex2bvOES;
        /* 2281 */ PFNGLVERTEX3BOESPROC Vertex3bOES;
        /* 2282 */ PFNGLVERTEX3BVOESPROC Vertex3bvOES;
        /* 2283 */ PFNGLVERTEX4BOESPROC Vertex4bOES;
        /* 2284 */ PFNGLVERTEX4BVOESPROC Vertex4bvOES;
        /* 2285 */ PFNGLALPHAFUNCXOESPROC AlphaFuncxOES;
        /* 2286 */ PFNGLCLEARCOLORXOESPROC ClearColorxOES;
        /* 2287 */ PFNGLCLEARDEPTHXOESPROC ClearDepthxOES;
        /* 2288 */ PFNGLCLIPPLANEXOESPROC ClipPlanexOES;
        /* 2289 */ PFNGLCOLOR4XOESPROC Color4xOES;
        /* 2290 */ PFNGLDEPTHRANGEXOESPROC DepthRangexOES;
        /* 2291 */ PFNGLFOGXOESPROC FogxOES;
        /* 2292 */ PFNGLFOGXVOESPROC FogxvOES;
        /* 2293 */ PFNGLFRUSTUMXOESPROC FrustumxOES;
        /* 2294 */ PFNGLGETCLIPPLANEXOESPROC GetClipPlanexOES;
        /* 2295 */ PFNGLGETFIXEDVOESPROC GetFixedvOES;
        /* 2296 */ PFNGLGETTEXENVXVOESPROC GetTexEnvxvOES;
        /* 2297 */ PFNGLGETTEXPARAMETERXVOESPROC GetTexParameterxvOES;
        /* 2298 */ PFNGLLIGHTMODELXOESPROC LightModelxOES;
        /* 2299 */ PFNGLLIGHTMODELXVOESPROC LightModelxvOES;
        /* 2300 */ PFNGLLIGHTXOESPROC LightxOES;
        /* 2301 */ PFNGLLIGHTXVOESPROC LightxvOES;
        /* 2302 */ PFNGLLINEWIDTHXOESPROC LineWidthxOES;
        /* 2303 */ PFNGLLOADMATRIXXOESPROC LoadMatrixxOES;
        /* 2304 */ PFNGLMATERIALXOESPROC MaterialxOES;
        /* 2305 */ PFNGLMATERIALXVOESPROC MaterialxvOES;
        /* 2306 */ PFNGLMULTMATRIXXOESPROC MultMatrixxOES;
        /* 2307 */ PFNGLMULTITEXCOORD4XOESPROC MultiTexCoord4xOES;
        /* 2308 */ PFNGLNORMAL3XOESPROC Normal3xOES;
        /* 2309 */ PFNGLORTHOXOESPROC OrthoxOES;
        /* 2310 */ PFNGLPOINTPARAMETERXVOESPROC PointParameterxvOES;
        /* 2311 */ PFNGLPOINTSIZEXOESPROC PointSizexOES;
        /* 2312 */ PFNGLPOLYGONOFFSETXOESPROC PolygonOffsetxOES;
        /* 2313 */ PFNGLROTATEXOESPROC RotatexOES;
        /* 2314 */ PFNGLSCALEXOESPROC ScalexOES;
        /* 2315 */ PFNGLTEXENVXOESPROC TexEnvxOES;
        /* 2316 */ PFNGLTEXENVXVOESPROC TexEnvxvOES;
        /* 2317 */ PFNGLTEXPARAMETERXOESPROC TexParameterxOES;
        /* 2318 */ PFNGLTEXPARAMETERXVOESPROC TexParameterxvOES;
        /* 2319 */ PFNGLTRANSLATEXOESPROC TranslatexOES;
        /* 2320 */ PFNGLACCUMXOESPROC AccumxOES;
        /* 2321 */ PFNGLBITMAPXOESPROC BitmapxOES;
        /* 2322 */ PFNGLBLENDCOLORXOESPROC BlendColorxOES;
        /* 2323 */ PFNGLCLEARACCUMXOESPROC ClearAccumxOES;
        /* 2324 */ PFNGLCOLOR3XOESPROC Color3xOES;
        /* 2325 */ PFNGLCOLOR3XVOESPROC Color3xvOES;
        /* 2326 */ PFNGLCOLOR4XVOESPROC Color4xvOES;
        /* 2327 */ PFNGLCONVOLUTIONPARAMETERXOESPROC ConvolutionParameterxOES;
        /* 2328 */ PFNGLCONVOLUTIONPARAMETERXVOESPROC ConvolutionParameterxvOES;
        /* 2329 */ PFNGLEVALCOORD1XOESPROC EvalCoord1xOES;
        /* 2330 */ PFNGLEVALCOORD1XVOESPROC EvalCoord1xvOES;
        /* 2331 */ PFNGLEVALCOORD2XOESPROC EvalCoord2xOES;
        /* 2332 */ PFNGLEVALCOORD2XVOESPROC EvalCoord2xvOES;
        /* 2333 */ PFNGLFEEDBACKBUFFERXOESPROC FeedbackBufferxOES;
        /* 2334 */ PFNGLGETCONVOLUTIONPARAMETERXVOESPROC GetConvolutionParameterxvOES;
        /* 2335 */ PFNGLGETHISTOGRAMPARAMETERXVOESPROC GetHistogramParameterxvOES;
        /* 2336 */ PFNGLGETLIGHTXOESPROC GetLightxOES;
        /* 2337 */ PFNGLGETMAPXVOESPROC GetMapxvOES;
        /* 2338 */ PFNGLGETMATERIALXOESPROC GetMaterialxOES;
        /* 2339 */ PFNGLGETPIXELMAPXVPROC GetPixelMapxv;
        /* 2340 */ PFNGLGETTEXGENXVOESPROC GetTexGenxvOES;
        /* 2341 */ PFNGLGETTEXLEVELPARAMETERXVOESPROC GetTexLevelParameterxvOES;
        /* 2342 */ PFNGLINDEXXOESPROC IndexxOES;
        /* 2343 */ PFNGLINDEXXVOESPROC IndexxvOES;
        /* 2344 */ PFNGLLOADTRANSPOSEMATRIXXOESPROC LoadTransposeMatrixxOES;
        /* 2345 */ PFNGLMAP1XOESPROC Map1xOES;
        /* 2346 */ PFNGLMAP2XOESPROC Map2xOES;
        /* 2347 */ PFNGLMAPGRID1XOESPROC MapGrid1xOES;
        /* 2348 */ PFNGLMAPGRID2XOESPROC MapGrid2xOES;
        /* 2349 */ PFNGLMULTTRANSPOSEMATRIXXOESPROC MultTransposeMatrixxOES;
        /* 2350 */ PFNGLMULTITEXCOORD1XOESPROC MultiTexCoord1xOES;
        /* 2351 */ PFNGLMULTITEXCOORD1XVOESPROC MultiTexCoord1xvOES;
        /* 2352 */ PFNGLMULTITEXCOORD2XOESPROC MultiTexCoord2xOES;
        /* 2353 */ PFNGLMULTITEXCOORD2XVOESPROC MultiTexCoord2xvOES;
        /* 2354 */ PFNGLMULTITEXCOORD3XOESPROC MultiTexCoord3xOES;
        /* 2355 */ PFNGLMULTITEXCOORD3XVOESPROC MultiTexCoord3xvOES;
        /* 2356 */ PFNGLMULTITEXCOORD4XVOESPROC MultiTexCoord4xvOES;
        /* 2357 */ PFNGLNORMAL3XVOESPROC Normal3xvOES;
        /* 2358 */ PFNGLPASSTHROUGHXOESPROC PassThroughxOES;
        /* 2359 */ PFNGLPIXELMAPXPROC PixelMapx;
        /* 2360 */ PFNGLPIXELSTOREXPROC PixelStorex;
        /* 2361 */ PFNGLPIXELTRANSFERXOESPROC PixelTransferxOES;
        /* 2362 */ PFNGLPIXELZOOMXOESPROC PixelZoomxOES;
        /* 2363 */ PFNGLPRIORITIZETEXTURESXOESPROC PrioritizeTexturesxOES;
        /* 2364 */ PFNGLRASTERPOS2XOESPROC RasterPos2xOES;
        /* 2365 */ PFNGLRASTERPOS2XVOESPROC RasterPos2xvOES;
        /* 2366 */ PFNGLRASTERPOS3XOESPROC RasterPos3xOES;
        /* 2367 */ PFNGLRASTERPOS3XVOESPROC RasterPos3xvOES;
        /* 2368 */ PFNGLRASTERPOS4XOESPROC RasterPos4xOES;
        /* 2369 */ PFNGLRASTERPOS4XVOESPROC RasterPos4xvOES;
        /* 2370 */ PFNGLRECTXOESPROC RectxOES;
        /* 2371 */ PFNGLRECTXVOESPROC RectxvOES;
        /* 2372 */ PFNGLTEXCOORD1XOESPROC TexCoord1xOES;
        /* 2373 */ PFNGLTEXCOORD1XVOESPROC TexCoord1xvOES;
        /* 2374 */ PFNGLTEXCOORD2XOESPROC TexCoord2xOES;
        /* 2375 */ PFNGLTEXCOORD2XVOESPROC TexCoord2xvOES;
        /* 2376 */ PFNGLTEXCOORD3XOESPROC TexCoord3xOES;
        /* 2377 */ PFNGLTEXCOORD3XVOESPROC TexCoord3xvOES;
        /* 2378 */ PFNGLTEXCOORD4XOESPROC TexCoord4xOES;
        /* 2379 */ PFNGLTEXCOORD4XVOESPROC TexCoord4xvOES;
        /* 2380 */ PFNGLTEXGENXOESPROC TexGenxOES;
        /* 2381 */ PFNGLTEXGENXVOESPROC TexGenxvOES;
        /* 2382 */ PFNGLVERTEX2XOESPROC Vertex2xOES;
        /* 2383 */ PFNGLVERTEX2XVOESPROC Vertex2xvOES;
        /* 2384 */ PFNGLVERTEX3XOESPROC Vertex3xOES;
        /* 2385 */ PFNGLVERTEX3XVOESPROC Vertex3xvOES;
        /* 2386 */ PFNGLVERTEX4XOESPROC Vertex4xOES;
        /* 2387 */ PFNGLVERTEX4XVOESPROC Vertex4xvOES;
        /* 2388 */ PFNGLQUERYMATRIXXOESPROC QueryMatrixxOES;
        /* 2389 */ PFNGLCLEARDEPTHFOESPROC ClearDepthfOES;
        /* 2390 */ PFNGLCLIPPLANEFOESPROC ClipPlanefOES;
        /* 2391 */ PFNGLDEPTHRANGEFOESPROC DepthRangefOES;
        /* 2392 */ PFNGLFRUSTUMFOESPROC FrustumfOES;
        /* 2393 */ PFNGLGETCLIPPLANEFOESPROC GetClipPlanefOES;
        /* 2394 */ PFNGLORTHOFOESPROC OrthofOES;
        /* 2395 */ PFNGLFRAMEBUFFERTEXTUREMULTIVIEWOVRPROC FramebufferTextureMultiviewOVR;
        /* 2396 */ PFNGLNAMEDFRAMEBUFFERTEXTUREMULTIVIEWOVRPROC NamedFramebufferTextureMultiviewOVR;
        /* 2397 */ PFNGLHINTPGIPROC HintPGI;
        /* 2398 */ PFNGLDETAILTEXFUNCSGISPROC DetailTexFuncSGIS;
        /* 2399 */ PFNGLGETDETAILTEXFUNCSGISPROC GetDetailTexFuncSGIS;
        /* 2400 */ PFNGLFOGFUNCSGISPROC FogFuncSGIS;
        /* 2401 */ PFNGLGETFOGFUNCSGISPROC GetFogFuncSGIS;
        /* 2402 */ PFNGLSAMPLEMASKSGISPROC SampleMaskSGIS;
        /* 2403 */ PFNGLSAMPLEPATTERNSGISPROC SamplePatternSGIS;
        /* 2404 */ PFNGLPIXELTEXGENPARAMETERISGISPROC PixelTexGenParameteriSGIS;
        /* 2405 */ PFNGLPIXELTEXGENPARAMETERIVSGISPROC PixelTexGenParameterivSGIS;
        /* 2406 */ PFNGLPIXELTEXGENPARAMETERFSGISPROC PixelTexGenParameterfSGIS;
        /* 2407 */ PFNGLPIXELTEXGENPARAMETERFVSGISPROC PixelTexGenParameterfvSGIS;
        /* 2408 */ PFNGLGETPIXELTEXGENPARAMETERIVSGISPROC GetPixelTexGenParameterivSGIS;
        /* 2409 */ PFNGLGETPIXELTEXGENPARAMETERFVSGISPROC GetPixelTexGenParameterfvSGIS;
        /* 2410 */ PFNGLPOINTPARAMETERFSGISPROC PointParameterfSGIS;
        /* 2411 */ PFNGLPOINTPARAMETERFVSGISPROC PointParameterfvSGIS;
        /* 2412 */ PFNGLSHARPENTEXFUNCSGISPROC SharpenTexFuncSGIS;
        /* 2413 */ PFNGLGETSHARPENTEXFUNCSGISPROC GetSharpenTexFuncSGIS;
        /* 2414 */ PFNGLTEXIMAGE4DSGISPROC TexImage4DSGIS;
        /* 2415 */ PFNGLTEXSUBIMAGE4DSGISPROC TexSubImage4DSGIS;
        /* 2416 */ PFNGLTEXTURECOLORMASKSGISPROC TextureColorMaskSGIS;
        /* 2417 */ PFNGLGETTEXFILTERFUNCSGISPROC GetTexFilterFuncSGIS;
        /* 2418 */ PFNGLTEXFILTERFUNCSGISPROC TexFilterFuncSGIS;
        /* 2419 */ PFNGLASYNCMARKERSGIXPROC AsyncMarkerSGIX;
        /* 2420 */ PFNGLFINISHASYNCSGIXPROC FinishAsyncSGIX;
        /* 2421 */ PFNGLPOLLASYNCSGIXPROC PollAsyncSGIX;
        /* 2422 */ PFNGLGENASYNCMARKERSSGIXPROC GenAsyncMarkersSGIX;
        /* 2423 */ PFNGLDELETEASYNCMARKERSSGIXPROC DeleteAsyncMarkersSGIX;
        /* 2424 */ PFNGLISASYNCMARKERSGIXPROC IsAsyncMarkerSGIX;
        /* 2425 */ PFNGLFLUSHRASTERSGIXPROC FlushRasterSGIX;
        /* 2426 */ PFNGLFRAGMENTCOLORMATERIALSGIXPROC FragmentColorMaterialSGIX;
        /* 2427 */ PFNGLFRAGMENTLIGHTFSGIXPROC FragmentLightfSGIX;
        /* 2428 */ PFNGLFRAGMENTLIGHTFVSGIXPROC FragmentLightfvSGIX;
        /* 2429 */ PFNGLFRAGMENTLIGHTISGIXPROC FragmentLightiSGIX;
        /* 2430 */ PFNGLFRAGMENTLIGHTIVSGIXPROC FragmentLightivSGIX;
        /* 2431 */ PFNGLFRAGMENTLIGHTMODELFSGIXPROC FragmentLightModelfSGIX;
        /* 2432 */ PFNGLFRAGMENTLIGHTMODELFVSGIXPROC FragmentLightModelfvSGIX;
        /* 2433 */ PFNGLFRAGMENTLIGHTMODELISGIXPROC FragmentLightModeliSGIX;
        /* 2434 */ PFNGLFRAGMENTLIGHTMODELIVSGIXPROC FragmentLightModelivSGIX;
        /* 2435 */ PFNGLFRAGMENTMATERIALFSGIXPROC FragmentMaterialfSGIX;
        /* 2436 */ PFNGLFRAGMENTMATERIALFVSGIXPROC FragmentMaterialfvSGIX;
        /* 2437 */ PFNGLFRAGMENTMATERIALISGIXPROC FragmentMaterialiSGIX;
        /* 2438 */ PFNGLFRAGMENTMATERIALIVSGIXPROC FragmentMaterialivSGIX;
        /* 2439 */ PFNGLGETFRAGMENTLIGHTFVSGIXPROC GetFragmentLightfvSGIX;
        /* 2440 */ PFNGLGETFRAGMENTLIGHTIVSGIXPROC GetFragmentLightivSGIX;
        /* 2441 */ PFNGLGETFRAGMENTMATERIALFVSGIXPROC GetFragmentMaterialfvSGIX;
        /* 2442 */ PFNGLGETFRAGMENTMATERIALIVSGIXPROC GetFragmentMaterialivSGIX;
        /* 2443 */ PFNGLLIGHTENVISGIXPROC LightEnviSGIX;
        /* 2444 */ PFNGLFRAMEZOOMSGIXPROC FrameZoomSGIX;
        /* 2445 */ PFNGLIGLOOINTERFACESGIXPROC IglooInterfaceSGIX;
        /* 2446 */ PFNGLGETINSTRUMENTSSGIXPROC GetInstrumentsSGIX;
        /* 2447 */ PFNGLINSTRUMENTSBUFFERSGIXPROC InstrumentsBufferSGIX;
        /* 2448 */ PFNGLPOLLINSTRUMENTSSGIXPROC PollInstrumentsSGIX;
        /* 2449 */ PFNGLREADINSTRUMENTSSGIXPROC ReadInstrumentsSGIX;
        /* 2450 */ PFNGLSTARTINSTRUMENTSSGIXPROC StartInstrumentsSGIX;
        /* 2451 */ PFNGLSTOPINSTRUMENTSSGIXPROC StopInstrumentsSGIX;
        /* 2452 */ PFNGLGETLISTPARAMETERFVSGIXPROC GetListParameterfvSGIX;
        /* 2453 */ PFNGLGETLISTPARAMETERIVSGIXPROC GetListParameterivSGIX;
        /* 2454 */ PFNGLLISTPARAMETERFSGIXPROC ListParameterfSGIX;
        /* 2455 */ PFNGLLISTPARAMETERFVSGIXPROC ListParameterfvSGIX;
        /* 2456 */ PFNGLLISTPARAMETERISGIXPROC ListParameteriSGIX;
        /* 2457 */ PFNGLLISTPARAMETERIVSGIXPROC ListParameterivSGIX;
        /* 2458 */ PFNGLPIXELTEXGENSGIXPROC PixelTexGenSGIX;
        /* 2459 */ PFNGLDEFORMATIONMAP3DSGIXPROC DeformationMap3dSGIX;
        /* 2460 */ PFNGLDEFORMATIONMAP3FSGIXPROC DeformationMap3fSGIX;
        /* 2461 */ PFNGLDEFORMSGIXPROC DeformSGIX;
        /* 2462 */ PFNGLLOADIDENTITYDEFORMATIONMAPSGIXPROC LoadIdentityDeformationMapSGIX;
        /* 2463 */ PFNGLREFERENCEPLANESGIXPROC ReferencePlaneSGIX;
        /* 2464 */ PFNGLSPRITEPARAMETERFSGIXPROC SpriteParameterfSGIX;
        /* 2465 */ PFNGLSPRITEPARAMETERFVSGIXPROC SpriteParameterfvSGIX;
        /* 2466 */ PFNGLSPRITEPARAMETERISGIXPROC SpriteParameteriSGIX;
        /* 2467 */ PFNGLSPRITEPARAMETERIVSGIXPROC SpriteParameterivSGIX;
        /* 2468 */ PFNGLTAGSAMPLEBUFFERSGIXPROC TagSampleBufferSGIX;
        /* 2469 */ PFNGLCOLORTABLESGIPROC ColorTableSGI;
        /* 2470 */ PFNGLCOLORTABLEPARAMETERFVSGIPROC ColorTableParameterfvSGI;
        /* 2471 */ PFNGLCOLORTABLEPARAMETERIVSGIPROC ColorTableParameterivSGI;
        /* 2472 */ PFNGLCOPYCOLORTABLESGIPROC CopyColorTableSGI;
        /* 2473 */ PFNGLGETCOLORTABLESGIPROC GetColorTableSGI;
        /* 2474 */ PFNGLGETCOLORTABLEPARAMETERFVSGIPROC GetColorTableParameterfvSGI;
        /* 2475 */ PFNGLGETCOLORTABLEPARAMETERIVSGIPROC GetColorTableParameterivSGI;
        /* 2476 */ PFNGLFINISHTEXTURESUNXPROC FinishTextureSUNX;
        /* 2477 */ PFNGLGLOBALALPHAFACTORBSUNPROC GlobalAlphaFactorbSUN;
        /* 2478 */ PFNGLGLOBALALPHAFACTORSSUNPROC GlobalAlphaFactorsSUN;
        /* 2479 */ PFNGLGLOBALALPHAFACTORISUNPROC GlobalAlphaFactoriSUN;
        /* 2480 */ PFNGLGLOBALALPHAFACTORFSUNPROC GlobalAlphaFactorfSUN;
        /* 2481 */ PFNGLGLOBALALPHAFACTORDSUNPROC GlobalAlphaFactordSUN;
        /* 2482 */ PFNGLGLOBALALPHAFACTORUBSUNPROC GlobalAlphaFactorubSUN;
        /* 2483 */ PFNGLGLOBALALPHAFACTORUSSUNPROC GlobalAlphaFactorusSUN;
        /* 2484 */ PFNGLGLOBALALPHAFACTORUISUNPROC GlobalAlphaFactoruiSUN;
        /* 2485 */ PFNGLDRAWMESHARRAYSSUNPROC DrawMeshArraysSUN;
        /* 2486 */ PFNGLREPLACEMENTCODEUISUNPROC ReplacementCodeuiSUN;
        /* 2487 */ PFNGLREPLACEMENTCODEUSSUNPROC ReplacementCodeusSUN;
        /* 2488 */ PFNGLREPLACEMENTCODEUBSUNPROC ReplacementCodeubSUN;
        /* 2489 */ PFNGLREPLACEMENTCODEUIVSUNPROC ReplacementCodeuivSUN;
        /* 2490 */ PFNGLREPLACEMENTCODEUSVSUNPROC ReplacementCodeusvSUN;
        /* 2491 */ PFNGLREPLACEMENTCODEUBVSUNPROC ReplacementCodeubvSUN;
        /* 2492 */ PFNGLREPLACEMENTCODEPOINTERSUNPROC ReplacementCodePointerSUN;
        /* 2493 */ PFNGLCOLOR4UBVERTEX2FSUNPROC Color4ubVertex2fSUN;
        /* 2494 */ PFNGLCOLOR4UBVERTEX2FVSUNPROC Color4ubVertex2fvSUN;
        /* 2495 */ PFNGLCOLOR4UBVERTEX3FSUNPROC Color4ubVertex3fSUN;
        /* 2496 */ PFNGLCOLOR4UBVERTEX3FVSUNPROC Color4ubVertex3fvSUN;
        /* 2497 */ PFNGLCOLOR3FVERTEX3FSUNPROC Color3fVertex3fSUN;
        /* 2498 */ PFNGLCOLOR3FVERTEX3FVSUNPROC Color3fVertex3fvSUN;
        /* 2499 */ PFNGLNORMAL3FVERTEX3FSUNPROC Normal3fVertex3fSUN;
        /* 2500 */ PFNGLNORMAL3FVERTEX3FVSUNPROC Normal3fVertex3fvSUN;
        /* 2501 */ PFNGLCOLOR4FNORMAL3FVERTEX3FSUNPROC Color4fNormal3fVertex3fSUN;
        /* 2502 */ PFNGLCOLOR4FNORMAL3FVERTEX3FVSUNPROC Color4fNormal3fVertex3fvSUN;
        /* 2503 */ PFNGLTEXCOORD2FVERTEX3FSUNPROC TexCoord2fVertex3fSUN;
        /* 2504 */ PFNGLTEXCOORD2FVERTEX3FVSUNPROC TexCoord2fVertex3fvSUN;
        /* 2505 */ PFNGLTEXCOORD4FVERTEX4FSUNPROC TexCoord4fVertex4fSUN;
        /* 2506 */ PFNGLTEXCOORD4FVERTEX4FVSUNPROC TexCoord4fVertex4fvSUN;
        /* 2507 */ PFNGLTEXCOORD2FCOLOR4UBVERTEX3FSUNPROC TexCoord2fColor4ubVertex3fSUN;
        /* 2508 */ PFNGLTEXCOORD2FCOLOR4UBVERTEX3FVSUNPROC TexCoord2fColor4ubVertex3fvSUN;
        /* 2509 */ PFNGLTEXCOORD2FCOLOR3FVERTEX3FSUNPROC TexCoord2fColor3fVertex3fSUN;
        /* 2510 */ PFNGLTEXCOORD2FCOLOR3FVERTEX3FVSUNPROC TexCoord2fColor3fVertex3fvSUN;
        /* 2511 */ PFNGLTEXCOORD2FNORMAL3FVERTEX3FSUNPROC TexCoord2fNormal3fVertex3fSUN;
        /* 2512 */ PFNGLTEXCOORD2FNORMAL3FVERTEX3FVSUNPROC TexCoord2fNormal3fVertex3fvSUN;
        /* 2513 */ PFNGLTEXCOORD2FCOLOR4FNORMAL3FVERTEX3FSUNPROC TexCoord2fColor4fNormal3fVertex3fSUN;
        /* 2514 */ PFNGLTEXCOORD2FCOLOR4FNORMAL3FVERTEX3FVSUNPROC TexCoord2fColor4fNormal3fVertex3fvSUN;
        /* 2515 */ PFNGLTEXCOORD4FCOLOR4FNORMAL3FVERTEX4FSUNPROC TexCoord4fColor4fNormal3fVertex4fSUN;
        /* 2516 */ PFNGLTEXCOORD4FCOLOR4FNORMAL3FVERTEX4FVSUNPROC TexCoord4fColor4fNormal3fVertex4fvSUN;
        /* 2517 */ PFNGLREPLACEMENTCODEUIVERTEX3FSUNPROC ReplacementCodeuiVertex3fSUN;
        /* 2518 */ PFNGLREPLACEMENTCODEUIVERTEX3FVSUNPROC ReplacementCodeuiVertex3fvSUN;
        /* 2519 */ PFNGLREPLACEMENTCODEUICOLOR4UBVERTEX3FSUNPROC ReplacementCodeuiColor4ubVertex3fSUN;
        /* 2520 */ PFNGLREPLACEMENTCODEUICOLOR4UBVERTEX3FVSUNPROC ReplacementCodeuiColor4ubVertex3fvSUN;
        /* 2521 */ PFNGLREPLACEMENTCODEUICOLOR3FVERTEX3FSUNPROC ReplacementCodeuiColor3fVertex3fSUN;
        /* 2522 */ PFNGLREPLACEMENTCODEUICOLOR3FVERTEX3FVSUNPROC ReplacementCodeuiColor3fVertex3fvSUN;
        /* 2523 */ PFNGLREPLACEMENTCODEUINORMAL3FVERTEX3FSUNPROC ReplacementCodeuiNormal3fVertex3fSUN;
        /* 2524 */ PFNGLREPLACEMENTCODEUINORMAL3FVERTEX3FVSUNPROC ReplacementCodeuiNormal3fVertex3fvSUN;
        /* 2525 */ PFNGLREPLACEMENTCODEUICOLOR4FNORMAL3FVERTEX3FSUNPROC ReplacementCodeuiColor4fNormal3fVertex3fSUN;
        /* 2526 */ PFNGLREPLACEMENTCODEUICOLOR4FNORMAL3FVERTEX3FVSUNPROC ReplacementCodeuiColor4fNormal3fVertex3fvSUN;
        /* 2527 */ PFNGLREPLACEMENTCODEUITEXCOORD2FVERTEX3FSUNPROC ReplacementCodeuiTexCoord2fVertex3fSUN;
        /* 2528 */ PFNGLREPLACEMENTCODEUITEXCOORD2FVERTEX3FVSUNPROC ReplacementCodeuiTexCoord2fVertex3fvSUN;
        /* 2529 */ PFNGLREPLACEMENTCODEUITEXCOORD2FNORMAL3FVERTEX3FSUNPROC ReplacementCodeuiTexCoord2fNormal3fVertex3fSUN;
        /* 2530 */ PFNGLREPLACEMENTCODEUITEXCOORD2FNORMAL3FVERTEX3FVSUNPROC ReplacementCodeuiTexCoord2fNormal3fVertex3fvSUN;
        /* 2531 */ PFNGLREPLACEMENTCODEUITEXCOORD2FCOLOR4FNORMAL3FVERTEX3FSUNPROC ReplacementCodeuiTexCoord2fColor4fNormal3fVertex3fSUN;
        /* 2532 */ PFNGLREPLACEMENTCODEUITEXCOORD2FCOLOR4FNORMAL3FVERTEX3FVSUNPROC ReplacementCodeuiTexCoord2fColor4fNormal3fVertex3fvSUN;
        /* 2533 */ PFNGLTEXIMAGE2DEXTERNALANGLEPROC TexImage2DExternalANGLE;
        /* 2534 */ PFNGLINVALIDATETEXTUREANGLEPROC InvalidateTextureANGLE;
        /* 2535 */ PFNGLTEXSTORAGEMEMFLAGS2DANGLEPROC TexStorageMemFlags2DANGLE;
        /* 2536 */ PFNGLTEXSTORAGEMEMFLAGS2DMULTISAMPLEANGLEPROC TexStorageMemFlags2DMultisampleANGLE;
        /* 2537 */ PFNGLTEXSTORAGEMEMFLAGS3DANGLEPROC TexStorageMemFlags3DANGLE;
        /* 2538 */ PFNGLTEXSTORAGEMEMFLAGS3DMULTISAMPLEANGLEPROC TexStorageMemFlags3DMultisampleANGLE;
        /* 2539 */ PFNGLIMPORTMEMORYZIRCONHANDLEANGLEPROC ImportMemoryZirconHandleANGLE;
        /* 2540 */ PFNGLIMPORTSEMAPHOREZIRCONHANDLEANGLEPROC ImportSemaphoreZirconHandleANGLE;
        /* 2541 */ PFNGLBLENDBARRIERPROC BlendBarrier;
        /* 2542 */ PFNGLPRIMITIVEBOUNDINGBOXPROC PrimitiveBoundingBox;
        /* 2543 */ PFNGLBLITFRAMEBUFFERANGLEPROC BlitFramebufferANGLE;
        /* 2544 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEANGLEPROC RenderbufferStorageMultisampleANGLE;
        /* 2545 */ PFNGLDRAWARRAYSINSTANCEDANGLEPROC DrawArraysInstancedANGLE;
        /* 2546 */ PFNGLDRAWELEMENTSINSTANCEDANGLEPROC DrawElementsInstancedANGLE;
        /* 2547 */ PFNGLVERTEXATTRIBDIVISORANGLEPROC VertexAttribDivisorANGLE;
        /* 2548 */ PFNGLGETTRANSLATEDSHADERSOURCEANGLEPROC GetTranslatedShaderSourceANGLE;
        /* 2549 */ PFNGLCOPYTEXTURELEVELSAPPLEPROC CopyTextureLevelsAPPLE;
        /* 2550 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEAPPLEPROC RenderbufferStorageMultisampleAPPLE;
        /* 2551 */ PFNGLRESOLVEMULTISAMPLEFRAMEBUFFERAPPLEPROC ResolveMultisampleFramebufferAPPLE;
        /* 2552 */ PFNGLFENCESYNCAPPLEPROC FenceSyncAPPLE;
        /* 2553 */ PFNGLISSYNCAPPLEPROC IsSyncAPPLE;
        /* 2554 */ PFNGLDELETESYNCAPPLEPROC DeleteSyncAPPLE;
        /* 2555 */ PFNGLCLIENTWAITSYNCAPPLEPROC ClientWaitSyncAPPLE;
        /* 2556 */ PFNGLWAITSYNCAPPLEPROC WaitSyncAPPLE;
        /* 2557 */ PFNGLGETINTEGER64VAPPLEPROC GetInteger64vAPPLE;
        /* 2558 */ PFNGLGETSYNCIVAPPLEPROC GetSyncivAPPLE;
        /* 2559 */ PFNGLMAXACTIVESHADERCORESARMPROC MaxActiveShaderCoresARM;
        /* 2560 */ PFNGLDRAWARRAYSINSTANCEDBASEINSTANCEEXTPROC DrawArraysInstancedBaseInstanceEXT;
        /* 2561 */ PFNGLDRAWELEMENTSINSTANCEDBASEINSTANCEEXTPROC DrawElementsInstancedBaseInstanceEXT;
        /* 2562 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXBASEINSTANCEEXTPROC DrawElementsInstancedBaseVertexBaseInstanceEXT;
        /* 2563 */ PFNGLBINDFRAGDATALOCATIONINDEXEDEXTPROC BindFragDataLocationIndexedEXT;
        /* 2564 */ PFNGLGETPROGRAMRESOURCELOCATIONINDEXEXTPROC GetProgramResourceLocationIndexEXT;
        /* 2565 */ PFNGLGETFRAGDATAINDEXEXTPROC GetFragDataIndexEXT;
        /* 2566 */ PFNGLBUFFERSTORAGEEXTPROC BufferStorageEXT;
        /* 2567 */ PFNGLCLEARTEXIMAGEEXTPROC ClearTexImageEXT;
        /* 2568 */ PFNGLCLEARTEXSUBIMAGEEXTPROC ClearTexSubImageEXT;
        /* 2569 */ PFNGLCLIPCONTROLEXTPROC ClipControlEXT;
        /* 2570 */ PFNGLCOPYIMAGESUBDATAEXTPROC CopyImageSubDataEXT;
        /* 2571 */ PFNGLDISCARDFRAMEBUFFEREXTPROC DiscardFramebufferEXT;
        /* 2572 */ PFNGLGENQUERIESEXTPROC GenQueriesEXT;
        /* 2573 */ PFNGLDELETEQUERIESEXTPROC DeleteQueriesEXT;
        /* 2574 */ PFNGLISQUERYEXTPROC IsQueryEXT;
        /* 2575 */ PFNGLBEGINQUERYEXTPROC BeginQueryEXT;
        /* 2576 */ PFNGLENDQUERYEXTPROC EndQueryEXT;
        /* 2577 */ PFNGLQUERYCOUNTEREXTPROC QueryCounterEXT;
        /* 2578 */ PFNGLGETQUERYIVEXTPROC GetQueryivEXT;
        /* 2579 */ PFNGLGETQUERYOBJECTIVEXTPROC GetQueryObjectivEXT;
        /* 2580 */ PFNGLGETQUERYOBJECTUIVEXTPROC GetQueryObjectuivEXT;
        /* 2581 */ PFNGLGETINTEGER64VEXTPROC GetInteger64vEXT;
        /* 2582 */ PFNGLDRAWBUFFERSEXTPROC DrawBuffersEXT;
        /* 2583 */ PFNGLENABLEIEXTPROC EnableiEXT;
        /* 2584 */ PFNGLDISABLEIEXTPROC DisableiEXT;
        /* 2585 */ PFNGLBLENDEQUATIONIEXTPROC BlendEquationiEXT;
        /* 2586 */ PFNGLBLENDEQUATIONSEPARATEIEXTPROC BlendEquationSeparateiEXT;
        /* 2587 */ PFNGLBLENDFUNCIEXTPROC BlendFunciEXT;
        /* 2588 */ PFNGLBLENDFUNCSEPARATEIEXTPROC BlendFuncSeparateiEXT;
        /* 2589 */ PFNGLCOLORMASKIEXTPROC ColorMaskiEXT;
        /* 2590 */ PFNGLISENABLEDIEXTPROC IsEnablediEXT;
        /* 2591 */ PFNGLDRAWELEMENTSBASEVERTEXEXTPROC DrawElementsBaseVertexEXT;
        /* 2592 */ PFNGLDRAWRANGEELEMENTSBASEVERTEXEXTPROC DrawRangeElementsBaseVertexEXT;
        /* 2593 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXEXTPROC DrawElementsInstancedBaseVertexEXT;
        /* 2594 */ PFNGLMULTIDRAWELEMENTSBASEVERTEXEXTPROC MultiDrawElementsBaseVertexEXT;
        /* 2595 */ PFNGLDRAWTRANSFORMFEEDBACKEXTPROC DrawTransformFeedbackEXT;
        /* 2596 */ PFNGLDRAWTRANSFORMFEEDBACKINSTANCEDEXTPROC DrawTransformFeedbackInstancedEXT;
        /* 2597 */ PFNGLGETFRAGMENTSHADINGRATESEXTPROC GetFragmentShadingRatesEXT;
        /* 2598 */ PFNGLSHADINGRATEEXTPROC ShadingRateEXT;
        /* 2599 */ PFNGLSHADINGRATECOMBINEROPSEXTPROC ShadingRateCombinerOpsEXT;
        /* 2600 */ PFNGLFRAMEBUFFERSHADINGRATEEXTPROC FramebufferShadingRateEXT;
        /* 2601 */ PFNGLVERTEXATTRIBDIVISOREXTPROC VertexAttribDivisorEXT;
        /* 2602 */ PFNGLMAPBUFFERRANGEEXTPROC MapBufferRangeEXT;
        /* 2603 */ PFNGLFLUSHMAPPEDBUFFERRANGEEXTPROC FlushMappedBufferRangeEXT;
        /* 2604 */ PFNGLMULTIDRAWARRAYSINDIRECTEXTPROC MultiDrawArraysIndirectEXT;
        /* 2605 */ PFNGLMULTIDRAWELEMENTSINDIRECTEXTPROC MultiDrawElementsIndirectEXT;
        /* 2606 */ PFNGLFRAMEBUFFERTEXTURE2DMULTISAMPLEEXTPROC FramebufferTexture2DMultisampleEXT;
        /* 2607 */ PFNGLREADBUFFERINDEXEDEXTPROC ReadBufferIndexedEXT;
        /* 2608 */ PFNGLDRAWBUFFERSINDEXEDEXTPROC DrawBuffersIndexedEXT;
        /* 2609 */ PFNGLGETINTEGERI_VEXTPROC GetIntegeri_vEXT;
        /* 2610 */ PFNGLPRIMITIVEBOUNDINGBOXEXTPROC PrimitiveBoundingBoxEXT;
        /* 2611 */ PFNGLGETGRAPHICSRESETSTATUSEXTPROC GetGraphicsResetStatusEXT;
        /* 2612 */ PFNGLREADNPIXELSEXTPROC ReadnPixelsEXT;
        /* 2613 */ PFNGLGETNUNIFORMFVEXTPROC GetnUniformfvEXT;
        /* 2614 */ PFNGLGETNUNIFORMIVEXTPROC GetnUniformivEXT;
        /* 2615 */ PFNGLACTIVESHADERPROGRAMEXTPROC ActiveShaderProgramEXT;
        /* 2616 */ PFNGLBINDPROGRAMPIPELINEEXTPROC BindProgramPipelineEXT;
        /* 2617 */ PFNGLCREATESHADERPROGRAMVEXTPROC CreateShaderProgramvEXT;
        /* 2618 */ PFNGLDELETEPROGRAMPIPELINESEXTPROC DeleteProgramPipelinesEXT;
        /* 2619 */ PFNGLGENPROGRAMPIPELINESEXTPROC GenProgramPipelinesEXT;
        /* 2620 */ PFNGLGETPROGRAMPIPELINEINFOLOGEXTPROC GetProgramPipelineInfoLogEXT;
        /* 2621 */ PFNGLGETPROGRAMPIPELINEIVEXTPROC GetProgramPipelineivEXT;
        /* 2622 */ PFNGLISPROGRAMPIPELINEEXTPROC IsProgramPipelineEXT;
        /* 2623 */ PFNGLUSEPROGRAMSTAGESEXTPROC UseProgramStagesEXT;
        /* 2624 */ PFNGLVALIDATEPROGRAMPIPELINEEXTPROC ValidateProgramPipelineEXT;
        /* 2625 */ PFNGLFRAMEBUFFERPIXELLOCALSTORAGESIZEEXTPROC FramebufferPixelLocalStorageSizeEXT;
        /* 2626 */ PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGESIZEEXTPROC GetFramebufferPixelLocalStorageSizeEXT;
        /* 2627 */ PFNGLCLEARPIXELLOCALSTORAGEUIEXTPROC ClearPixelLocalStorageuiEXT;
        /* 2628 */ PFNGLTEXPAGECOMMITMENTEXTPROC TexPageCommitmentEXT;
        /* 2629 */ PFNGLPATCHPARAMETERIEXTPROC PatchParameteriEXT;
        /* 2630 */ PFNGLSAMPLERPARAMETERIIVEXTPROC SamplerParameterIivEXT;
        /* 2631 */ PFNGLSAMPLERPARAMETERIUIVEXTPROC SamplerParameterIuivEXT;
        /* 2632 */ PFNGLGETSAMPLERPARAMETERIIVEXTPROC GetSamplerParameterIivEXT;
        /* 2633 */ PFNGLGETSAMPLERPARAMETERIUIVEXTPROC GetSamplerParameterIuivEXT;
        /* 2634 */ PFNGLTEXBUFFERRANGEEXTPROC TexBufferRangeEXT;
        /* 2635 */ PFNGLTEXSTORAGEATTRIBS2DEXTPROC TexStorageAttribs2DEXT;
        /* 2636 */ PFNGLTEXSTORAGEATTRIBS3DEXTPROC TexStorageAttribs3DEXT;
        /* 2637 */ PFNGLTEXTUREVIEWEXTPROC TextureViewEXT;
        /* 2638 */ PFNGLGETTEXTUREHANDLEIMGPROC GetTextureHandleIMG;
        /* 2639 */ PFNGLGETTEXTURESAMPLERHANDLEIMGPROC GetTextureSamplerHandleIMG;
        /* 2640 */ PFNGLUNIFORMHANDLEUI64IMGPROC UniformHandleui64IMG;
        /* 2641 */ PFNGLUNIFORMHANDLEUI64VIMGPROC UniformHandleui64vIMG;
        /* 2642 */ PFNGLPROGRAMUNIFORMHANDLEUI64IMGPROC ProgramUniformHandleui64IMG;
        /* 2643 */ PFNGLPROGRAMUNIFORMHANDLEUI64VIMGPROC ProgramUniformHandleui64vIMG;
        /* 2644 */ PFNGLFRAMEBUFFERTEXTURE2DDOWNSAMPLEIMGPROC FramebufferTexture2DDownsampleIMG;
        /* 2645 */ PFNGLFRAMEBUFFERTEXTURELAYERDOWNSAMPLEIMGPROC FramebufferTextureLayerDownsampleIMG;
        /* 2646 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEIMGPROC RenderbufferStorageMultisampleIMG;
        /* 2647 */ PFNGLFRAMEBUFFERTEXTURE2DMULTISAMPLEIMGPROC FramebufferTexture2DMultisampleIMG;
        /* 2648 */ PFNGLDEBUGMESSAGECONTROLKHRPROC DebugMessageControlKHR;
        /* 2649 */ PFNGLDEBUGMESSAGEINSERTKHRPROC DebugMessageInsertKHR;
        /* 2650 */ PFNGLDEBUGMESSAGECALLBACKKHRPROC DebugMessageCallbackKHR;
        /* 2651 */ PFNGLGETDEBUGMESSAGELOGKHRPROC GetDebugMessageLogKHR;
        /* 2652 */ PFNGLPUSHDEBUGGROUPKHRPROC PushDebugGroupKHR;
        /* 2653 */ PFNGLPOPDEBUGGROUPKHRPROC PopDebugGroupKHR;
        /* 2654 */ PFNGLOBJECTLABELKHRPROC ObjectLabelKHR;
        /* 2655 */ PFNGLGETOBJECTLABELKHRPROC GetObjectLabelKHR;
        /* 2656 */ PFNGLOBJECTPTRLABELKHRPROC ObjectPtrLabelKHR;
        /* 2657 */ PFNGLGETOBJECTPTRLABELKHRPROC GetObjectPtrLabelKHR;
        /* 2658 */ PFNGLGETPOINTERVKHRPROC GetPointervKHR;
        /* 2659 */ PFNGLGETGRAPHICSRESETSTATUSKHRPROC GetGraphicsResetStatusKHR;
        /* 2660 */ PFNGLREADNPIXELSKHRPROC ReadnPixelsKHR;
        /* 2661 */ PFNGLGETNUNIFORMFVKHRPROC GetnUniformfvKHR;
        /* 2662 */ PFNGLGETNUNIFORMIVKHRPROC GetnUniformivKHR;
        /* 2663 */ PFNGLGETNUNIFORMUIVKHRPROC GetnUniformuivKHR;
        /* 2664 */ PFNGLCOPYBUFFERSUBDATANVPROC CopyBufferSubDataNV;
        /* 2665 */ PFNGLCOVERAGEMASKNVPROC CoverageMaskNV;
        /* 2666 */ PFNGLCOVERAGEOPERATIONNVPROC CoverageOperationNV;
        /* 2667 */ PFNGLDRAWBUFFERSNVPROC DrawBuffersNV;
        /* 2668 */ PFNGLDRAWARRAYSINSTANCEDNVPROC DrawArraysInstancedNV;
        /* 2669 */ PFNGLDRAWELEMENTSINSTANCEDNVPROC DrawElementsInstancedNV;
        /* 2670 */ PFNGLBLITFRAMEBUFFERNVPROC BlitFramebufferNV;
        /* 2671 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLENVPROC RenderbufferStorageMultisampleNV;
        /* 2672 */ PFNGLVERTEXATTRIBDIVISORNVPROC VertexAttribDivisorNV;
        /* 2673 */ PFNGLUNIFORMMATRIX2X3FVNVPROC UniformMatrix2x3fvNV;
        /* 2674 */ PFNGLUNIFORMMATRIX3X2FVNVPROC UniformMatrix3x2fvNV;
        /* 2675 */ PFNGLUNIFORMMATRIX2X4FVNVPROC UniformMatrix2x4fvNV;
        /* 2676 */ PFNGLUNIFORMMATRIX4X2FVNVPROC UniformMatrix4x2fvNV;
        /* 2677 */ PFNGLUNIFORMMATRIX3X4FVNVPROC UniformMatrix3x4fvNV;
        /* 2678 */ PFNGLUNIFORMMATRIX4X3FVNVPROC UniformMatrix4x3fvNV;
        /* 2679 */ PFNGLPOLYGONMODENVPROC PolygonModeNV;
        /* 2680 */ PFNGLREADBUFFERNVPROC ReadBufferNV;
        /* 2681 */ PFNGLVIEWPORTARRAYVNVPROC ViewportArrayvNV;
        /* 2682 */ PFNGLVIEWPORTINDEXEDFNVPROC ViewportIndexedfNV;
        /* 2683 */ PFNGLVIEWPORTINDEXEDFVNVPROC ViewportIndexedfvNV;
        /* 2684 */ PFNGLSCISSORARRAYVNVPROC ScissorArrayvNV;
        /* 2685 */ PFNGLSCISSORINDEXEDNVPROC ScissorIndexedNV;
        /* 2686 */ PFNGLSCISSORINDEXEDVNVPROC ScissorIndexedvNV;
        /* 2687 */ PFNGLDEPTHRANGEARRAYFVNVPROC DepthRangeArrayfvNV;
        /* 2688 */ PFNGLDEPTHRANGEINDEXEDFNVPROC DepthRangeIndexedfNV;
        /* 2689 */ PFNGLGETFLOATI_VNVPROC GetFloati_vNV;
        /* 2690 */ PFNGLENABLEINVPROC EnableiNV;
        /* 2691 */ PFNGLDISABLEINVPROC DisableiNV;
        /* 2692 */ PFNGLISENABLEDINVPROC IsEnablediNV;
        /* 2693 */ PFNGLEGLIMAGETARGETTEXTURE2DOESPROC EGLImageTargetTexture2DOES;
        /* 2694 */ PFNGLEGLIMAGETARGETRENDERBUFFERSTORAGEOESPROC EGLImageTargetRenderbufferStorageOES;
        /* 2695 */ PFNGLCOPYIMAGESUBDATAOESPROC CopyImageSubDataOES;
        /* 2696 */ PFNGLENABLEIOESPROC EnableiOES;
        /* 2697 */ PFNGLDISABLEIOESPROC DisableiOES;
        /* 2698 */ PFNGLBLENDEQUATIONIOESPROC BlendEquationiOES;
        /* 2699 */ PFNGLBLENDEQUATIONSEPARATEIOESPROC BlendEquationSeparateiOES;
        /* 2700 */ PFNGLBLENDFUNCIOESPROC BlendFunciOES;
        /* 2701 */ PFNGLBLENDFUNCSEPARATEIOESPROC BlendFuncSeparateiOES;
        /* 2702 */ PFNGLCOLORMASKIOESPROC ColorMaskiOES;
        /* 2703 */ PFNGLISENABLEDIOESPROC IsEnablediOES;
        /* 2704 */ PFNGLDRAWELEMENTSBASEVERTEXOESPROC DrawElementsBaseVertexOES;
        /* 2705 */ PFNGLDRAWRANGEELEMENTSBASEVERTEXOESPROC DrawRangeElementsBaseVertexOES;
        /* 2706 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXOESPROC DrawElementsInstancedBaseVertexOES;
        /* 2707 */ PFNGLFRAMEBUFFERTEXTUREOESPROC FramebufferTextureOES;
        /* 2708 */ PFNGLGETPROGRAMBINARYOESPROC GetProgramBinaryOES;
        /* 2709 */ PFNGLPROGRAMBINARYOESPROC ProgramBinaryOES;
        /* 2710 */ PFNGLMAPBUFFEROESPROC MapBufferOES;
        /* 2711 */ PFNGLUNMAPBUFFEROESPROC UnmapBufferOES;
        /* 2712 */ PFNGLGETBUFFERPOINTERVOESPROC GetBufferPointervOES;
        /* 2713 */ PFNGLPRIMITIVEBOUNDINGBOXOESPROC PrimitiveBoundingBoxOES;
        /* 2714 */ PFNGLMINSAMPLESHADINGOESPROC MinSampleShadingOES;
        /* 2715 */ PFNGLPATCHPARAMETERIOESPROC PatchParameteriOES;
        /* 2716 */ PFNGLTEXIMAGE3DOESPROC TexImage3DOES;
        /* 2717 */ PFNGLTEXSUBIMAGE3DOESPROC TexSubImage3DOES;
        /* 2718 */ PFNGLCOPYTEXSUBIMAGE3DOESPROC CopyTexSubImage3DOES;
        /* 2719 */ PFNGLCOMPRESSEDTEXIMAGE3DOESPROC CompressedTexImage3DOES;
        /* 2720 */ PFNGLCOMPRESSEDTEXSUBIMAGE3DOESPROC CompressedTexSubImage3DOES;
        /* 2721 */ PFNGLFRAMEBUFFERTEXTURE3DOESPROC FramebufferTexture3DOES;
        /* 2722 */ PFNGLTEXPARAMETERIIVOESPROC TexParameterIivOES;
        /* 2723 */ PFNGLTEXPARAMETERIUIVOESPROC TexParameterIuivOES;
        /* 2724 */ PFNGLGETTEXPARAMETERIIVOESPROC GetTexParameterIivOES;
        /* 2725 */ PFNGLGETTEXPARAMETERIUIVOESPROC GetTexParameterIuivOES;
        /* 2726 */ PFNGLSAMPLERPARAMETERIIVOESPROC SamplerParameterIivOES;
        /* 2727 */ PFNGLSAMPLERPARAMETERIUIVOESPROC SamplerParameterIuivOES;
        /* 2728 */ PFNGLGETSAMPLERPARAMETERIIVOESPROC GetSamplerParameterIivOES;
        /* 2729 */ PFNGLGETSAMPLERPARAMETERIUIVOESPROC GetSamplerParameterIuivOES;
        /* 2730 */ PFNGLTEXBUFFEROESPROC TexBufferOES;
        /* 2731 */ PFNGLTEXBUFFERRANGEOESPROC TexBufferRangeOES;
        /* 2732 */ PFNGLTEXSTORAGE3DMULTISAMPLEOESPROC TexStorage3DMultisampleOES;
        /* 2733 */ PFNGLTEXTUREVIEWOESPROC TextureViewOES;
        /* 2734 */ PFNGLBINDVERTEXARRAYOESPROC BindVertexArrayOES;
        /* 2735 */ PFNGLDELETEVERTEXARRAYSOESPROC DeleteVertexArraysOES;
        /* 2736 */ PFNGLGENVERTEXARRAYSOESPROC GenVertexArraysOES;
        /* 2737 */ PFNGLISVERTEXARRAYOESPROC IsVertexArrayOES;
        /* 2738 */ PFNGLVIEWPORTARRAYVOESPROC ViewportArrayvOES;
        /* 2739 */ PFNGLVIEWPORTINDEXEDFOESPROC ViewportIndexedfOES;
        /* 2740 */ PFNGLVIEWPORTINDEXEDFVOESPROC ViewportIndexedfvOES;
        /* 2741 */ PFNGLSCISSORARRAYVOESPROC ScissorArrayvOES;
        /* 2742 */ PFNGLSCISSORINDEXEDOESPROC ScissorIndexedOES;
        /* 2743 */ PFNGLSCISSORINDEXEDVOESPROC ScissorIndexedvOES;
        /* 2744 */ PFNGLDEPTHRANGEARRAYFVOESPROC DepthRangeArrayfvOES;
        /* 2745 */ PFNGLDEPTHRANGEINDEXEDFOESPROC DepthRangeIndexedfOES;
        /* 2746 */ PFNGLGETFLOATI_VOESPROC GetFloati_vOES;
        /* 2747 */ PFNGLFRAMEBUFFERTEXTUREMULTISAMPLEMULTIVIEWOVRPROC FramebufferTextureMultisampleMultiviewOVR;
        /* 2748 */ PFNGLALPHAFUNCQCOMPROC AlphaFuncQCOM;
        /* 2749 */ PFNGLGETDRIVERCONTROLSQCOMPROC GetDriverControlsQCOM;
        /* 2750 */ PFNGLGETDRIVERCONTROLSTRINGQCOMPROC GetDriverControlStringQCOM;
        /* 2751 */ PFNGLENABLEDRIVERCONTROLQCOMPROC EnableDriverControlQCOM;
        /* 2752 */ PFNGLDISABLEDRIVERCONTROLQCOMPROC DisableDriverControlQCOM;
        /* 2753 */ PFNGLEXTGETTEXTURESQCOMPROC ExtGetTexturesQCOM;
        /* 2754 */ PFNGLEXTGETBUFFERSQCOMPROC ExtGetBuffersQCOM;
        /* 2755 */ PFNGLEXTGETRENDERBUFFERSQCOMPROC ExtGetRenderbuffersQCOM;
        /* 2756 */ PFNGLEXTGETFRAMEBUFFERSQCOMPROC ExtGetFramebuffersQCOM;
        /* 2757 */ PFNGLEXTGETTEXLEVELPARAMETERIVQCOMPROC ExtGetTexLevelParameterivQCOM;
        /* 2758 */ PFNGLEXTTEXOBJECTSTATEOVERRIDEIQCOMPROC ExtTexObjectStateOverrideiQCOM;
        /* 2759 */ PFNGLEXTGETTEXSUBIMAGEQCOMPROC ExtGetTexSubImageQCOM;
        /* 2760 */ PFNGLEXTGETBUFFERPOINTERVQCOMPROC ExtGetBufferPointervQCOM;
        /* 2761 */ PFNGLEXTGETSHADERSQCOMPROC ExtGetShadersQCOM;
        /* 2762 */ PFNGLEXTGETPROGRAMSQCOMPROC ExtGetProgramsQCOM;
        /* 2763 */ PFNGLEXTISPROGRAMBINARYQCOMPROC ExtIsProgramBinaryQCOM;
        /* 2764 */ PFNGLEXTGETPROGRAMBINARYSOURCEQCOMPROC ExtGetProgramBinarySourceQCOM;
        /* 2765 */ PFNGLFRAMEBUFFERFOVEATIONCONFIGQCOMPROC FramebufferFoveationConfigQCOM;
        /* 2766 */ PFNGLFRAMEBUFFERFOVEATIONPARAMETERSQCOMPROC FramebufferFoveationParametersQCOM;
        /* 2767 */ PFNGLTEXESTIMATEMOTIONQCOMPROC TexEstimateMotionQCOM;
        /* 2768 */ PFNGLTEXESTIMATEMOTIONREGIONSQCOMPROC TexEstimateMotionRegionsQCOM;
        /* 2769 */ PFNGLEXTRAPOLATETEX2DQCOMPROC ExtrapolateTex2DQCOM;
        /* 2770 */ PFNGLTEXTUREFOVEATIONPARAMETERSQCOMPROC TextureFoveationParametersQCOM;
        /* 2771 */ PFNGLFRAMEBUFFERFETCHBARRIERQCOMPROC FramebufferFetchBarrierQCOM;
        /* 2772 */ PFNGLSHADINGRATEQCOMPROC ShadingRateQCOM;
        /* 2773 */ PFNGLSTARTTILINGQCOMPROC StartTilingQCOM;
        /* 2774 */ PFNGLENDTILINGQCOMPROC EndTilingQCOM;
        /* 2775 */ PFNGLBINDUNIFORMLOCATIONCHROMIUMPROC BindUniformLocationCHROMIUM;
        /* 2776 */ PFNGLCOVERAGEMODULATIONCHROMIUMPROC CoverageModulationCHROMIUM;
        /* 2777 */ PFNGLCOPYTEXTURECHROMIUMPROC CopyTextureCHROMIUM;
        /* 2778 */ PFNGLCOPYSUBTEXTURECHROMIUMPROC CopySubTextureCHROMIUM;
        /* 2779 */ PFNGLCOMPRESSEDCOPYTEXTURECHROMIUMPROC CompressedCopyTextureCHROMIUM;
        /* 2780 */ PFNGLREQUESTEXTENSIONANGLEPROC RequestExtensionANGLE;
        /* 2781 */ PFNGLDISABLEEXTENSIONANGLEPROC DisableExtensionANGLE;
        /* 2782 */ PFNGLACQUIRETEXTURESANGLEPROC AcquireTexturesANGLE;
        /* 2783 */ PFNGLRELEASETEXTURESANGLEPROC ReleaseTexturesANGLE;
        /* 2784 */ PFNGLGETBOOLEANVROBUSTANGLEPROC GetBooleanvRobustANGLE;
        /* 2785 */ PFNGLGETBUFFERPARAMETERIVROBUSTANGLEPROC GetBufferParameterivRobustANGLE;
        /* 2786 */ PFNGLGETBUFFERPARAMETERI64VROBUSTANGLEPROC GetBufferParameteri64vRobustANGLE;
        /* 2787 */ PFNGLGETFLOATVROBUSTANGLEPROC GetFloatvRobustANGLE;
        /* 2788 */ PFNGLGETFRAMEBUFFERATTACHMENTPARAMETERIVROBUSTANGLEPROC GetFramebufferAttachmentParameterivRobustANGLE;
        /* 2789 */ PFNGLGETINTEGERVROBUSTANGLEPROC GetIntegervRobustANGLE;
        /* 2790 */ PFNGLGETPROGRAMIVROBUSTANGLEPROC GetProgramivRobustANGLE;
        /* 2791 */ PFNGLGETRENDERBUFFERPARAMETERIVROBUSTANGLEPROC GetRenderbufferParameterivRobustANGLE;
        /* 2792 */ PFNGLGETSHADERIVROBUSTANGLEPROC GetShaderivRobustANGLE;
        /* 2793 */ PFNGLGETTEXPARAMETERFVROBUSTANGLEPROC GetTexParameterfvRobustANGLE;
        /* 2794 */ PFNGLGETTEXPARAMETERIVROBUSTANGLEPROC GetTexParameterivRobustANGLE;
        /* 2795 */ PFNGLGETUNIFORMFVROBUSTANGLEPROC GetUniformfvRobustANGLE;
        /* 2796 */ PFNGLGETUNIFORMIVROBUSTANGLEPROC GetUniformivRobustANGLE;
        /* 2797 */ PFNGLGETVERTEXATTRIBFVROBUSTANGLEPROC GetVertexAttribfvRobustANGLE;
        /* 2798 */ PFNGLGETVERTEXATTRIBIVROBUSTANGLEPROC GetVertexAttribivRobustANGLE;
        /* 2799 */ PFNGLGETVERTEXATTRIBPOINTERVROBUSTANGLEPROC GetVertexAttribPointervRobustANGLE;
        /* 2800 */ PFNGLREADPIXELSROBUSTANGLEPROC ReadPixelsRobustANGLE;
        /* 2801 */ PFNGLTEXIMAGE2DROBUSTANGLEPROC TexImage2DRobustANGLE;
        /* 2802 */ PFNGLTEXPARAMETERFVROBUSTANGLEPROC TexParameterfvRobustANGLE;
        /* 2803 */ PFNGLTEXPARAMETERIVROBUSTANGLEPROC TexParameterivRobustANGLE;
        /* 2804 */ PFNGLTEXSUBIMAGE2DROBUSTANGLEPROC TexSubImage2DRobustANGLE;
        /* 2805 */ PFNGLTEXIMAGE3DROBUSTANGLEPROC TexImage3DRobustANGLE;
        /* 2806 */ PFNGLTEXSUBIMAGE3DROBUSTANGLEPROC TexSubImage3DRobustANGLE;
        /* 2807 */ PFNGLCOMPRESSEDTEXIMAGE2DROBUSTANGLEPROC CompressedTexImage2DRobustANGLE;
        /* 2808 */ PFNGLCOMPRESSEDTEXSUBIMAGE2DROBUSTANGLEPROC CompressedTexSubImage2DRobustANGLE;
        /* 2809 */ PFNGLCOMPRESSEDTEXIMAGE3DROBUSTANGLEPROC CompressedTexImage3DRobustANGLE;
        /* 2810 */ PFNGLCOMPRESSEDTEXSUBIMAGE3DROBUSTANGLEPROC CompressedTexSubImage3DRobustANGLE;
        /* 2811 */ PFNGLGETQUERYIVROBUSTANGLEPROC GetQueryivRobustANGLE;
        /* 2812 */ PFNGLGETQUERYOBJECTUIVROBUSTANGLEPROC GetQueryObjectuivRobustANGLE;
        /* 2813 */ PFNGLGETBUFFERPOINTERVROBUSTANGLEPROC GetBufferPointervRobustANGLE;
        /* 2814 */ PFNGLGETINTEGERI_VROBUSTANGLEPROC GetIntegeri_vRobustANGLE;
        /* 2815 */ PFNGLGETINTERNALFORMATIVROBUSTANGLEPROC GetInternalformativRobustANGLE;
        /* 2816 */ PFNGLGETVERTEXATTRIBIIVROBUSTANGLEPROC GetVertexAttribIivRobustANGLE;
        /* 2817 */ PFNGLGETVERTEXATTRIBIUIVROBUSTANGLEPROC GetVertexAttribIuivRobustANGLE;
        /* 2818 */ PFNGLGETUNIFORMUIVROBUSTANGLEPROC GetUniformuivRobustANGLE;
        /* 2819 */ PFNGLGETACTIVEUNIFORMBLOCKIVROBUSTANGLEPROC GetActiveUniformBlockivRobustANGLE;
        /* 2820 */ PFNGLGETINTEGER64VROBUSTANGLEPROC GetInteger64vRobustANGLE;
        /* 2821 */ PFNGLGETINTEGER64I_VROBUSTANGLEPROC GetInteger64i_vRobustANGLE;
        /* 2822 */ PFNGLSAMPLERPARAMETERIVROBUSTANGLEPROC SamplerParameterivRobustANGLE;
        /* 2823 */ PFNGLSAMPLERPARAMETERFVROBUSTANGLEPROC SamplerParameterfvRobustANGLE;
        /* 2824 */ PFNGLGETSAMPLERPARAMETERIVROBUSTANGLEPROC GetSamplerParameterivRobustANGLE;
        /* 2825 */ PFNGLGETSAMPLERPARAMETERFVROBUSTANGLEPROC GetSamplerParameterfvRobustANGLE;
        /* 2826 */ PFNGLGETFRAMEBUFFERPARAMETERIVROBUSTANGLEPROC GetFramebufferParameterivRobustANGLE;
        /* 2827 */ PFNGLGETPROGRAMINTERFACEIVROBUSTANGLEPROC GetProgramInterfaceivRobustANGLE;
        /* 2828 */ PFNGLGETBOOLEANI_VROBUSTANGLEPROC GetBooleani_vRobustANGLE;
        /* 2829 */ PFNGLGETMULTISAMPLEFVROBUSTANGLEPROC GetMultisamplefvRobustANGLE;
        /* 2830 */ PFNGLGETTEXLEVELPARAMETERIVROBUSTANGLEPROC GetTexLevelParameterivRobustANGLE;
        /* 2831 */ PFNGLGETTEXLEVELPARAMETERFVROBUSTANGLEPROC GetTexLevelParameterfvRobustANGLE;
        /* 2832 */ PFNGLGETPOINTERVROBUSTANGLEROBUSTANGLEPROC GetPointervRobustANGLERobustANGLE;
        /* 2833 */ PFNGLREADNPIXELSROBUSTANGLEPROC ReadnPixelsRobustANGLE;
        /* 2834 */ PFNGLGETNUNIFORMFVROBUSTANGLEPROC GetnUniformfvRobustANGLE;
        /* 2835 */ PFNGLGETNUNIFORMIVROBUSTANGLEPROC GetnUniformivRobustANGLE;
        /* 2836 */ PFNGLGETNUNIFORMUIVROBUSTANGLEPROC GetnUniformuivRobustANGLE;
        /* 2837 */ PFNGLTEXPARAMETERIIVROBUSTANGLEPROC TexParameterIivRobustANGLE;
        /* 2838 */ PFNGLTEXPARAMETERIUIVROBUSTANGLEPROC TexParameterIuivRobustANGLE;
        /* 2839 */ PFNGLGETTEXPARAMETERIIVROBUSTANGLEPROC GetTexParameterIivRobustANGLE;
        /* 2840 */ PFNGLGETTEXPARAMETERIUIVROBUSTANGLEPROC GetTexParameterIuivRobustANGLE;
        /* 2841 */ PFNGLSAMPLERPARAMETERIIVROBUSTANGLEPROC SamplerParameterIivRobustANGLE;
        /* 2842 */ PFNGLSAMPLERPARAMETERIUIVROBUSTANGLEPROC SamplerParameterIuivRobustANGLE;
        /* 2843 */ PFNGLGETSAMPLERPARAMETERIIVROBUSTANGLEPROC GetSamplerParameterIivRobustANGLE;
        /* 2844 */ PFNGLGETSAMPLERPARAMETERIUIVROBUSTANGLEPROC GetSamplerParameterIuivRobustANGLE;
        /* 2845 */ PFNGLGETQUERYOBJECTIVROBUSTANGLEPROC GetQueryObjectivRobustANGLE;
        /* 2846 */ PFNGLGETQUERYOBJECTI64VROBUSTANGLEPROC GetQueryObjecti64vRobustANGLE;
        /* 2847 */ PFNGLGETQUERYOBJECTUI64VROBUSTANGLEPROC GetQueryObjectui64vRobustANGLE;
        /* 2848 */ PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERFVROBUSTANGLEPROC GetFramebufferPixelLocalStorageParameterfvRobustANGLE;
        /* 2849 */ PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERIVROBUSTANGLEPROC GetFramebufferPixelLocalStorageParameterivRobustANGLE;
        /* 2850 */ PFNGLCOPYTEXTURE3DANGLEPROC CopyTexture3DANGLE;
        /* 2851 */ PFNGLCOPYSUBTEXTURE3DANGLEPROC CopySubTexture3DANGLE;
        /* 2852 */ PFNGLTEXSTORAGE2DMULTISAMPLEANGLEPROC TexStorage2DMultisampleANGLE;
        /* 2853 */ PFNGLGETMULTISAMPLEFVANGLEPROC GetMultisamplefvANGLE;
        /* 2854 */ PFNGLSAMPLEMASKIANGLEPROC SampleMaskiANGLE;
        /* 2855 */ PFNGLMULTIDRAWARRAYSANGLEPROC MultiDrawArraysANGLE;
        /* 2856 */ PFNGLMULTIDRAWARRAYSINSTANCEDANGLEPROC MultiDrawArraysInstancedANGLE;
        /* 2857 */ PFNGLMULTIDRAWELEMENTSANGLEPROC MultiDrawElementsANGLE;
        /* 2858 */ PFNGLMULTIDRAWELEMENTSINSTANCEDANGLEPROC MultiDrawElementsInstancedANGLE;
        /* 2859 */ PFNGLDRAWARRAYSINSTANCEDBASEINSTANCEANGLEPROC DrawArraysInstancedBaseInstanceANGLE;
        /* 2860 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXBASEINSTANCEANGLEPROC DrawElementsInstancedBaseVertexBaseInstanceANGLE;
        /* 2861 */ PFNGLMULTIDRAWARRAYSINSTANCEDBASEINSTANCEANGLEPROC MultiDrawArraysInstancedBaseInstanceANGLE;
        /* 2862 */ PFNGLMULTIDRAWELEMENTSINSTANCEDBASEVERTEXBASEINSTANCEANGLEPROC MultiDrawElementsInstancedBaseVertexBaseInstanceANGLE;
        /* 2863 */ PFNGLPOLYGONMODEANGLEPROC PolygonModeANGLE;
        /* 2864 */ PFNGLPROVOKINGVERTEXANGLEPROC ProvokingVertexANGLE;
        /* 2865 */ PFNGLLOSECONTEXTCHROMIUMPROC LoseContextCHROMIUM;
        /* 2866 */ PFNGLGETTEXIMAGEANGLEPROC GetTexImageANGLE;
        /* 2867 */ PFNGLGETCOMPRESSEDTEXIMAGEANGLEPROC GetCompressedTexImageANGLE;
        /* 2868 */ PFNGLGETRENDERBUFFERIMAGEANGLEPROC GetRenderbufferImageANGLE;
        /* 2869 */ PFNGLGETTEXLEVELPARAMETERFVANGLEPROC GetTexLevelParameterfvANGLE;
        /* 2870 */ PFNGLGETTEXLEVELPARAMETERIVANGLEPROC GetTexLevelParameterivANGLE;
        /* 2871 */ PFNGLFRAMEBUFFERMEMORYLESSPIXELLOCALSTORAGEANGLEPROC FramebufferMemorylessPixelLocalStorageANGLE;
        /* 2872 */ PFNGLFRAMEBUFFERTEXTUREPIXELLOCALSTORAGEANGLEPROC FramebufferTexturePixelLocalStorageANGLE;
        /* 2873 */ PFNGLFRAMEBUFFERPIXELLOCALCLEARVALUEFVANGLEPROC FramebufferPixelLocalClearValuefvANGLE;
        /* 2874 */ PFNGLFRAMEBUFFERPIXELLOCALCLEARVALUEIVANGLEPROC FramebufferPixelLocalClearValueivANGLE;
        /* 2875 */ PFNGLFRAMEBUFFERPIXELLOCALCLEARVALUEUIVANGLEPROC FramebufferPixelLocalClearValueuivANGLE;
        /* 2876 */ PFNGLBEGINPIXELLOCALSTORAGEANGLEPROC BeginPixelLocalStorageANGLE;
        /* 2877 */ PFNGLENDPIXELLOCALSTORAGEANGLEPROC EndPixelLocalStorageANGLE;
        /* 2878 */ PFNGLPIXELLOCALSTORAGEBARRIERANGLEPROC PixelLocalStorageBarrierANGLE;
        /* 2879 */ PFNGLFRAMEBUFFERPIXELLOCALSTORAGEINTERRUPTANGLEPROC FramebufferPixelLocalStorageInterruptANGLE;
        /* 2880 */ PFNGLFRAMEBUFFERPIXELLOCALSTORAGERESTOREANGLEPROC FramebufferPixelLocalStorageRestoreANGLE;
        /* 2881 */ PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERFVANGLEPROC GetFramebufferPixelLocalStorageParameterfvANGLE;
        /* 2882 */ PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERIVANGLEPROC GetFramebufferPixelLocalStorageParameterivANGLE;
        /* 2883 */ PFNGLLOGICOPANGLEPROC LogicOpANGLE;
        /* 2884 */ PFNGLBLOBCACHECALLBACKSANGLEPROC BlobCacheCallbacksANGLE;
        /* 2885 */ PFNGLGETPOINTERVANGLEPROC GetPointervANGLE;
        };
    };

    void* glad_loader_handle;
} GladGLContext;

GLAD_API_CALL GladGLContext glad_gl_context;

#define GLAD_GL_VERSION_1_0 (glad_gl_context.VERSION_1_0)
#define GLAD_GL_VERSION_1_1 (glad_gl_context.VERSION_1_1)
#define GLAD_GL_VERSION_1_2 (glad_gl_context.VERSION_1_2)
#define GLAD_GL_VERSION_1_3 (glad_gl_context.VERSION_1_3)
#define GLAD_GL_VERSION_1_4 (glad_gl_context.VERSION_1_4)
#define GLAD_GL_VERSION_1_5 (glad_gl_context.VERSION_1_5)
#define GLAD_GL_VERSION_2_0 (glad_gl_context.VERSION_2_0)
#define GLAD_GL_VERSION_2_1 (glad_gl_context.VERSION_2_1)
#define GLAD_GL_VERSION_3_0 (glad_gl_context.VERSION_3_0)
#define GLAD_GL_VERSION_3_1 (glad_gl_context.VERSION_3_1)
#define GLAD_GL_VERSION_3_2 (glad_gl_context.VERSION_3_2)
#define GLAD_GL_VERSION_3_3 (glad_gl_context.VERSION_3_3)
#define GLAD_GL_VERSION_4_0 (glad_gl_context.VERSION_4_0)
#define GLAD_GL_VERSION_4_1 (glad_gl_context.VERSION_4_1)
