/**
 * Loader generated by glad 2.0.5 on -
 *
 * SPDX-License-Identifier: (WTFPL OR CC0-1.0) AND Apache-2.0
 *
 * Generator: C/C++
 * Specification: gl
 * Extensions: 84
 *
 * APIs:
 *  - gl:compatibility=2.1
 *  - gles2=3.2
 *
 * Options:
 *  - ALIAS = True
 *  - HEADER_ONLY = False
 *  - LOADER = True
 *  - MX = True
 *  - MX_GLOBAL = True
 *
 * Commandline:

typedef void (GLAD_API_PTR *PFNGLUNIFORMMATRIX3X4FVNVPROC)(GLint location, GLsizei count, GLboolean transpose, const GLfloat * value);
typedef void (GLAD_API_PTR *PFNGLUNIFORMMATRIX4X2FVNVPROC)(GLint location, GLsizei count, GLboolean transpose, const GLfloat * value);
typedef void (GLAD_API_PTR *PFNGLUNIFORMMATRIX4X3FVNVPROC)(GLint location, GLsizei count, GLboolean transpose, const GLfloat * value);
typedef GLboolean (GLAD_API_PTR *PFNGLUNMAPBUFFEROESPROC)(GLenum target);
typedef void (GLAD_API_PTR *PFNGLUSEPROGRAMSTAGESPROC)(GLuint pipeline, GLbitfield stages, GLuint program);
typedef void (GLAD_API_PTR *PFNGLUSEPROGRAMSTAGESEXTPROC)(GLuint pipeline, GLbitfield stages, GLuint program);
typedef void (GLAD_API_PTR *PFNGLVALIDATEPROGRAMPIPELINEPROC)(GLuint pipeline);
typedef void (GLAD_API_PTR *PFNGLVALIDATEPROGRAMPIPELINEEXTPROC)(GLuint pipeline);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBBINDINGPROC)(GLuint attribindex, GLuint bindingindex);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBDIVISORPROC)(GLuint index, GLuint divisor);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBDIVISORANGLEPROC)(GLuint index, GLuint divisor);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBDIVISOREXTPROC)(GLuint index, GLuint divisor);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBDIVISORNVPROC)(GLuint index, GLuint divisor);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBFORMATPROC)(GLuint attribindex, GLint size, GLenum type, GLboolean normalized, GLuint relativeoffset);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBI4IPROC)(GLuint index, GLint x, GLint y, GLint z, GLint w);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBI4IVPROC)(GLuint index, const GLint * v);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBI4UIPROC)(GLuint index, GLuint x, GLuint y, GLuint z, GLuint w);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBI4UIVPROC)(GLuint index, const GLuint * v);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBIFORMATPROC)(GLuint attribindex, GLint size, GLenum type, GLuint relativeoffset);
typedef void (GLAD_API_PTR *PFNGLVERTEXATTRIBIPOINTERPROC)(GLuint index, GLint size, GLenum type, GLsizei stride, const void * pointer);
typedef void (GLAD_API_PTR *PFNGLVERTEXBINDINGDIVISORPROC)(GLuint bindingindex, GLuint divisor);
typedef void (GLAD_API_PTR *PFNGLVIEWPORTARRAYVNVPROC)(GLuint first, GLsizei count, const GLfloat * v);
typedef void (GLAD_API_PTR *PFNGLVIEWPORTARRAYVOESPROC)(GLuint first, GLsizei count, const GLfloat * v);
typedef void (GLAD_API_PTR *PFNGLVIEWPORTINDEXEDFNVPROC)(GLuint index, GLfloat x, GLfloat y, GLfloat w, GLfloat h);
typedef void (GLAD_API_PTR *PFNGLVIEWPORTINDEXEDFOESPROC)(GLuint index, GLfloat x, GLfloat y, GLfloat w, GLfloat h);
typedef void (GLAD_API_PTR *PFNGLVIEWPORTINDEXEDFVNVPROC)(GLuint index, const GLfloat * v);
typedef void (GLAD_API_PTR *PFNGLVIEWPORTINDEXEDFVOESPROC)(GLuint index, const GLfloat * v);
typedef void (GLAD_API_PTR *PFNGLWAITSYNCPROC)(GLsync sync, GLbitfield flags, GLuint64 timeout);
typedef void (GLAD_API_PTR *PFNGLWAITSYNCAPPLEPROC)(GLsync sync, GLbitfield flags, GLuint64 timeout);

typedef struct GladGLContext {
    void* userptr;

    unsigned char VERSION_1_0;
    unsigned char VERSION_1_1;
    unsigned char VERSION_1_2;
    unsigned char VERSION_1_3;
    unsigned char VERSION_1_4;
    unsigned char VERSION_1_5;
    unsigned char VERSION_2_0;
    unsigned char VERSION_2_1;
    unsigned char ES_VERSION_2_0;
    unsigned char ES_VERSION_3_0;
    unsigned char ES_VERSION_3_1;
    unsigned char ES_VERSION_3_2;

    union {
        unsigned char extArray[84];
        struct {
        /*    0 */ unsigned char ANGLE_get_tex_level_parameter;
        /*    1 */ unsigned char ANGLE_instanced_arrays;
        /*    2 */ unsigned char ANGLE_texture_multisample;
        /*    3 */ unsigned char APPLE_sync;
        /*    4 */ unsigned char ARB_buffer_storage;
        /*    5 */ unsigned char ARB_debug_output;
        /*    6 */ unsigned char ARB_draw_buffers;
        /*    7 */ unsigned char ARB_imaging;
        /*    8 */ unsigned char ARB_multisample;
        /*    9 */ unsigned char ARB_multitexture;
        /*   10 */ unsigned char ARB_occlusion_query;
        /*   11 */ unsigned char ARB_point_parameters;
        /*   12 */ unsigned char ARB_shader_objects;
        /*   13 */ unsigned char ARB_texture_compression;
        /*   14 */ unsigned char ARB_transpose_matrix;
        /*   15 */ unsigned char ARB_vertex_buffer_object;
        /*   16 */ unsigned char ARB_vertex_program;
        /*   17 */ unsigned char ARB_vertex_shader;
        /*   18 */ unsigned char ARB_window_pos;
        /*   19 */ unsigned char ATI_draw_buffers;
        /*   20 */ unsigned char ATI_separate_stencil;
        /*   21 */ unsigned char EXT_blend_color;
        /*   22 */ unsigned char EXT_blend_equation_separate;
        /*   23 */ unsigned char EXT_blend_func_separate;
        /*   24 */ unsigned char EXT_blend_minmax;
        /*   25 */ unsigned char EXT_copy_image;
        /*   26 */ unsigned char EXT_copy_texture;
        /*   27 */ unsigned char EXT_direct_state_access;
        /*   28 */ unsigned char EXT_disjoint_timer_query;
        /*   29 */ unsigned char EXT_draw_buffers;
        /*   30 */ unsigned char EXT_draw_buffers_indexed;
        /*   31 */ unsigned char EXT_draw_elements_base_vertex;
        /*   32 */ unsigned char EXT_draw_instanced;
        /*   33 */ unsigned char EXT_draw_range_elements;
        /*   34 */ unsigned char EXT_fog_coord;
        /*   35 */ unsigned char EXT_geometry_shader;
        /*   36 */ unsigned char EXT_instanced_arrays;
        /*   37 */ unsigned char EXT_map_buffer_range;
        /*   38 */ unsigned char EXT_multi_draw_arrays;
        /*   39 */ unsigned char EXT_multisampled_render_to_texture;
        /*   40 */ unsigned char EXT_point_parameters;
        /*   41 */ unsigned char EXT_primitive_bounding_box;
        /*   42 */ unsigned char EXT_robustness;
        /*   43 */ unsigned char EXT_secondary_color;
        /*   44 */ unsigned char EXT_separate_shader_objects;
        /*   45 */ unsigned char EXT_subtexture;
        /*   46 */ unsigned char EXT_tessellation_shader;
        /*   47 */ unsigned char EXT_texture3D;
        /*   48 */ unsigned char EXT_texture_border_clamp;
        /*   49 */ unsigned char EXT_texture_buffer;
        /*   50 */ unsigned char EXT_texture_object;
        /*   51 */ unsigned char EXT_texture_storage;
        /*   52 */ unsigned char EXT_vertex_array;
        /*   53 */ unsigned char INGR_blend_func_separate;
        /*   54 */ unsigned char KHR_blend_equation_advanced;
        /*   55 */ unsigned char KHR_debug;
        /*   56 */ unsigned char KHR_robustness;
        /*   57 */ unsigned char MESA_sampler_objects;
        /*   58 */ unsigned char MESA_window_pos;
        /*   59 */ unsigned char NV_blend_equation_advanced;
        /*   60 */ unsigned char NV_copy_buffer;
        /*   61 */ unsigned char NV_draw_instanced;
        /*   62 */ unsigned char NV_framebuffer_blit;
        /*   63 */ unsigned char NV_framebuffer_multisample;
        /*   64 */ unsigned char NV_instanced_arrays;
        /*   65 */ unsigned char NV_non_square_matrices;
        /*   66 */ unsigned char NV_point_sprite;
        /*   67 */ unsigned char NV_vertex_program;
        /*   68 */ unsigned char NV_viewport_array;
        /*   69 */ unsigned char OES_copy_image;
        /*   70 */ unsigned char OES_draw_buffers_indexed;
        /*   71 */ unsigned char OES_draw_elements_base_vertex;
        /*   72 */ unsigned char OES_geometry_shader;
        /*   73 */ unsigned char OES_get_program_binary;
        /*   74 */ unsigned char OES_mapbuffer;
        /*   75 */ unsigned char OES_primitive_bounding_box;
        /*   76 */ unsigned char OES_sample_shading;
        /*   77 */ unsigned char OES_tessellation_shader;
        /*   78 */ unsigned char OES_texture_border_clamp;
        /*   79 */ unsigned char OES_texture_buffer;
        /*   80 */ unsigned char OES_texture_storage_multisample_2d_array;
        /*   81 */ unsigned char OES_vertex_array_object;
        /*   82 */ unsigned char OES_viewport_array;
        /*   83 */ unsigned char SGIS_point_parameters;
        };
    };

    union {
        void *pfnArray[1559];
        struct {
        /*    0 */ PFNGLACCUMPROC Accum;
        /*    1 */ PFNGLACTIVETEXTUREPROC ActiveTexture;
        /*    2 */ PFNGLACTIVETEXTUREARBPROC ActiveTextureARB;
        /*    3 */ PFNGLALPHAFUNCPROC AlphaFunc;
        /*    4 */ PFNGLAREPROGRAMSRESIDENTNVPROC AreProgramsResidentNV;
        /*    5 */ PFNGLARETEXTURESRESIDENTPROC AreTexturesResident;
        /*    6 */ PFNGLARETEXTURESRESIDENTEXTPROC AreTexturesResidentEXT;
        /*    7 */ PFNGLARRAYELEMENTPROC ArrayElement;
        /*    8 */ PFNGLARRAYELEMENTEXTPROC ArrayElementEXT;
        /*    9 */ PFNGLATTACHOBJECTARBPROC AttachObjectARB;
        /*   10 */ PFNGLATTACHSHADERPROC AttachShader;
        /*   11 */ PFNGLBEGINPROC Begin;
        /*   12 */ PFNGLBEGINQUERYPROC BeginQuery;
        /*   13 */ PFNGLBEGINQUERYARBPROC BeginQueryARB;
        /*   14 */ PFNGLBINDATTRIBLOCATIONPROC BindAttribLocation;
        /*   15 */ PFNGLBINDATTRIBLOCATIONARBPROC BindAttribLocationARB;
        /*   16 */ PFNGLBINDBUFFERPROC BindBuffer;
        /*   17 */ PFNGLBINDBUFFERARBPROC BindBufferARB;
        /*   18 */ PFNGLBINDMULTITEXTUREEXTPROC BindMultiTextureEXT;
        /*   19 */ PFNGLBINDPROGRAMARBPROC BindProgramARB;
        /*   20 */ PFNGLBINDPROGRAMNVPROC BindProgramNV;
        /*   21 */ PFNGLBINDTEXTUREPROC BindTexture;
        /*   22 */ PFNGLBINDTEXTUREEXTPROC BindTextureEXT;
        /*   23 */ PFNGLBITMAPPROC Bitmap;
        /*   24 */ PFNGLBLENDCOLORPROC BlendColor;
        /*   25 */ PFNGLBLENDCOLOREXTPROC BlendColorEXT;
        /*   26 */ PFNGLBLENDEQUATIONPROC BlendEquation;
        /*   27 */ PFNGLBLENDEQUATIONEXTPROC BlendEquationEXT;
        /*   28 */ PFNGLBLENDEQUATIONSEPARATEPROC BlendEquationSeparate;
        /*   29 */ PFNGLBLENDEQUATIONSEPARATEEXTPROC BlendEquationSeparateEXT;
        /*   30 */ PFNGLBLENDFUNCPROC BlendFunc;
        /*   31 */ PFNGLBLENDFUNCSEPARATEPROC BlendFuncSeparate;
        /*   32 */ PFNGLBLENDFUNCSEPARATEEXTPROC BlendFuncSeparateEXT;
        /*   33 */ PFNGLBLENDFUNCSEPARATEINGRPROC BlendFuncSeparateINGR;
        /*   34 */ PFNGLBUFFERDATAPROC BufferData;
        /*   35 */ PFNGLBUFFERDATAARBPROC BufferDataARB;
        /*   36 */ PFNGLBUFFERSTORAGEPROC BufferStorage;
        /*   37 */ PFNGLBUFFERSUBDATAPROC BufferSubData;
        /*   38 */ PFNGLBUFFERSUBDATAARBPROC BufferSubDataARB;
        /*   39 */ PFNGLCALLLISTPROC CallList;
        /*   40 */ PFNGLCALLLISTSPROC CallLists;
        /*   41 */ PFNGLCHECKNAMEDFRAMEBUFFERSTATUSEXTPROC CheckNamedFramebufferStatusEXT;
        /*   42 */ PFNGLCLEARPROC Clear;
        /*   43 */ PFNGLCLEARACCUMPROC ClearAccum;
        /*   44 */ PFNGLCLEARCOLORPROC ClearColor;
        /*   45 */ PFNGLCLEARDEPTHPROC ClearDepth;
        /*   46 */ PFNGLCLEARINDEXPROC ClearIndex;
        /*   47 */ PFNGLCLEARNAMEDBUFFERDATAEXTPROC ClearNamedBufferDataEXT;
        /*   48 */ PFNGLCLEARNAMEDBUFFERSUBDATAEXTPROC ClearNamedBufferSubDataEXT;
        /*   49 */ PFNGLCLEARSTENCILPROC ClearStencil;
        /*   50 */ PFNGLCLIENTACTIVETEXTUREPROC ClientActiveTexture;
        /*   51 */ PFNGLCLIENTACTIVETEXTUREARBPROC ClientActiveTextureARB;
        /*   52 */ PFNGLCLIENTATTRIBDEFAULTEXTPROC ClientAttribDefaultEXT;
        /*   53 */ PFNGLCLIPPLANEPROC ClipPlane;
        /*   54 */ PFNGLCOLOR3BPROC Color3b;
        /*   55 */ PFNGLCOLOR3BVPROC Color3bv;
        /*   56 */ PFNGLCOLOR3DPROC Color3d;
        /*   57 */ PFNGLCOLOR3DVPROC Color3dv;
        /*   58 */ PFNGLCOLOR3FPROC Color3f;
        /*   59 */ PFNGLCOLOR3FVPROC Color3fv;
        /*   60 */ PFNGLCOLOR3IPROC Color3i;
        /*   61 */ PFNGLCOLOR3IVPROC Color3iv;
        /*   62 */ PFNGLCOLOR3SPROC Color3s;
        /*   63 */ PFNGLCOLOR3SVPROC Color3sv;
        /*   64 */ PFNGLCOLOR3UBPROC Color3ub;
        /*   65 */ PFNGLCOLOR3UBVPROC Color3ubv;
        /*   66 */ PFNGLCOLOR3UIPROC Color3ui;
        /*   67 */ PFNGLCOLOR3UIVPROC Color3uiv;
        /*   68 */ PFNGLCOLOR3USPROC Color3us;
        /*   69 */ PFNGLCOLOR3USVPROC Color3usv;
        /*   70 */ PFNGLCOLOR4BPROC Color4b;
        /*   71 */ PFNGLCOLOR4BVPROC Color4bv;
        /*   72 */ PFNGLCOLOR4DPROC Color4d;
        /*   73 */ PFNGLCOLOR4DVPROC Color4dv;
        /*   74 */ PFNGLCOLOR4FPROC Color4f;
        /*   75 */ PFNGLCOLOR4FVPROC Color4fv;
        /*   76 */ PFNGLCOLOR4IPROC Color4i;
        /*   77 */ PFNGLCOLOR4IVPROC Color4iv;
        /*   78 */ PFNGLCOLOR4SPROC Color4s;
        /*   79 */ PFNGLCOLOR4SVPROC Color4sv;
        /*   80 */ PFNGLCOLOR4UBPROC Color4ub;
        /*   81 */ PFNGLCOLOR4UBVPROC Color4ubv;
        /*   82 */ PFNGLCOLOR4UIPROC Color4ui;
        /*   83 */ PFNGLCOLOR4UIVPROC Color4uiv;
        /*   84 */ PFNGLCOLOR4USPROC Color4us;
        /*   85 */ PFNGLCOLOR4USVPROC Color4usv;
        /*   86 */ PFNGLCOLORMASKPROC ColorMask;
        /*   87 */ PFNGLCOLORMATERIALPROC ColorMaterial;
        /*   88 */ PFNGLCOLORPOINTERPROC ColorPointer;
        /*   89 */ PFNGLCOLORPOINTEREXTPROC ColorPointerEXT;
        /*   90 */ PFNGLCOLORSUBTABLEPROC ColorSubTable;
        /*   91 */ PFNGLCOLORTABLEPROC ColorTable;
        /*   92 */ PFNGLCOLORTABLEPARAMETERFVPROC ColorTableParameterfv;
        /*   93 */ PFNGLCOLORTABLEPARAMETERIVPROC ColorTableParameteriv;
        /*   94 */ PFNGLCOMPILESHADERPROC CompileShader;
        /*   95 */ PFNGLCOMPILESHADERARBPROC CompileShaderARB;
        /*   96 */ PFNGLCOMPRESSEDMULTITEXIMAGE1DEXTPROC CompressedMultiTexImage1DEXT;
        /*   97 */ PFNGLCOMPRESSEDMULTITEXIMAGE2DEXTPROC CompressedMultiTexImage2DEXT;
        /*   98 */ PFNGLCOMPRESSEDMULTITEXIMAGE3DEXTPROC CompressedMultiTexImage3DEXT;
        /*   99 */ PFNGLCOMPRESSEDMULTITEXSUBIMAGE1DEXTPROC CompressedMultiTexSubImage1DEXT;
        /*  100 */ PFNGLCOMPRESSEDMULTITEXSUBIMAGE2DEXTPROC CompressedMultiTexSubImage2DEXT;
        /*  101 */ PFNGLCOMPRESSEDMULTITEXSUBIMAGE3DEXTPROC CompressedMultiTexSubImage3DEXT;
        /*  102 */ PFNGLCOMPRESSEDTEXIMAGE1DPROC CompressedTexImage1D;
        /*  103 */ PFNGLCOMPRESSEDTEXIMAGE1DARBPROC CompressedTexImage1DARB;
        /*  104 */ PFNGLCOMPRESSEDTEXIMAGE2DPROC CompressedTexImage2D;
        /*  105 */ PFNGLCOMPRESSEDTEXIMAGE2DARBPROC CompressedTexImage2DARB;
        /*  106 */ PFNGLCOMPRESSEDTEXIMAGE3DPROC CompressedTexImage3D;
        /*  107 */ PFNGLCOMPRESSEDTEXIMAGE3DARBPROC CompressedTexImage3DARB;
        /*  108 */ PFNGLCOMPRESSEDTEXSUBIMAGE1DPROC CompressedTexSubImage1D;
        /*  109 */ PFNGLCOMPRESSEDTEXSUBIMAGE1DARBPROC CompressedTexSubImage1DARB;
        /*  110 */ PFNGLCOMPRESSEDTEXSUBIMAGE2DPROC CompressedTexSubImage2D;
        /*  111 */ PFNGLCOMPRESSEDTEXSUBIMAGE2DARBPROC CompressedTexSubImage2DARB;
        /*  112 */ PFNGLCOMPRESSEDTEXSUBIMAGE3DPROC CompressedTexSubImage3D;
        /*  113 */ PFNGLCOMPRESSEDTEXSUBIMAGE3DARBPROC CompressedTexSubImage3DARB;
        /*  114 */ PFNGLCOMPRESSEDTEXTUREIMAGE1DEXTPROC CompressedTextureImage1DEXT;
        /*  115 */ PFNGLCOMPRESSEDTEXTUREIMAGE2DEXTPROC CompressedTextureImage2DEXT;
        /*  116 */ PFNGLCOMPRESSEDTEXTUREIMAGE3DEXTPROC CompressedTextureImage3DEXT;
        /*  117 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE1DEXTPROC CompressedTextureSubImage1DEXT;
        /*  118 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE2DEXTPROC CompressedTextureSubImage2DEXT;
        /*  119 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE3DEXTPROC CompressedTextureSubImage3DEXT;
        /*  120 */ PFNGLCONVOLUTIONFILTER1DPROC ConvolutionFilter1D;
        /*  121 */ PFNGLCONVOLUTIONFILTER2DPROC ConvolutionFilter2D;
        /*  122 */ PFNGLCONVOLUTIONPARAMETERFPROC ConvolutionParameterf;
        /*  123 */ PFNGLCONVOLUTIONPARAMETERFVPROC ConvolutionParameterfv;
        /*  124 */ PFNGLCONVOLUTIONPARAMETERIPROC ConvolutionParameteri;
        /*  125 */ PFNGLCONVOLUTIONPARAMETERIVPROC ConvolutionParameteriv;
        /*  126 */ PFNGLCOPYCOLORSUBTABLEPROC CopyColorSubTable;
        /*  127 */ PFNGLCOPYCOLORTABLEPROC CopyColorTable;
        /*  128 */ PFNGLCOPYCONVOLUTIONFILTER1DPROC CopyConvolutionFilter1D;
        /*  129 */ PFNGLCOPYCONVOLUTIONFILTER2DPROC CopyConvolutionFilter2D;
        /*  130 */ PFNGLCOPYMULTITEXIMAGE1DEXTPROC CopyMultiTexImage1DEXT;
        /*  131 */ PFNGLCOPYMULTITEXIMAGE2DEXTPROC CopyMultiTexImage2DEXT;
        /*  132 */ PFNGLCOPYMULTITEXSUBIMAGE1DEXTPROC CopyMultiTexSubImage1DEXT;
        /*  133 */ PFNGLCOPYMULTITEXSUBIMAGE2DEXTPROC CopyMultiTexSubImage2DEXT;
        /*  134 */ PFNGLCOPYMULTITEXSUBIMAGE3DEXTPROC CopyMultiTexSubImage3DEXT;
        /*  135 */ PFNGLCOPYPIXELSPROC CopyPixels;
        /*  136 */ PFNGLCOPYTEXIMAGE1DPROC CopyTexImage1D;
        /*  137 */ PFNGLCOPYTEXIMAGE1DEXTPROC CopyTexImage1DEXT;
        /*  138 */ PFNGLCOPYTEXIMAGE2DPROC CopyTexImage2D;
        /*  139 */ PFNGLCOPYTEXIMAGE2DEXTPROC CopyTexImage2DEXT;
        /*  140 */ PFNGLCOPYTEXSUBIMAGE1DPROC CopyTexSubImage1D;
        /*  141 */ PFNGLCOPYTEXSUBIMAGE1DEXTPROC CopyTexSubImage1DEXT;
        /*  142 */ PFNGLCOPYTEXSUBIMAGE2DPROC CopyTexSubImage2D;
        /*  143 */ PFNGLCOPYTEXSUBIMAGE2DEXTPROC CopyTexSubImage2DEXT;
        /*  144 */ PFNGLCOPYTEXSUBIMAGE3DPROC CopyTexSubImage3D;
        /*  145 */ PFNGLCOPYTEXSUBIMAGE3DEXTPROC CopyTexSubImage3DEXT;
        /*  146 */ PFNGLCOPYTEXTUREIMAGE1DEXTPROC CopyTextureImage1DEXT;
        /*  147 */ PFNGLCOPYTEXTUREIMAGE2DEXTPROC CopyTextureImage2DEXT;
        /*  148 */ PFNGLCOPYTEXTURESUBIMAGE1DEXTPROC CopyTextureSubImage1DEXT;
        /*  149 */ PFNGLCOPYTEXTURESUBIMAGE2DEXTPROC CopyTextureSubImage2DEXT;
        /*  150 */ PFNGLCOPYTEXTURESUBIMAGE3DEXTPROC CopyTextureSubImage3DEXT;
        /*  151 */ PFNGLCREATEPROGRAMPROC CreateProgram;
        /*  152 */ PFNGLCREATEPROGRAMOBJECTARBPROC CreateProgramObjectARB;
        /*  153 */ PFNGLCREATESHADERPROC CreateShader;
        /*  154 */ PFNGLCREATESHADEROBJECTARBPROC CreateShaderObjectARB;
        /*  155 */ PFNGLCULLFACEPROC CullFace;
        /*  156 */ PFNGLDEBUGMESSAGECALLBACKPROC DebugMessageCallback;
        /*  157 */ PFNGLDEBUGMESSAGECALLBACKARBPROC DebugMessageCallbackARB;
        /*  158 */ PFNGLDEBUGMESSAGECONTROLPROC DebugMessageControl;
        /*  159 */ PFNGLDEBUGMESSAGECONTROLARBPROC DebugMessageControlARB;
        /*  160 */ PFNGLDEBUGMESSAGEINSERTPROC DebugMessageInsert;
        /*  161 */ PFNGLDEBUGMESSAGEINSERTARBPROC DebugMessageInsertARB;
        /*  162 */ PFNGLDELETEBUFFERSPROC DeleteBuffers;
        /*  163 */ PFNGLDELETEBUFFERSARBPROC DeleteBuffersARB;
        /*  164 */ PFNGLDELETELISTSPROC DeleteLists;
        /*  165 */ PFNGLDELETEOBJECTARBPROC DeleteObjectARB;
        /*  166 */ PFNGLDELETEPROGRAMPROC DeleteProgram;
        /*  167 */ PFNGLDELETEPROGRAMSARBPROC DeleteProgramsARB;
        /*  168 */ PFNGLDELETEPROGRAMSNVPROC DeleteProgramsNV;
        /*  169 */ PFNGLDELETEQUERIESPROC DeleteQueries;
        /*  170 */ PFNGLDELETEQUERIESARBPROC DeleteQueriesARB;
        /*  171 */ PFNGLDELETESHADERPROC DeleteShader;
        /*  172 */ PFNGLDELETETEXTURESPROC DeleteTextures;
        /*  173 */ PFNGLDELETETEXTURESEXTPROC DeleteTexturesEXT;
        /*  174 */ PFNGLDEPTHFUNCPROC DepthFunc;
        /*  175 */ PFNGLDEPTHMASKPROC DepthMask;
        /*  176 */ PFNGLDEPTHRANGEPROC DepthRange;
        /*  177 */ PFNGLDETACHOBJECTARBPROC DetachObjectARB;
        /*  178 */ PFNGLDETACHSHADERPROC DetachShader;
        /*  179 */ PFNGLDISABLEPROC Disable;
        /*  180 */ PFNGLDISABLECLIENTSTATEPROC DisableClientState;
        /*  181 */ PFNGLDISABLECLIENTSTATEINDEXEDEXTPROC DisableClientStateIndexedEXT;
        /*  182 */ PFNGLDISABLECLIENTSTATEIEXTPROC DisableClientStateiEXT;
        /*  183 */ PFNGLDISABLEINDEXEDEXTPROC DisableIndexedEXT;
        /*  184 */ PFNGLDISABLEVERTEXARRAYATTRIBEXTPROC DisableVertexArrayAttribEXT;
        /*  185 */ PFNGLDISABLEVERTEXARRAYEXTPROC DisableVertexArrayEXT;
        /*  186 */ PFNGLDISABLEVERTEXATTRIBARRAYPROC DisableVertexAttribArray;
        /*  187 */ PFNGLDISABLEVERTEXATTRIBARRAYARBPROC DisableVertexAttribArrayARB;
        /*  188 */ PFNGLDRAWARRAYSPROC DrawArrays;
        /*  189 */ PFNGLDRAWARRAYSEXTPROC DrawArraysEXT;
        /*  190 */ PFNGLDRAWBUFFERPROC DrawBuffer;
        /*  191 */ PFNGLDRAWBUFFERSPROC DrawBuffers;
        /*  192 */ PFNGLDRAWBUFFERSARBPROC DrawBuffersARB;
        /*  193 */ PFNGLDRAWBUFFERSATIPROC DrawBuffersATI;
        /*  194 */ PFNGLDRAWELEMENTSPROC DrawElements;
        /*  195 */ PFNGLDRAWPIXELSPROC DrawPixels;
        /*  196 */ PFNGLDRAWRANGEELEMENTSPROC DrawRangeElements;
        /*  197 */ PFNGLDRAWRANGEELEMENTSEXTPROC DrawRangeElementsEXT;
        /*  198 */ PFNGLEDGEFLAGPROC EdgeFlag;
        /*  199 */ PFNGLEDGEFLAGPOINTERPROC EdgeFlagPointer;
        /*  200 */ PFNGLEDGEFLAGPOINTEREXTPROC EdgeFlagPointerEXT;
        /*  201 */ PFNGLEDGEFLAGVPROC EdgeFlagv;
        /*  202 */ PFNGLENABLEPROC Enable;
        /*  203 */ PFNGLENABLECLIENTSTATEPROC EnableClientState;
        /*  204 */ PFNGLENABLECLIENTSTATEINDEXEDEXTPROC EnableClientStateIndexedEXT;
        /*  205 */ PFNGLENABLECLIENTSTATEIEXTPROC EnableClientStateiEXT;
        /*  206 */ PFNGLENABLEINDEXEDEXTPROC EnableIndexedEXT;
        /*  207 */ PFNGLENABLEVERTEXARRAYATTRIBEXTPROC EnableVertexArrayAttribEXT;
        /*  208 */ PFNGLENABLEVERTEXARRAYEXTPROC EnableVertexArrayEXT;
        /*  209 */ PFNGLENABLEVERTEXATTRIBARRAYPROC EnableVertexAttribArray;
        /*  210 */ PFNGLENABLEVERTEXATTRIBARRAYARBPROC EnableVertexAttribArrayARB;
        /*  211 */ PFNGLENDPROC End;
        /*  212 */ PFNGLENDLISTPROC EndList;
        /*  213 */ PFNGLENDQUERYPROC EndQuery;
        /*  214 */ PFNGLENDQUERYARBPROC EndQueryARB;
        /*  215 */ PFNGLEVALCOORD1DPROC EvalCoord1d;
        /*  216 */ PFNGLEVALCOORD1DVPROC EvalCoord1dv;
        /*  217 */ PFNGLEVALCOORD1FPROC EvalCoord1f;
        /*  218 */ PFNGLEVALCOORD1FVPROC EvalCoord1fv;
        /*  219 */ PFNGLEVALCOORD2DPROC EvalCoord2d;
        /*  220 */ PFNGLEVALCOORD2DVPROC EvalCoord2dv;
        /*  221 */ PFNGLEVALCOORD2FPROC EvalCoord2f;
        /*  222 */ PFNGLEVALCOORD2FVPROC EvalCoord2fv;
        /*  223 */ PFNGLEVALMESH1PROC EvalMesh1;
        /*  224 */ PFNGLEVALMESH2PROC EvalMesh2;
        /*  225 */ PFNGLEVALPOINT1PROC EvalPoint1;
        /*  226 */ PFNGLEVALPOINT2PROC EvalPoint2;
        /*  227 */ PFNGLEXECUTEPROGRAMNVPROC ExecuteProgramNV;
        /*  228 */ PFNGLFEEDBACKBUFFERPROC FeedbackBuffer;
        /*  229 */ PFNGLFINISHPROC Finish;
        /*  230 */ PFNGLFLUSHPROC Flush;
        /*  231 */ PFNGLFLUSHMAPPEDNAMEDBUFFERRANGEEXTPROC FlushMappedNamedBufferRangeEXT;
        /*  232 */ PFNGLFOGCOORDPOINTERPROC FogCoordPointer;
        /*  233 */ PFNGLFOGCOORDPOINTEREXTPROC FogCoordPointerEXT;
        /*  234 */ PFNGLFOGCOORDDPROC FogCoordd;
        /*  235 */ PFNGLFOGCOORDDEXTPROC FogCoorddEXT;
        /*  236 */ PFNGLFOGCOORDDVPROC FogCoorddv;
        /*  237 */ PFNGLFOGCOORDDVEXTPROC FogCoorddvEXT;
        /*  238 */ PFNGLFOGCOORDFPROC FogCoordf;
        /*  239 */ PFNGLFOGCOORDFEXTPROC FogCoordfEXT;
        /*  240 */ PFNGLFOGCOORDFVPROC FogCoordfv;
        /*  241 */ PFNGLFOGCOORDFVEXTPROC FogCoordfvEXT;
        /*  242 */ PFNGLFOGFPROC Fogf;
        /*  243 */ PFNGLFOGFVPROC Fogfv;
        /*  244 */ PFNGLFOGIPROC Fogi;
        /*  245 */ PFNGLFOGIVPROC Fogiv;
        /*  246 */ PFNGLFRAMEBUFFERDRAWBUFFEREXTPROC FramebufferDrawBufferEXT;
        /*  247 */ PFNGLFRAMEBUFFERDRAWBUFFERSEXTPROC FramebufferDrawBuffersEXT;
        /*  248 */ PFNGLFRAMEBUFFERREADBUFFEREXTPROC FramebufferReadBufferEXT;
        /*  249 */ PFNGLFRONTFACEPROC FrontFace;
        /*  250 */ PFNGLFRUSTUMPROC Frustum;
        /*  251 */ PFNGLGENBUFFERSPROC GenBuffers;
        /*  252 */ PFNGLGENBUFFERSARBPROC GenBuffersARB;
        /*  253 */ PFNGLGENLISTSPROC GenLists;
        /*  254 */ PFNGLGENPROGRAMSARBPROC GenProgramsARB;
        /*  255 */ PFNGLGENPROGRAMSNVPROC GenProgramsNV;
        /*  256 */ PFNGLGENQUERIESPROC GenQueries;
        /*  257 */ PFNGLGENQUERIESARBPROC GenQueriesARB;
        /*  258 */ PFNGLGENTEXTURESPROC GenTextures;
        /*  259 */ PFNGLGENTEXTURESEXTPROC GenTexturesEXT;
        /*  260 */ PFNGLGENERATEMULTITEXMIPMAPEXTPROC GenerateMultiTexMipmapEXT;
        /*  261 */ PFNGLGENERATETEXTUREMIPMAPEXTPROC GenerateTextureMipmapEXT;
        /*  262 */ PFNGLGETACTIVEATTRIBPROC GetActiveAttrib;
        /*  263 */ PFNGLGETACTIVEATTRIBARBPROC GetActiveAttribARB;
        /*  264 */ PFNGLGETACTIVEUNIFORMPROC GetActiveUniform;
        /*  265 */ PFNGLGETACTIVEUNIFORMARBPROC GetActiveUniformARB;
        /*  266 */ PFNGLGETATTACHEDOBJECTSARBPROC GetAttachedObjectsARB;
        /*  267 */ PFNGLGETATTACHEDSHADERSPROC GetAttachedShaders;
        /*  268 */ PFNGLGETATTRIBLOCATIONPROC GetAttribLocation;
        /*  269 */ PFNGLGETATTRIBLOCATIONARBPROC GetAttribLocationARB;
        /*  270 */ PFNGLGETBOOLEANINDEXEDVEXTPROC GetBooleanIndexedvEXT;
        /*  271 */ PFNGLGETBOOLEANVPROC GetBooleanv;
        /*  272 */ PFNGLGETBUFFERPARAMETERIVPROC GetBufferParameteriv;
        /*  273 */ PFNGLGETBUFFERPARAMETERIVARBPROC GetBufferParameterivARB;
        /*  274 */ PFNGLGETBUFFERPOINTERVPROC GetBufferPointerv;
        /*  275 */ PFNGLGETBUFFERPOINTERVARBPROC GetBufferPointervARB;
        /*  276 */ PFNGLGETBUFFERSUBDATAPROC GetBufferSubData;
        /*  277 */ PFNGLGETBUFFERSUBDATAARBPROC GetBufferSubDataARB;
        /*  278 */ PFNGLGETCLIPPLANEPROC GetClipPlane;
        /*  279 */ PFNGLGETCOLORTABLEPROC GetColorTable;
        /*  280 */ PFNGLGETCOLORTABLEPARAMETERFVPROC GetColorTableParameterfv;
        /*  281 */ PFNGLGETCOLORTABLEPARAMETERIVPROC GetColorTableParameteriv;
        /*  282 */ PFNGLGETCOMPRESSEDMULTITEXIMAGEEXTPROC GetCompressedMultiTexImageEXT;
        /*  283 */ PFNGLGETCOMPRESSEDTEXIMAGEPROC GetCompressedTexImage;
        /*  284 */ PFNGLGETCOMPRESSEDTEXIMAGEARBPROC GetCompressedTexImageARB;
        /*  285 */ PFNGLGETCOMPRESSEDTEXTUREIMAGEEXTPROC GetCompressedTextureImageEXT;
        /*  286 */ PFNGLGETCONVOLUTIONFILTERPROC GetConvolutionFilter;
        /*  287 */ PFNGLGETCONVOLUTIONPARAMETERFVPROC GetConvolutionParameterfv;
        /*  288 */ PFNGLGETCONVOLUTIONPARAMETERIVPROC GetConvolutionParameteriv;
        /*  289 */ PFNGLGETDEBUGMESSAGELOGPROC GetDebugMessageLog;
        /*  290 */ PFNGLGETDEBUGMESSAGELOGARBPROC GetDebugMessageLogARB;
        /*  291 */ PFNGLGETDOUBLEINDEXEDVEXTPROC GetDoubleIndexedvEXT;
        /*  292 */ PFNGLGETDOUBLEI_VEXTPROC GetDoublei_vEXT;
        /*  293 */ PFNGLGETDOUBLEVPROC GetDoublev;
        /*  294 */ PFNGLGETERRORPROC GetError;
        /*  295 */ PFNGLGETFLOATINDEXEDVEXTPROC GetFloatIndexedvEXT;
        /*  296 */ PFNGLGETFLOATI_VEXTPROC GetFloati_vEXT;
        /*  297 */ PFNGLGETFLOATVPROC GetFloatv;
        /*  298 */ PFNGLGETFRAMEBUFFERPARAMETERIVEXTPROC GetFramebufferParameterivEXT;
        /*  299 */ PFNGLGETHANDLEARBPROC GetHandleARB;
        /*  300 */ PFNGLGETHISTOGRAMPROC GetHistogram;
        /*  301 */ PFNGLGETHISTOGRAMPARAMETERFVPROC GetHistogramParameterfv;
        /*  302 */ PFNGLGETHISTOGRAMPARAMETERIVPROC GetHistogramParameteriv;
        /*  303 */ PFNGLGETINFOLOGARBPROC GetInfoLogARB;
        /*  304 */ PFNGLGETINTEGERINDEXEDVEXTPROC GetIntegerIndexedvEXT;
        /*  305 */ PFNGLGETINTEGERVPROC GetIntegerv;
        /*  306 */ PFNGLGETLIGHTFVPROC GetLightfv;
        /*  307 */ PFNGLGETLIGHTIVPROC GetLightiv;
        /*  308 */ PFNGLGETMAPDVPROC GetMapdv;
        /*  309 */ PFNGLGETMAPFVPROC GetMapfv;
        /*  310 */ PFNGLGETMAPIVPROC GetMapiv;
        /*  311 */ PFNGLGETMATERIALFVPROC GetMaterialfv;
        /*  312 */ PFNGLGETMATERIALIVPROC GetMaterialiv;
        /*  313 */ PFNGLGETMINMAXPROC GetMinmax;
        /*  314 */ PFNGLGETMINMAXPARAMETERFVPROC GetMinmaxParameterfv;
        /*  315 */ PFNGLGETMINMAXPARAMETERIVPROC GetMinmaxParameteriv;
        /*  316 */ PFNGLGETMULTITEXENVFVEXTPROC GetMultiTexEnvfvEXT;
        /*  317 */ PFNGLGETMULTITEXENVIVEXTPROC GetMultiTexEnvivEXT;
        /*  318 */ PFNGLGETMULTITEXGENDVEXTPROC GetMultiTexGendvEXT;
        /*  319 */ PFNGLGETMULTITEXGENFVEXTPROC GetMultiTexGenfvEXT;
        /*  320 */ PFNGLGETMULTITEXGENIVEXTPROC GetMultiTexGenivEXT;
        /*  321 */ PFNGLGETMULTITEXIMAGEEXTPROC GetMultiTexImageEXT;
        /*  322 */ PFNGLGETMULTITEXLEVELPARAMETERFVEXTPROC GetMultiTexLevelParameterfvEXT;
        /*  323 */ PFNGLGETMULTITEXLEVELPARAMETERIVEXTPROC GetMultiTexLevelParameterivEXT;
        /*  324 */ PFNGLGETMULTITEXPARAMETERIIVEXTPROC GetMultiTexParameterIivEXT;
        /*  325 */ PFNGLGETMULTITEXPARAMETERIUIVEXTPROC GetMultiTexParameterIuivEXT;
        /*  326 */ PFNGLGETMULTITEXPARAMETERFVEXTPROC GetMultiTexParameterfvEXT;
        /*  327 */ PFNGLGETMULTITEXPARAMETERIVEXTPROC GetMultiTexParameterivEXT;
        /*  328 */ PFNGLGETNAMEDBUFFERPARAMETERIVEXTPROC GetNamedBufferParameterivEXT;
        /*  329 */ PFNGLGETNAMEDBUFFERPOINTERVEXTPROC GetNamedBufferPointervEXT;
        /*  330 */ PFNGLGETNAMEDBUFFERSUBDATAEXTPROC GetNamedBufferSubDataEXT;
        /*  331 */ PFNGLGETNAMEDFRAMEBUFFERATTACHMENTPARAMETERIVEXTPROC GetNamedFramebufferAttachmentParameterivEXT;
        /*  332 */ PFNGLGETNAMEDFRAMEBUFFERPARAMETERIVEXTPROC GetNamedFramebufferParameterivEXT;
        /*  333 */ PFNGLGETNAMEDPROGRAMLOCALPARAMETERIIVEXTPROC GetNamedProgramLocalParameterIivEXT;
        /*  334 */ PFNGLGETNAMEDPROGRAMLOCALPARAMETERIUIVEXTPROC GetNamedProgramLocalParameterIuivEXT;
        /*  335 */ PFNGLGETNAMEDPROGRAMLOCALPARAMETERDVEXTPROC GetNamedProgramLocalParameterdvEXT;
        /*  336 */ PFNGLGETNAMEDPROGRAMLOCALPARAMETERFVEXTPROC GetNamedProgramLocalParameterfvEXT;
        /*  337 */ PFNGLGETNAMEDPROGRAMSTRINGEXTPROC GetNamedProgramStringEXT;
        /*  338 */ PFNGLGETNAMEDPROGRAMIVEXTPROC GetNamedProgramivEXT;
        /*  339 */ PFNGLGETNAMEDRENDERBUFFERPARAMETERIVEXTPROC GetNamedRenderbufferParameterivEXT;
        /*  340 */ PFNGLGETOBJECTLABELPROC GetObjectLabel;
        /*  341 */ PFNGLGETOBJECTPARAMETERFVARBPROC GetObjectParameterfvARB;
        /*  342 */ PFNGLGETOBJECTPARAMETERIVARBPROC GetObjectParameterivARB;
        /*  343 */ PFNGLGETOBJECTPTRLABELPROC GetObjectPtrLabel;
        /*  344 */ PFNGLGETPIXELMAPFVPROC GetPixelMapfv;
        /*  345 */ PFNGLGETPIXELMAPUIVPROC GetPixelMapuiv;
        /*  346 */ PFNGLGETPIXELMAPUSVPROC GetPixelMapusv;
        /*  347 */ PFNGLGETPOINTERINDEXEDVEXTPROC GetPointerIndexedvEXT;
        /*  348 */ PFNGLGETPOINTERI_VEXTPROC GetPointeri_vEXT;
        /*  349 */ PFNGLGETPOINTERVPROC GetPointerv;
        /*  350 */ PFNGLGETPOINTERVEXTPROC GetPointervEXT;
        /*  351 */ PFNGLGETPOLYGONSTIPPLEPROC GetPolygonStipple;
        /*  352 */ PFNGLGETPROGRAMENVPARAMETERDVARBPROC GetProgramEnvParameterdvARB;
        /*  353 */ PFNGLGETPROGRAMENVPARAMETERFVARBPROC GetProgramEnvParameterfvARB;
        /*  354 */ PFNGLGETPROGRAMINFOLOGPROC GetProgramInfoLog;
        /*  355 */ PFNGLGETPROGRAMLOCALPARAMETERDVARBPROC GetProgramLocalParameterdvARB;
        /*  356 */ PFNGLGETPROGRAMLOCALPARAMETERFVARBPROC GetProgramLocalParameterfvARB;
        /*  357 */ PFNGLGETPROGRAMPARAMETERDVNVPROC GetProgramParameterdvNV;
        /*  358 */ PFNGLGETPROGRAMPARAMETERFVNVPROC GetProgramParameterfvNV;
        /*  359 */ PFNGLGETPROGRAMSTRINGARBPROC GetProgramStringARB;
        /*  360 */ PFNGLGETPROGRAMSTRINGNVPROC GetProgramStringNV;
        /*  361 */ PFNGLGETPROGRAMIVPROC GetProgramiv;
        /*  362 */ PFNGLGETPROGRAMIVARBPROC GetProgramivARB;
        /*  363 */ PFNGLGETPROGRAMIVNVPROC GetProgramivNV;
        /*  364 */ PFNGLGETQUERYOBJECTIVPROC GetQueryObjectiv;
        /*  365 */ PFNGLGETQUERYOBJECTIVARBPROC GetQueryObjectivARB;
        /*  366 */ PFNGLGETQUERYOBJECTUIVPROC GetQueryObjectuiv;
        /*  367 */ PFNGLGETQUERYOBJECTUIVARBPROC GetQueryObjectuivARB;
        /*  368 */ PFNGLGETQUERYIVPROC GetQueryiv;
        /*  369 */ PFNGLGETQUERYIVARBPROC GetQueryivARB;
        /*  370 */ PFNGLGETSEPARABLEFILTERPROC GetSeparableFilter;
        /*  371 */ PFNGLGETSHADERINFOLOGPROC GetShaderInfoLog;
        /*  372 */ PFNGLGETSHADERSOURCEPROC GetShaderSource;
        /*  373 */ PFNGLGETSHADERSOURCEARBPROC GetShaderSourceARB;
        /*  374 */ PFNGLGETSHADERIVPROC GetShaderiv;
        /*  375 */ PFNGLGETSTRINGPROC GetString;
        /*  376 */ PFNGLGETTEXENVFVPROC GetTexEnvfv;
        /*  377 */ PFNGLGETTEXENVIVPROC GetTexEnviv;
        /*  378 */ PFNGLGETTEXGENDVPROC GetTexGendv;
        /*  379 */ PFNGLGETTEXGENFVPROC GetTexGenfv;
        /*  380 */ PFNGLGETTEXGENIVPROC GetTexGeniv;
        /*  381 */ PFNGLGETTEXIMAGEPROC GetTexImage;
        /*  382 */ PFNGLGETTEXLEVELPARAMETERFVPROC GetTexLevelParameterfv;
        /*  383 */ PFNGLGETTEXLEVELPARAMETERIVPROC GetTexLevelParameteriv;
        /*  384 */ PFNGLGETTEXPARAMETERFVPROC GetTexParameterfv;
        /*  385 */ PFNGLGETTEXPARAMETERIVPROC GetTexParameteriv;
        /*  386 */ PFNGLGETTEXTUREIMAGEEXTPROC GetTextureImageEXT;
        /*  387 */ PFNGLGETTEXTURELEVELPARAMETERFVEXTPROC GetTextureLevelParameterfvEXT;
        /*  388 */ PFNGLGETTEXTURELEVELPARAMETERIVEXTPROC GetTextureLevelParameterivEXT;
        /*  389 */ PFNGLGETTEXTUREPARAMETERIIVEXTPROC GetTextureParameterIivEXT;
        /*  390 */ PFNGLGETTEXTUREPARAMETERIUIVEXTPROC GetTextureParameterIuivEXT;
        /*  391 */ PFNGLGETTEXTUREPARAMETERFVEXTPROC GetTextureParameterfvEXT;
        /*  392 */ PFNGLGETTEXTUREPARAMETERIVEXTPROC GetTextureParameterivEXT;
        /*  393 */ PFNGLGETTRACKMATRIXIVNVPROC GetTrackMatrixivNV;
        /*  394 */ PFNGLGETUNIFORMLOCATIONPROC GetUniformLocation;
        /*  395 */ PFNGLGETUNIFORMLOCATIONARBPROC GetUniformLocationARB;
        /*  396 */ PFNGLGETUNIFORMFVPROC GetUniformfv;
        /*  397 */ PFNGLGETUNIFORMFVARBPROC GetUniformfvARB;
        /*  398 */ PFNGLGETUNIFORMIVPROC GetUniformiv;
        /*  399 */ PFNGLGETUNIFORMIVARBPROC GetUniformivARB;
        /*  400 */ PFNGLGETVERTEXARRAYINTEGERI_VEXTPROC GetVertexArrayIntegeri_vEXT;
        /*  401 */ PFNGLGETVERTEXARRAYINTEGERVEXTPROC GetVertexArrayIntegervEXT;
        /*  402 */ PFNGLGETVERTEXARRAYPOINTERI_VEXTPROC GetVertexArrayPointeri_vEXT;
        /*  403 */ PFNGLGETVERTEXARRAYPOINTERVEXTPROC GetVertexArrayPointervEXT;
        /*  404 */ PFNGLGETVERTEXATTRIBPOINTERVPROC GetVertexAttribPointerv;
        /*  405 */ PFNGLGETVERTEXATTRIBPOINTERVARBPROC GetVertexAttribPointervARB;
        /*  406 */ PFNGLGETVERTEXATTRIBPOINTERVNVPROC GetVertexAttribPointervNV;
        /*  407 */ PFNGLGETVERTEXATTRIBDVPROC GetVertexAttribdv;
        /*  408 */ PFNGLGETVERTEXATTRIBDVARBPROC GetVertexAttribdvARB;
        /*  409 */ PFNGLGETVERTEXATTRIBDVNVPROC GetVertexAttribdvNV;
        /*  410 */ PFNGLGETVERTEXATTRIBFVPROC GetVertexAttribfv;
        /*  411 */ PFNGLGETVERTEXATTRIBFVARBPROC GetVertexAttribfvARB;
        /*  412 */ PFNGLGETVERTEXATTRIBFVNVPROC GetVertexAttribfvNV;
        /*  413 */ PFNGLGETVERTEXATTRIBIVPROC GetVertexAttribiv;
        /*  414 */ PFNGLGETVERTEXATTRIBIVARBPROC GetVertexAttribivARB;
        /*  415 */ PFNGLGETVERTEXATTRIBIVNVPROC GetVertexAttribivNV;
        /*  416 */ PFNGLHINTPROC Hint;
        /*  417 */ PFNGLHISTOGRAMPROC Histogram;
        /*  418 */ PFNGLINDEXMASKPROC IndexMask;
        /*  419 */ PFNGLINDEXPOINTERPROC IndexPointer;
        /*  420 */ PFNGLINDEXPOINTEREXTPROC IndexPointerEXT;
        /*  421 */ PFNGLINDEXDPROC Indexd;
        /*  422 */ PFNGLINDEXDVPROC Indexdv;
        /*  423 */ PFNGLINDEXFPROC Indexf;
        /*  424 */ PFNGLINDEXFVPROC Indexfv;
        /*  425 */ PFNGLINDEXIPROC Indexi;
        /*  426 */ PFNGLINDEXIVPROC Indexiv;
        /*  427 */ PFNGLINDEXSPROC Indexs;
        /*  428 */ PFNGLINDEXSVPROC Indexsv;
        /*  429 */ PFNGLINDEXUBPROC Indexub;
        /*  430 */ PFNGLINDEXUBVPROC Indexubv;
        /*  431 */ PFNGLINITNAMESPROC InitNames;
        /*  432 */ PFNGLINTERLEAVEDARRAYSPROC InterleavedArrays;
        /*  433 */ PFNGLISBUFFERPROC IsBuffer;
        /*  434 */ PFNGLISBUFFERARBPROC IsBufferARB;
        /*  435 */ PFNGLISENABLEDPROC IsEnabled;
        /*  436 */ PFNGLISENABLEDINDEXEDEXTPROC IsEnabledIndexedEXT;
        /*  437 */ PFNGLISLISTPROC IsList;
        /*  438 */ PFNGLISPROGRAMPROC IsProgram;
        /*  439 */ PFNGLISPROGRAMARBPROC IsProgramARB;
        /*  440 */ PFNGLISPROGRAMNVPROC IsProgramNV;
        /*  441 */ PFNGLISQUERYPROC IsQuery;
        /*  442 */ PFNGLISQUERYARBPROC IsQueryARB;
        /*  443 */ PFNGLISSHADERPROC IsShader;
        /*  444 */ PFNGLISTEXTUREPROC IsTexture;
        /*  445 */ PFNGLISTEXTUREEXTPROC IsTextureEXT;
        /*  446 */ PFNGLLIGHTMODELFPROC LightModelf;
        /*  447 */ PFNGLLIGHTMODELFVPROC LightModelfv;
        /*  448 */ PFNGLLIGHTMODELIPROC LightModeli;
        /*  449 */ PFNGLLIGHTMODELIVPROC LightModeliv;
        /*  450 */ PFNGLLIGHTFPROC Lightf;
        /*  451 */ PFNGLLIGHTFVPROC Lightfv;
        /*  452 */ PFNGLLIGHTIPROC Lighti;
        /*  453 */ PFNGLLIGHTIVPROC Lightiv;
        /*  454 */ PFNGLLINESTIPPLEPROC LineStipple;
        /*  455 */ PFNGLLINEWIDTHPROC LineWidth;
        /*  456 */ PFNGLLINKPROGRAMPROC LinkProgram;
        /*  457 */ PFNGLLINKPROGRAMARBPROC LinkProgramARB;
        /*  458 */ PFNGLLISTBASEPROC ListBase;
        /*  459 */ PFNGLLOADIDENTITYPROC LoadIdentity;
        /*  460 */ PFNGLLOADMATRIXDPROC LoadMatrixd;
        /*  461 */ PFNGLLOADMATRIXFPROC LoadMatrixf;
        /*  462 */ PFNGLLOADNAMEPROC LoadName;
        /*  463 */ PFNGLLOADPROGRAMNVPROC LoadProgramNV;
        /*  464 */ PFNGLLOADTRANSPOSEMATRIXDPROC LoadTransposeMatrixd;
        /*  465 */ PFNGLLOADTRANSPOSEMATRIXDARBPROC LoadTransposeMatrixdARB;
        /*  466 */ PFNGLLOADTRANSPOSEMATRIXFPROC LoadTransposeMatrixf;
        /*  467 */ PFNGLLOADTRANSPOSEMATRIXFARBPROC LoadTransposeMatrixfARB;
        /*  468 */ PFNGLLOGICOPPROC LogicOp;
        /*  469 */ PFNGLMAP1DPROC Map1d;
        /*  470 */ PFNGLMAP1FPROC Map1f;
        /*  471 */ PFNGLMAP2DPROC Map2d;
        /*  472 */ PFNGLMAP2FPROC Map2f;
        /*  473 */ PFNGLMAPBUFFERPROC MapBuffer;
        /*  474 */ PFNGLMAPBUFFERARBPROC MapBufferARB;
        /*  475 */ PFNGLMAPGRID1DPROC MapGrid1d;
        /*  476 */ PFNGLMAPGRID1FPROC MapGrid1f;
        /*  477 */ PFNGLMAPGRID2DPROC MapGrid2d;
        /*  478 */ PFNGLMAPGRID2FPROC MapGrid2f;
        /*  479 */ PFNGLMAPNAMEDBUFFEREXTPROC MapNamedBufferEXT;
        /*  480 */ PFNGLMAPNAMEDBUFFERRANGEEXTPROC MapNamedBufferRangeEXT;
        /*  481 */ PFNGLMATERIALFPROC Materialf;
        /*  482 */ PFNGLMATERIALFVPROC Materialfv;
        /*  483 */ PFNGLMATERIALIPROC Materiali;
        /*  484 */ PFNGLMATERIALIVPROC Materialiv;
        /*  485 */ PFNGLMATRIXFRUSTUMEXTPROC MatrixFrustumEXT;
        /*  486 */ PFNGLMATRIXLOADIDENTITYEXTPROC MatrixLoadIdentityEXT;
        /*  487 */ PFNGLMATRIXLOADTRANSPOSEDEXTPROC MatrixLoadTransposedEXT;
        /*  488 */ PFNGLMATRIXLOADTRANSPOSEFEXTPROC MatrixLoadTransposefEXT;
        /*  489 */ PFNGLMATRIXLOADDEXTPROC MatrixLoaddEXT;
        /*  490 */ PFNGLMATRIXLOADFEXTPROC MatrixLoadfEXT;
        /*  491 */ PFNGLMATRIXMODEPROC MatrixMode;
        /*  492 */ PFNGLMATRIXMULTTRANSPOSEDEXTPROC MatrixMultTransposedEXT;
        /*  493 */ PFNGLMATRIXMULTTRANSPOSEFEXTPROC MatrixMultTransposefEXT;
        /*  494 */ PFNGLMATRIXMULTDEXTPROC MatrixMultdEXT;
        /*  495 */ PFNGLMATRIXMULTFEXTPROC MatrixMultfEXT;
        /*  496 */ PFNGLMATRIXORTHOEXTPROC MatrixOrthoEXT;
        /*  497 */ PFNGLMATRIXPOPEXTPROC MatrixPopEXT;
        /*  498 */ PFNGLMATRIXPUSHEXTPROC MatrixPushEXT;
        /*  499 */ PFNGLMATRIXROTATEDEXTPROC MatrixRotatedEXT;
        /*  500 */ PFNGLMATRIXROTATEFEXTPROC MatrixRotatefEXT;
        /*  501 */ PFNGLMATRIXSCALEDEXTPROC MatrixScaledEXT;
        /*  502 */ PFNGLMATRIXSCALEFEXTPROC MatrixScalefEXT;
        /*  503 */ PFNGLMATRIXTRANSLATEDEXTPROC MatrixTranslatedEXT;
        /*  504 */ PFNGLMATRIXTRANSLATEFEXTPROC MatrixTranslatefEXT;
        /*  505 */ PFNGLMINMAXPROC Minmax;
        /*  506 */ PFNGLMULTMATRIXDPROC MultMatrixd;
        /*  507 */ PFNGLMULTMATRIXFPROC MultMatrixf;
        /*  508 */ PFNGLMULTTRANSPOSEMATRIXDPROC MultTransposeMatrixd;
        /*  509 */ PFNGLMULTTRANSPOSEMATRIXDARBPROC MultTransposeMatrixdARB;
        /*  510 */ PFNGLMULTTRANSPOSEMATRIXFPROC MultTransposeMatrixf;
        /*  511 */ PFNGLMULTTRANSPOSEMATRIXFARBPROC MultTransposeMatrixfARB;
        /*  512 */ PFNGLMULTIDRAWARRAYSPROC MultiDrawArrays;
        /*  513 */ PFNGLMULTIDRAWARRAYSEXTPROC MultiDrawArraysEXT;
        /*  514 */ PFNGLMULTIDRAWELEMENTSPROC MultiDrawElements;
        /*  515 */ PFNGLMULTIDRAWELEMENTSEXTPROC MultiDrawElementsEXT;
        /*  516 */ PFNGLMULTITEXBUFFEREXTPROC MultiTexBufferEXT;
        /*  517 */ PFNGLMULTITEXCOORD1DPROC MultiTexCoord1d;
        /*  518 */ PFNGLMULTITEXCOORD1DARBPROC MultiTexCoord1dARB;
        /*  519 */ PFNGLMULTITEXCOORD1DVPROC MultiTexCoord1dv;
        /*  520 */ PFNGLMULTITEXCOORD1DVARBPROC MultiTexCoord1dvARB;
        /*  521 */ PFNGLMULTITEXCOORD1FPROC MultiTexCoord1f;
        /*  522 */ PFNGLMULTITEXCOORD1FARBPROC MultiTexCoord1fARB;
        /*  523 */ PFNGLMULTITEXCOORD1FVPROC MultiTexCoord1fv;
        /*  524 */ PFNGLMULTITEXCOORD1FVARBPROC MultiTexCoord1fvARB;
        /*  525 */ PFNGLMULTITEXCOORD1IPROC MultiTexCoord1i;
        /*  526 */ PFNGLMULTITEXCOORD1IARBPROC MultiTexCoord1iARB;
        /*  527 */ PFNGLMULTITEXCOORD1IVPROC MultiTexCoord1iv;
        /*  528 */ PFNGLMULTITEXCOORD1IVARBPROC MultiTexCoord1ivARB;
        /*  529 */ PFNGLMULTITEXCOORD1SPROC MultiTexCoord1s;
        /*  530 */ PFNGLMULTITEXCOORD1SARBPROC MultiTexCoord1sARB;
        /*  531 */ PFNGLMULTITEXCOORD1SVPROC MultiTexCoord1sv;
        /*  532 */ PFNGLMULTITEXCOORD1SVARBPROC MultiTexCoord1svARB;
        /*  533 */ PFNGLMULTITEXCOORD2DPROC MultiTexCoord2d;
        /*  534 */ PFNGLMULTITEXCOORD2DARBPROC MultiTexCoord2dARB;
        /*  535 */ PFNGLMULTITEXCOORD2DVPROC MultiTexCoord2dv;
        /*  536 */ PFNGLMULTITEXCOORD2DVARBPROC MultiTexCoord2dvARB;
        /*  537 */ PFNGLMULTITEXCOORD2FPROC MultiTexCoord2f;
        /*  538 */ PFNGLMULTITEXCOORD2FARBPROC MultiTexCoord2fARB;
        /*  539 */ PFNGLMULTITEXCOORD2FVPROC MultiTexCoord2fv;
        /*  540 */ PFNGLMULTITEXCOORD2FVARBPROC MultiTexCoord2fvARB;
        /*  541 */ PFNGLMULTITEXCOORD2IPROC MultiTexCoord2i;
        /*  542 */ PFNGLMULTITEXCOORD2IARBPROC MultiTexCoord2iARB;
        /*  543 */ PFNGLMULTITEXCOORD2IVPROC MultiTexCoord2iv;
        /*  544 */ PFNGLMULTITEXCOORD2IVARBPROC MultiTexCoord2ivARB;
        /*  545 */ PFNGLMULTITEXCOORD2SPROC MultiTexCoord2s;
        /*  546 */ PFNGLMULTITEXCOORD2SARBPROC MultiTexCoord2sARB;
        /*  547 */ PFNGLMULTITEXCOORD2SVPROC MultiTexCoord2sv;
        /*  548 */ PFNGLMULTITEXCOORD2SVARBPROC MultiTexCoord2svARB;
        /*  549 */ PFNGLMULTITEXCOORD3DPROC MultiTexCoord3d;
        /*  550 */ PFNGLMULTITEXCOORD3DARBPROC MultiTexCoord3dARB;
        /*  551 */ PFNGLMULTITEXCOORD3DVPROC MultiTexCoord3dv;
        /*  552 */ PFNGLMULTITEXCOORD3DVARBPROC MultiTexCoord3dvARB;
        /*  553 */ PFNGLMULTITEXCOORD3FPROC MultiTexCoord3f;
        /*  554 */ PFNGLMULTITEXCOORD3FARBPROC MultiTexCoord3fARB;
        /*  555 */ PFNGLMULTITEXCOORD3FVPROC MultiTexCoord3fv;
        /*  556 */ PFNGLMULTITEXCOORD3FVARBPROC MultiTexCoord3fvARB;
        /*  557 */ PFNGLMULTITEXCOORD3IPROC MultiTexCoord3i;
        /*  558 */ PFNGLMULTITEXCOORD3IARBPROC MultiTexCoord3iARB;
        /*  559 */ PFNGLMULTITEXCOORD3IVPROC MultiTexCoord3iv;
        /*  560 */ PFNGLMULTITEXCOORD3IVARBPROC MultiTexCoord3ivARB;
        /*  561 */ PFNGLMULTITEXCOORD3SPROC MultiTexCoord3s;
        /*  562 */ PFNGLMULTITEXCOORD3SARBPROC MultiTexCoord3sARB;
        /*  563 */ PFNGLMULTITEXCOORD3SVPROC MultiTexCoord3sv;
        /*  564 */ PFNGLMULTITEXCOORD3SVARBPROC MultiTexCoord3svARB;
        /*  565 */ PFNGLMULTITEXCOORD4DPROC MultiTexCoord4d;
        /*  566 */ PFNGLMULTITEXCOORD4DARBPROC MultiTexCoord4dARB;
        /*  567 */ PFNGLMULTITEXCOORD4DVPROC MultiTexCoord4dv;
        /*  568 */ PFNGLMULTITEXCOORD4DVARBPROC MultiTexCoord4dvARB;
        /*  569 */ PFNGLMULTITEXCOORD4FPROC MultiTexCoord4f;
        /*  570 */ PFNGLMULTITEXCOORD4FARBPROC MultiTexCoord4fARB;
        /*  571 */ PFNGLMULTITEXCOORD4FVPROC MultiTexCoord4fv;
        /*  572 */ PFNGLMULTITEXCOORD4FVARBPROC MultiTexCoord4fvARB;
        /*  573 */ PFNGLMULTITEXCOORD4IPROC MultiTexCoord4i;
        /*  574 */ PFNGLMULTITEXCOORD4IARBPROC MultiTexCoord4iARB;
        /*  575 */ PFNGLMULTITEXCOORD4IVPROC MultiTexCoord4iv;
        /*  576 */ PFNGLMULTITEXCOORD4IVARBPROC MultiTexCoord4ivARB;
        /*  577 */ PFNGLMULTITEXCOORD4SPROC MultiTexCoord4s;
        /*  578 */ PFNGLMULTITEXCOORD4SARBPROC MultiTexCoord4sARB;
        /*  579 */ PFNGLMULTITEXCOORD4SVPROC MultiTexCoord4sv;
        /*  580 */ PFNGLMULTITEXCOORD4SVARBPROC MultiTexCoord4svARB;
        /*  581 */ PFNGLMULTITEXCOORDPOINTEREXTPROC MultiTexCoordPointerEXT;
        /*  582 */ PFNGLMULTITEXENVFEXTPROC MultiTexEnvfEXT;
        /*  583 */ PFNGLMULTITEXENVFVEXTPROC MultiTexEnvfvEXT;
        /*  584 */ PFNGLMULTITEXENVIEXTPROC MultiTexEnviEXT;
        /*  585 */ PFNGLMULTITEXENVIVEXTPROC MultiTexEnvivEXT;
        /*  586 */ PFNGLMULTITEXGENDEXTPROC MultiTexGendEXT;
        /*  587 */ PFNGLMULTITEXGENDVEXTPROC MultiTexGendvEXT;
        /*  588 */ PFNGLMULTITEXGENFEXTPROC MultiTexGenfEXT;
        /*  589 */ PFNGLMULTITEXGENFVEXTPROC MultiTexGenfvEXT;
        /*  590 */ PFNGLMULTITEXGENIEXTPROC MultiTexGeniEXT;
        /*  591 */ PFNGLMULTITEXGENIVEXTPROC MultiTexGenivEXT;
        /*  592 */ PFNGLMULTITEXIMAGE1DEXTPROC MultiTexImage1DEXT;
        /*  593 */ PFNGLMULTITEXIMAGE2DEXTPROC MultiTexImage2DEXT;
        /*  594 */ PFNGLMULTITEXIMAGE3DEXTPROC MultiTexImage3DEXT;
        /*  595 */ PFNGLMULTITEXPARAMETERIIVEXTPROC MultiTexParameterIivEXT;
        /*  596 */ PFNGLMULTITEXPARAMETERIUIVEXTPROC MultiTexParameterIuivEXT;
        /*  597 */ PFNGLMULTITEXPARAMETERFEXTPROC MultiTexParameterfEXT;
        /*  598 */ PFNGLMULTITEXPARAMETERFVEXTPROC MultiTexParameterfvEXT;
        /*  599 */ PFNGLMULTITEXPARAMETERIEXTPROC MultiTexParameteriEXT;
        /*  600 */ PFNGLMULTITEXPARAMETERIVEXTPROC MultiTexParameterivEXT;
        /*  601 */ PFNGLMULTITEXRENDERBUFFEREXTPROC MultiTexRenderbufferEXT;
        /*  602 */ PFNGLMULTITEXSUBIMAGE1DEXTPROC MultiTexSubImage1DEXT;
        /*  603 */ PFNGLMULTITEXSUBIMAGE2DEXTPROC MultiTexSubImage2DEXT;
        /*  604 */ PFNGLMULTITEXSUBIMAGE3DEXTPROC MultiTexSubImage3DEXT;
        /*  605 */ PFNGLNAMEDBUFFERDATAEXTPROC NamedBufferDataEXT;
        /*  606 */ PFNGLNAMEDBUFFERSTORAGEEXTPROC NamedBufferStorageEXT;
        /*  607 */ PFNGLNAMEDBUFFERSUBDATAEXTPROC NamedBufferSubDataEXT;
        /*  608 */ PFNGLNAMEDCOPYBUFFERSUBDATAEXTPROC NamedCopyBufferSubDataEXT;
        /*  609 */ PFNGLNAMEDFRAMEBUFFERPARAMETERIEXTPROC NamedFramebufferParameteriEXT;
        /*  610 */ PFNGLNAMEDFRAMEBUFFERRENDERBUFFEREXTPROC NamedFramebufferRenderbufferEXT;
        /*  611 */ PFNGLNAMEDFRAMEBUFFERTEXTURE1DEXTPROC NamedFramebufferTexture1DEXT;
        /*  612 */ PFNGLNAMEDFRAMEBUFFERTEXTURE2DEXTPROC NamedFramebufferTexture2DEXT;
        /*  613 */ PFNGLNAMEDFRAMEBUFFERTEXTURE3DEXTPROC NamedFramebufferTexture3DEXT;
        /*  614 */ PFNGLNAMEDFRAMEBUFFERTEXTUREEXTPROC NamedFramebufferTextureEXT;
        /*  615 */ PFNGLNAMEDFRAMEBUFFERTEXTUREFACEEXTPROC NamedFramebufferTextureFaceEXT;
        /*  616 */ PFNGLNAMEDFRAMEBUFFERTEXTURELAYEREXTPROC NamedFramebufferTextureLayerEXT;
        /*  617 */ PFNGLNAMEDPROGRAMLOCALPARAMETER4DEXTPROC NamedProgramLocalParameter4dEXT;
        /*  618 */ PFNGLNAMEDPROGRAMLOCALPARAMETER4DVEXTPROC NamedProgramLocalParameter4dvEXT;
        /*  619 */ PFNGLNAMEDPROGRAMLOCALPARAMETER4FEXTPROC NamedProgramLocalParameter4fEXT;
        /*  620 */ PFNGLNAMEDPROGRAMLOCALPARAMETER4FVEXTPROC NamedProgramLocalParameter4fvEXT;
        /*  621 */ PFNGLNAMEDPROGRAMLOCALPARAMETERI4IEXTPROC NamedProgramLocalParameterI4iEXT;
        /*  622 */ PFNGLNAMEDPROGRAMLOCALPARAMETERI4IVEXTPROC NamedProgramLocalParameterI4ivEXT;
        /*  623 */ PFNGLNAMEDPROGRAMLOCALPARAMETERI4UIEXTPROC NamedProgramLocalParameterI4uiEXT;
        /*  624 */ PFNGLNAMEDPROGRAMLOCALPARAMETERI4UIVEXTPROC NamedProgramLocalParameterI4uivEXT;
        /*  625 */ PFNGLNAMEDPROGRAMLOCALPARAMETERS4FVEXTPROC NamedProgramLocalParameters4fvEXT;
        /*  626 */ PFNGLNAMEDPROGRAMLOCALPARAMETERSI4IVEXTPROC NamedProgramLocalParametersI4ivEXT;
        /*  627 */ PFNGLNAMEDPROGRAMLOCALPARAMETERSI4UIVEXTPROC NamedProgramLocalParametersI4uivEXT;
        /*  628 */ PFNGLNAMEDPROGRAMSTRINGEXTPROC NamedProgramStringEXT;
        /*  629 */ PFNGLNAMEDRENDERBUFFERSTORAGEEXTPROC NamedRenderbufferStorageEXT;
        /*  630 */ PFNGLNAMEDRENDERBUFFERSTORAGEMULTISAMPLECOVERAGEEXTPROC NamedRenderbufferStorageMultisampleCoverageEXT;
        /*  631 */ PFNGLNAMEDRENDERBUFFERSTORAGEMULTISAMPLEEXTPROC NamedRenderbufferStorageMultisampleEXT;
        /*  632 */ PFNGLNEWLISTPROC NewList;
        /*  633 */ PFNGLNORMAL3BPROC Normal3b;
        /*  634 */ PFNGLNORMAL3BVPROC Normal3bv;
        /*  635 */ PFNGLNORMAL3DPROC Normal3d;
        /*  636 */ PFNGLNORMAL3DVPROC Normal3dv;
        /*  637 */ PFNGLNORMAL3FPROC Normal3f;
        /*  638 */ PFNGLNORMAL3FVPROC Normal3fv;
        /*  639 */ PFNGLNORMAL3IPROC Normal3i;
        /*  640 */ PFNGLNORMAL3IVPROC Normal3iv;
        /*  641 */ PFNGLNORMAL3SPROC Normal3s;
        /*  642 */ PFNGLNORMAL3SVPROC Normal3sv;
        /*  643 */ PFNGLNORMALPOINTERPROC NormalPointer;
        /*  644 */ PFNGLNORMALPOINTEREXTPROC NormalPointerEXT;
        /*  645 */ PFNGLOBJECTLABELPROC ObjectLabel;
        /*  646 */ PFNGLOBJECTPTRLABELPROC ObjectPtrLabel;
        /*  647 */ PFNGLORTHOPROC Ortho;
        /*  648 */ PFNGLPASSTHROUGHPROC PassThrough;
        /*  649 */ PFNGLPIXELMAPFVPROC PixelMapfv;
        /*  650 */ PFNGLPIXELMAPUIVPROC PixelMapuiv;
        /*  651 */ PFNGLPIXELMAPUSVPROC PixelMapusv;
        /*  652 */ PFNGLPIXELSTOREFPROC PixelStoref;
        /*  653 */ PFNGLPIXELSTOREIPROC PixelStorei;
        /*  654 */ PFNGLPIXELTRANSFERFPROC PixelTransferf;
        /*  655 */ PFNGLPIXELTRANSFERIPROC PixelTransferi;
        /*  656 */ PFNGLPIXELZOOMPROC PixelZoom;
        /*  657 */ PFNGLPOINTPARAMETERFPROC PointParameterf;
        /*  658 */ PFNGLPOINTPARAMETERFARBPROC PointParameterfARB;
        /*  659 */ PFNGLPOINTPARAMETERFEXTPROC PointParameterfEXT;
        /*  660 */ PFNGLPOINTPARAMETERFSGISPROC PointParameterfSGIS;
        /*  661 */ PFNGLPOINTPARAMETERFVPROC PointParameterfv;
        /*  662 */ PFNGLPOINTPARAMETERFVARBPROC PointParameterfvARB;
        /*  663 */ PFNGLPOINTPARAMETERFVEXTPROC PointParameterfvEXT;
        /*  664 */ PFNGLPOINTPARAMETERFVSGISPROC PointParameterfvSGIS;
        /*  665 */ PFNGLPOINTPARAMETERIPROC PointParameteri;
        /*  666 */ PFNGLPOINTPARAMETERINVPROC PointParameteriNV;
        /*  667 */ PFNGLPOINTPARAMETERIVPROC PointParameteriv;
        /*  668 */ PFNGLPOINTPARAMETERIVNVPROC PointParameterivNV;
        /*  669 */ PFNGLPOINTSIZEPROC PointSize;
        /*  670 */ PFNGLPOLYGONMODEPROC PolygonMode;
        /*  671 */ PFNGLPOLYGONOFFSETPROC PolygonOffset;
        /*  672 */ PFNGLPOLYGONSTIPPLEPROC PolygonStipple;
        /*  673 */ PFNGLPOPATTRIBPROC PopAttrib;
        /*  674 */ PFNGLPOPCLIENTATTRIBPROC PopClientAttrib;
        /*  675 */ PFNGLPOPDEBUGGROUPPROC PopDebugGroup;
        /*  676 */ PFNGLPOPMATRIXPROC PopMatrix;
        /*  677 */ PFNGLPOPNAMEPROC PopName;
        /*  678 */ PFNGLPRIORITIZETEXTURESPROC PrioritizeTextures;
        /*  679 */ PFNGLPRIORITIZETEXTURESEXTPROC PrioritizeTexturesEXT;
        /*  680 */ PFNGLPROGRAMENVPARAMETER4DARBPROC ProgramEnvParameter4dARB;
        /*  681 */ PFNGLPROGRAMENVPARAMETER4DVARBPROC ProgramEnvParameter4dvARB;
        /*  682 */ PFNGLPROGRAMENVPARAMETER4FARBPROC ProgramEnvParameter4fARB;
        /*  683 */ PFNGLPROGRAMENVPARAMETER4FVARBPROC ProgramEnvParameter4fvARB;
        /*  684 */ PFNGLPROGRAMLOCALPARAMETER4DARBPROC ProgramLocalParameter4dARB;
        /*  685 */ PFNGLPROGRAMLOCALPARAMETER4DVARBPROC ProgramLocalParameter4dvARB;
        /*  686 */ PFNGLPROGRAMLOCALPARAMETER4FARBPROC ProgramLocalParameter4fARB;
        /*  687 */ PFNGLPROGRAMLOCALPARAMETER4FVARBPROC ProgramLocalParameter4fvARB;
        /*  688 */ PFNGLPROGRAMPARAMETER4DNVPROC ProgramParameter4dNV;
        /*  689 */ PFNGLPROGRAMPARAMETER4DVNVPROC ProgramParameter4dvNV;
        /*  690 */ PFNGLPROGRAMPARAMETER4FNVPROC ProgramParameter4fNV;
        /*  691 */ PFNGLPROGRAMPARAMETER4FVNVPROC ProgramParameter4fvNV;
        /*  692 */ PFNGLPROGRAMPARAMETERS4DVNVPROC ProgramParameters4dvNV;
        /*  693 */ PFNGLPROGRAMPARAMETERS4FVNVPROC ProgramParameters4fvNV;
        /*  694 */ PFNGLPROGRAMSTRINGARBPROC ProgramStringARB;
        /*  695 */ PFNGLPROGRAMUNIFORM1DEXTPROC ProgramUniform1dEXT;
        /*  696 */ PFNGLPROGRAMUNIFORM1DVEXTPROC ProgramUniform1dvEXT;
        /*  697 */ PFNGLPROGRAMUNIFORM1FEXTPROC ProgramUniform1fEXT;
        /*  698 */ PFNGLPROGRAMUNIFORM1FVEXTPROC ProgramUniform1fvEXT;
        /*  699 */ PFNGLPROGRAMUNIFORM1IEXTPROC ProgramUniform1iEXT;
        /*  700 */ PFNGLPROGRAMUNIFORM1IVEXTPROC ProgramUniform1ivEXT;
        /*  701 */ PFNGLPROGRAMUNIFORM1UIEXTPROC ProgramUniform1uiEXT;
        /*  702 */ PFNGLPROGRAMUNIFORM1UIVEXTPROC ProgramUniform1uivEXT;
        /*  703 */ PFNGLPROGRAMUNIFORM2DEXTPROC ProgramUniform2dEXT;
        /*  704 */ PFNGLPROGRAMUNIFORM2DVEXTPROC ProgramUniform2dvEXT;
        /*  705 */ PFNGLPROGRAMUNIFORM2FEXTPROC ProgramUniform2fEXT;
        /*  706 */ PFNGLPROGRAMUNIFORM2FVEXTPROC ProgramUniform2fvEXT;
        /*  707 */ PFNGLPROGRAMUNIFORM2IEXTPROC ProgramUniform2iEXT;
        /*  708 */ PFNGLPROGRAMUNIFORM2IVEXTPROC ProgramUniform2ivEXT;
        /*  709 */ PFNGLPROGRAMUNIFORM2UIEXTPROC ProgramUniform2uiEXT;
        /*  710 */ PFNGLPROGRAMUNIFORM2UIVEXTPROC ProgramUniform2uivEXT;
        /*  711 */ PFNGLPROGRAMUNIFORM3DEXTPROC ProgramUniform3dEXT;
        /*  712 */ PFNGLPROGRAMUNIFORM3DVEXTPROC ProgramUniform3dvEXT;
        /*  713 */ PFNGLPROGRAMUNIFORM3FEXTPROC ProgramUniform3fEXT;
        /*  714 */ PFNGLPROGRAMUNIFORM3FVEXTPROC ProgramUniform3fvEXT;
        /*  715 */ PFNGLPROGRAMUNIFORM3IEXTPROC ProgramUniform3iEXT;
        /*  716 */ PFNGLPROGRAMUNIFORM3IVEXTPROC ProgramUniform3ivEXT;
        /*  717 */ PFNGLPROGRAMUNIFORM3UIEXTPROC ProgramUniform3uiEXT;
        /*  718 */ PFNGLPROGRAMUNIFORM3UIVEXTPROC ProgramUniform3uivEXT;
        /*  719 */ PFNGLPROGRAMUNIFORM4DEXTPROC ProgramUniform4dEXT;
        /*  720 */ PFNGLPROGRAMUNIFORM4DVEXTPROC ProgramUniform4dvEXT;
        /*  721 */ PFNGLPROGRAMUNIFORM4FEXTPROC ProgramUniform4fEXT;
        /*  722 */ PFNGLPROGRAMUNIFORM4FVEXTPROC ProgramUniform4fvEXT;
        /*  723 */ PFNGLPROGRAMUNIFORM4IEXTPROC ProgramUniform4iEXT;
        /*  724 */ PFNGLPROGRAMUNIFORM4IVEXTPROC ProgramUniform4ivEXT;
        /*  725 */ PFNGLPROGRAMUNIFORM4UIEXTPROC ProgramUniform4uiEXT;
        /*  726 */ PFNGLPROGRAMUNIFORM4UIVEXTPROC ProgramUniform4uivEXT;
        /*  727 */ PFNGLPROGRAMUNIFORMMATRIX2DVEXTPROC ProgramUniformMatrix2dvEXT;
        /*  728 */ PFNGLPROGRAMUNIFORMMATRIX2FVEXTPROC ProgramUniformMatrix2fvEXT;
        /*  729 */ PFNGLPROGRAMUNIFORMMATRIX2X3DVEXTPROC ProgramUniformMatrix2x3dvEXT;
        /*  730 */ PFNGLPROGRAMUNIFORMMATRIX2X3FVEXTPROC ProgramUniformMatrix2x3fvEXT;
        /*  731 */ PFNGLPROGRAMUNIFORMMATRIX2X4DVEXTPROC ProgramUniformMatrix2x4dvEXT;
        /*  732 */ PFNGLPROGRAMUNIFORMMATRIX2X4FVEXTPROC ProgramUniformMatrix2x4fvEXT;
        /*  733 */ PFNGLPROGRAMUNIFORMMATRIX3DVEXTPROC ProgramUniformMatrix3dvEXT;
        /*  734 */ PFNGLPROGRAMUNIFORMMATRIX3FVEXTPROC ProgramUniformMatrix3fvEXT;
        /*  735 */ PFNGLPROGRAMUNIFORMMATRIX3X2DVEXTPROC ProgramUniformMatrix3x2dvEXT;
        /*  736 */ PFNGLPROGRAMUNIFORMMATRIX3X2FVEXTPROC ProgramUniformMatrix3x2fvEXT;
        /*  737 */ PFNGLPROGRAMUNIFORMMATRIX3X4DVEXTPROC ProgramUniformMatrix3x4dvEXT;
        /*  738 */ PFNGLPROGRAMUNIFORMMATRIX3X4FVEXTPROC ProgramUniformMatrix3x4fvEXT;
        /*  739 */ PFNGLPROGRAMUNIFORMMATRIX4DVEXTPROC ProgramUniformMatrix4dvEXT;
        /*  740 */ PFNGLPROGRAMUNIFORMMATRIX4FVEXTPROC ProgramUniformMatrix4fvEXT;
        /*  741 */ PFNGLPROGRAMUNIFORMMATRIX4X2DVEXTPROC ProgramUniformMatrix4x2dvEXT;
        /*  742 */ PFNGLPROGRAMUNIFORMMATRIX4X2FVEXTPROC ProgramUniformMatrix4x2fvEXT;
        /*  743 */ PFNGLPROGRAMUNIFORMMATRIX4X3DVEXTPROC ProgramUniformMatrix4x3dvEXT;
        /*  744 */ PFNGLPROGRAMUNIFORMMATRIX4X3FVEXTPROC ProgramUniformMatrix4x3fvEXT;
        /*  745 */ PFNGLPUSHATTRIBPROC PushAttrib;
        /*  746 */ PFNGLPUSHCLIENTATTRIBPROC PushClientAttrib;
        /*  747 */ PFNGLPUSHCLIENTATTRIBDEFAULTEXTPROC PushClientAttribDefaultEXT;
        /*  748 */ PFNGLPUSHDEBUGGROUPPROC PushDebugGroup;
        /*  749 */ PFNGLPUSHMATRIXPROC PushMatrix;
        /*  750 */ PFNGLPUSHNAMEPROC PushName;
        /*  751 */ PFNGLRASTERPOS2DPROC RasterPos2d;
        /*  752 */ PFNGLRASTERPOS2DVPROC RasterPos2dv;
        /*  753 */ PFNGLRASTERPOS2FPROC RasterPos2f;
        /*  754 */ PFNGLRASTERPOS2FVPROC RasterPos2fv;
        /*  755 */ PFNGLRASTERPOS2IPROC RasterPos2i;
        /*  756 */ PFNGLRASTERPOS2IVPROC RasterPos2iv;
        /*  757 */ PFNGLRASTERPOS2SPROC RasterPos2s;
        /*  758 */ PFNGLRASTERPOS2SVPROC RasterPos2sv;
        /*  759 */ PFNGLRASTERPOS3DPROC RasterPos3d;
        /*  760 */ PFNGLRASTERPOS3DVPROC RasterPos3dv;
        /*  761 */ PFNGLRASTERPOS3FPROC RasterPos3f;
        /*  762 */ PFNGLRASTERPOS3FVPROC RasterPos3fv;
        /*  763 */ PFNGLRASTERPOS3IPROC RasterPos3i;
        /*  764 */ PFNGLRASTERPOS3IVPROC RasterPos3iv;
        /*  765 */ PFNGLRASTERPOS3SPROC RasterPos3s;
        /*  766 */ PFNGLRASTERPOS3SVPROC RasterPos3sv;
        /*  767 */ PFNGLRASTERPOS4DPROC RasterPos4d;
        /*  768 */ PFNGLRASTERPOS4DVPROC RasterPos4dv;
        /*  769 */ PFNGLRASTERPOS4FPROC RasterPos4f;
        /*  770 */ PFNGLRASTERPOS4FVPROC RasterPos4fv;
        /*  771 */ PFNGLRASTERPOS4IPROC RasterPos4i;
        /*  772 */ PFNGLRASTERPOS4IVPROC RasterPos4iv;
        /*  773 */ PFNGLRASTERPOS4SPROC RasterPos4s;
        /*  774 */ PFNGLRASTERPOS4SVPROC RasterPos4sv;
        /*  775 */ PFNGLREADBUFFERPROC ReadBuffer;
        /*  776 */ PFNGLREADPIXELSPROC ReadPixels;
        /*  777 */ PFNGLRECTDPROC Rectd;
        /*  778 */ PFNGLRECTDVPROC Rectdv;
        /*  779 */ PFNGLRECTFPROC Rectf;
        /*  780 */ PFNGLRECTFVPROC Rectfv;
        /*  781 */ PFNGLRECTIPROC Recti;
        /*  782 */ PFNGLRECTIVPROC Rectiv;
        /*  783 */ PFNGLRECTSPROC Rects;
        /*  784 */ PFNGLRECTSVPROC Rectsv;
        /*  785 */ PFNGLRENDERMODEPROC RenderMode;
        /*  786 */ PFNGLREQUESTRESIDENTPROGRAMSNVPROC RequestResidentProgramsNV;
        /*  787 */ PFNGLRESETHISTOGRAMPROC ResetHistogram;
        /*  788 */ PFNGLRESETMINMAXPROC ResetMinmax;
        /*  789 */ PFNGLROTATEDPROC Rotated;
        /*  790 */ PFNGLROTATEFPROC Rotatef;
        /*  791 */ PFNGLSAMPLECOVERAGEPROC SampleCoverage;
        /*  792 */ PFNGLSAMPLECOVERAGEARBPROC SampleCoverageARB;
        /*  793 */ PFNGLSCALEDPROC Scaled;
        /*  794 */ PFNGLSCALEFPROC Scalef;
        /*  795 */ PFNGLSCISSORPROC Scissor;
        /*  796 */ PFNGLSECONDARYCOLOR3BPROC SecondaryColor3b;
        /*  797 */ PFNGLSECONDARYCOLOR3BEXTPROC SecondaryColor3bEXT;
        /*  798 */ PFNGLSECONDARYCOLOR3BVPROC SecondaryColor3bv;
        /*  799 */ PFNGLSECONDARYCOLOR3BVEXTPROC SecondaryColor3bvEXT;
        /*  800 */ PFNGLSECONDARYCOLOR3DPROC SecondaryColor3d;
        /*  801 */ PFNGLSECONDARYCOLOR3DEXTPROC SecondaryColor3dEXT;
        /*  802 */ PFNGLSECONDARYCOLOR3DVPROC SecondaryColor3dv;
        /*  803 */ PFNGLSECONDARYCOLOR3DVEXTPROC SecondaryColor3dvEXT;
        /*  804 */ PFNGLSECONDARYCOLOR3FPROC SecondaryColor3f;
        /*  805 */ PFNGLSECONDARYCOLOR3FEXTPROC SecondaryColor3fEXT;
        /*  806 */ PFNGLSECONDARYCOLOR3FVPROC SecondaryColor3fv;
        /*  807 */ PFNGLSECONDARYCOLOR3FVEXTPROC SecondaryColor3fvEXT;
        /*  808 */ PFNGLSECONDARYCOLOR3IPROC SecondaryColor3i;
        /*  809 */ PFNGLSECONDARYCOLOR3IEXTPROC SecondaryColor3iEXT;
        /*  810 */ PFNGLSECONDARYCOLOR3IVPROC SecondaryColor3iv;
        /*  811 */ PFNGLSECONDARYCOLOR3IVEXTPROC SecondaryColor3ivEXT;
        /*  812 */ PFNGLSECONDARYCOLOR3SPROC SecondaryColor3s;
        /*  813 */ PFNGLSECONDARYCOLOR3SEXTPROC SecondaryColor3sEXT;
        /*  814 */ PFNGLSECONDARYCOLOR3SVPROC SecondaryColor3sv;
        /*  815 */ PFNGLSECONDARYCOLOR3SVEXTPROC SecondaryColor3svEXT;
        /*  816 */ PFNGLSECONDARYCOLOR3UBPROC SecondaryColor3ub;
        /*  817 */ PFNGLSECONDARYCOLOR3UBEXTPROC SecondaryColor3ubEXT;
        /*  818 */ PFNGLSECONDARYCOLOR3UBVPROC SecondaryColor3ubv;
        /*  819 */ PFNGLSECONDARYCOLOR3UBVEXTPROC SecondaryColor3ubvEXT;
        /*  820 */ PFNGLSECONDARYCOLOR3UIPROC SecondaryColor3ui;
        /*  821 */ PFNGLSECONDARYCOLOR3UIEXTPROC SecondaryColor3uiEXT;
        /*  822 */ PFNGLSECONDARYCOLOR3UIVPROC SecondaryColor3uiv;
        /*  823 */ PFNGLSECONDARYCOLOR3UIVEXTPROC SecondaryColor3uivEXT;
        /*  824 */ PFNGLSECONDARYCOLOR3USPROC SecondaryColor3us;
        /*  825 */ PFNGLSECONDARYCOLOR3USEXTPROC SecondaryColor3usEXT;
        /*  826 */ PFNGLSECONDARYCOLOR3USVPROC SecondaryColor3usv;
        /*  827 */ PFNGLSECONDARYCOLOR3USVEXTPROC SecondaryColor3usvEXT;
        /*  828 */ PFNGLSECONDARYCOLORPOINTERPROC SecondaryColorPointer;
        /*  829 */ PFNGLSECONDARYCOLORPOINTEREXTPROC SecondaryColorPointerEXT;
        /*  830 */ PFNGLSELECTBUFFERPROC SelectBuffer;
        /*  831 */ PFNGLSEPARABLEFILTER2DPROC SeparableFilter2D;
        /*  832 */ PFNGLSHADEMODELPROC ShadeModel;
        /*  833 */ PFNGLSHADERSOURCEPROC ShaderSource;
        /*  834 */ PFNGLSHADERSOURCEARBPROC ShaderSourceARB;
        /*  835 */ PFNGLSTENCILFUNCPROC StencilFunc;
        /*  836 */ PFNGLSTENCILFUNCSEPARATEPROC StencilFuncSeparate;
        /*  837 */ PFNGLSTENCILFUNCSEPARATEATIPROC StencilFuncSeparateATI;
        /*  838 */ PFNGLSTENCILMASKPROC StencilMask;
        /*  839 */ PFNGLSTENCILMASKSEPARATEPROC StencilMaskSeparate;
        /*  840 */ PFNGLSTENCILOPPROC StencilOp;
        /*  841 */ PFNGLSTENCILOPSEPARATEPROC StencilOpSeparate;
        /*  842 */ PFNGLSTENCILOPSEPARATEATIPROC StencilOpSeparateATI;
        /*  843 */ PFNGLTEXCOORD1DPROC TexCoord1d;
        /*  844 */ PFNGLTEXCOORD1DVPROC TexCoord1dv;
        /*  845 */ PFNGLTEXCOORD1FPROC TexCoord1f;
        /*  846 */ PFNGLTEXCOORD1FVPROC TexCoord1fv;
        /*  847 */ PFNGLTEXCOORD1IPROC TexCoord1i;
        /*  848 */ PFNGLTEXCOORD1IVPROC TexCoord1iv;
        /*  849 */ PFNGLTEXCOORD1SPROC TexCoord1s;
        /*  850 */ PFNGLTEXCOORD1SVPROC TexCoord1sv;
        /*  851 */ PFNGLTEXCOORD2DPROC TexCoord2d;
        /*  852 */ PFNGLTEXCOORD2DVPROC TexCoord2dv;
        /*  853 */ PFNGLTEXCOORD2FPROC TexCoord2f;
        /*  854 */ PFNGLTEXCOORD2FVPROC TexCoord2fv;
        /*  855 */ PFNGLTEXCOORD2IPROC TexCoord2i;
        /*  856 */ PFNGLTEXCOORD2IVPROC TexCoord2iv;
        /*  857 */ PFNGLTEXCOORD2SPROC TexCoord2s;
        /*  858 */ PFNGLTEXCOORD2SVPROC TexCoord2sv;
        /*  859 */ PFNGLTEXCOORD3DPROC TexCoord3d;
        /*  860 */ PFNGLTEXCOORD3DVPROC TexCoord3dv;
        /*  861 */ PFNGLTEXCOORD3FPROC TexCoord3f;
        /*  862 */ PFNGLTEXCOORD3FVPROC TexCoord3fv;
        /*  863 */ PFNGLTEXCOORD3IPROC TexCoord3i;
        /*  864 */ PFNGLTEXCOORD3IVPROC TexCoord3iv;
        /*  865 */ PFNGLTEXCOORD3SPROC TexCoord3s;
        /*  866 */ PFNGLTEXCOORD3SVPROC TexCoord3sv;
        /*  867 */ PFNGLTEXCOORD4DPROC TexCoord4d;
        /*  868 */ PFNGLTEXCOORD4DVPROC TexCoord4dv;
        /*  869 */ PFNGLTEXCOORD4FPROC TexCoord4f;
        /*  870 */ PFNGLTEXCOORD4FVPROC TexCoord4fv;
        /*  871 */ PFNGLTEXCOORD4IPROC TexCoord4i;
        /*  872 */ PFNGLTEXCOORD4IVPROC TexCoord4iv;
        /*  873 */ PFNGLTEXCOORD4SPROC TexCoord4s;
        /*  874 */ PFNGLTEXCOORD4SVPROC TexCoord4sv;
        /*  875 */ PFNGLTEXCOORDPOINTERPROC TexCoordPointer;
        /*  876 */ PFNGLTEXCOORDPOINTEREXTPROC TexCoordPointerEXT;
        /*  877 */ PFNGLTEXENVFPROC TexEnvf;
        /*  878 */ PFNGLTEXENVFVPROC TexEnvfv;
        /*  879 */ PFNGLTEXENVIPROC TexEnvi;
        /*  880 */ PFNGLTEXENVIVPROC TexEnviv;
        /*  881 */ PFNGLTEXGENDPROC TexGend;
        /*  882 */ PFNGLTEXGENDVPROC TexGendv;
        /*  883 */ PFNGLTEXGENFPROC TexGenf;
        /*  884 */ PFNGLTEXGENFVPROC TexGenfv;
        /*  885 */ PFNGLTEXGENIPROC TexGeni;
        /*  886 */ PFNGLTEXGENIVPROC TexGeniv;
        /*  887 */ PFNGLTEXIMAGE1DPROC TexImage1D;
        /*  888 */ PFNGLTEXIMAGE2DPROC TexImage2D;
        /*  889 */ PFNGLTEXIMAGE3DPROC TexImage3D;
        /*  890 */ PFNGLTEXIMAGE3DEXTPROC TexImage3DEXT;
        /*  891 */ PFNGLTEXPARAMETERFPROC TexParameterf;
        /*  892 */ PFNGLTEXPARAMETERFVPROC TexParameterfv;
        /*  893 */ PFNGLTEXPARAMETERIPROC TexParameteri;
        /*  894 */ PFNGLTEXPARAMETERIVPROC TexParameteriv;
        /*  895 */ PFNGLTEXSTORAGE1DEXTPROC TexStorage1DEXT;
        /*  896 */ PFNGLTEXSTORAGE2DEXTPROC TexStorage2DEXT;
        /*  897 */ PFNGLTEXSTORAGE3DEXTPROC TexStorage3DEXT;
        /*  898 */ PFNGLTEXSUBIMAGE1DPROC TexSubImage1D;
        /*  899 */ PFNGLTEXSUBIMAGE1DEXTPROC TexSubImage1DEXT;
        /*  900 */ PFNGLTEXSUBIMAGE2DPROC TexSubImage2D;
        /*  901 */ PFNGLTEXSUBIMAGE2DEXTPROC TexSubImage2DEXT;
        /*  902 */ PFNGLTEXSUBIMAGE3DPROC TexSubImage3D;
        /*  903 */ PFNGLTEXSUBIMAGE3DEXTPROC TexSubImage3DEXT;
        /*  904 */ PFNGLTEXTUREBUFFEREXTPROC TextureBufferEXT;
        /*  905 */ PFNGLTEXTUREBUFFERRANGEEXTPROC TextureBufferRangeEXT;
        /*  906 */ PFNGLTEXTUREIMAGE1DEXTPROC TextureImage1DEXT;
        /*  907 */ PFNGLTEXTUREIMAGE2DEXTPROC TextureImage2DEXT;
        /*  908 */ PFNGLTEXTUREIMAGE3DEXTPROC TextureImage3DEXT;
        /*  909 */ PFNGLTEXTUREPAGECOMMITMENTEXTPROC TexturePageCommitmentEXT;
        /*  910 */ PFNGLTEXTUREPARAMETERIIVEXTPROC TextureParameterIivEXT;
        /*  911 */ PFNGLTEXTUREPARAMETERIUIVEXTPROC TextureParameterIuivEXT;
        /*  912 */ PFNGLTEXTUREPARAMETERFEXTPROC TextureParameterfEXT;
        /*  913 */ PFNGLTEXTUREPARAMETERFVEXTPROC TextureParameterfvEXT;
        /*  914 */ PFNGLTEXTUREPARAMETERIEXTPROC TextureParameteriEXT;
        /*  915 */ PFNGLTEXTUREPARAMETERIVEXTPROC TextureParameterivEXT;
        /*  916 */ PFNGLTEXTURERENDERBUFFEREXTPROC TextureRenderbufferEXT;
        /*  917 */ PFNGLTEXTURESTORAGE1DEXTPROC TextureStorage1DEXT;
        /*  918 */ PFNGLTEXTURESTORAGE2DEXTPROC TextureStorage2DEXT;
        /*  919 */ PFNGLTEXTURESTORAGE2DMULTISAMPLEEXTPROC TextureStorage2DMultisampleEXT;
        /*  920 */ PFNGLTEXTURESTORAGE3DEXTPROC TextureStorage3DEXT;
        /*  921 */ PFNGLTEXTURESTORAGE3DMULTISAMPLEEXTPROC TextureStorage3DMultisampleEXT;
        /*  922 */ PFNGLTEXTURESUBIMAGE1DEXTPROC TextureSubImage1DEXT;
        /*  923 */ PFNGLTEXTURESUBIMAGE2DEXTPROC TextureSubImage2DEXT;
        /*  924 */ PFNGLTEXTURESUBIMAGE3DEXTPROC TextureSubImage3DEXT;
        /*  925 */ PFNGLTRACKMATRIXNVPROC TrackMatrixNV;
        /*  926 */ PFNGLTRANSLATEDPROC Translated;
        /*  927 */ PFNGLTRANSLATEFPROC Translatef;
        /*  928 */ PFNGLUNIFORM1FPROC Uniform1f;
        /*  929 */ PFNGLUNIFORM1FARBPROC Uniform1fARB;
        /*  930 */ PFNGLUNIFORM1FVPROC Uniform1fv;
        /*  931 */ PFNGLUNIFORM1FVARBPROC Uniform1fvARB;
        /*  932 */ PFNGLUNIFORM1IPROC Uniform1i;
        /*  933 */ PFNGLUNIFORM1IARBPROC Uniform1iARB;
        /*  934 */ PFNGLUNIFORM1IVPROC Uniform1iv;
        /*  935 */ PFNGLUNIFORM1IVARBPROC Uniform1ivARB;
        /*  936 */ PFNGLUNIFORM2FPROC Uniform2f;
        /*  937 */ PFNGLUNIFORM2FARBPROC Uniform2fARB;
        /*  938 */ PFNGLUNIFORM2FVPROC Uniform2fv;
        /*  939 */ PFNGLUNIFORM2FVARBPROC Uniform2fvARB;
        /*  940 */ PFNGLUNIFORM2IPROC Uniform2i;
        /*  941 */ PFNGLUNIFORM2IARBPROC Uniform2iARB;
        /*  942 */ PFNGLUNIFORM2IVPROC Uniform2iv;
        /*  943 */ PFNGLUNIFORM2IVARBPROC Uniform2ivARB;
        /*  944 */ PFNGLUNIFORM3FPROC Uniform3f;
        /*  945 */ PFNGLUNIFORM3FARBPROC Uniform3fARB;
        /*  946 */ PFNGLUNIFORM3FVPROC Uniform3fv;
        /*  947 */ PFNGLUNIFORM3FVARBPROC Uniform3fvARB;
        /*  948 */ PFNGLUNIFORM3IPROC Uniform3i;
        /*  949 */ PFNGLUNIFORM3IARBPROC Uniform3iARB;
        /*  950 */ PFNGLUNIFORM3IVPROC Uniform3iv;
        /*  951 */ PFNGLUNIFORM3IVARBPROC Uniform3ivARB;
        /*  952 */ PFNGLUNIFORM4FPROC Uniform4f;
        /*  953 */ PFNGLUNIFORM4FARBPROC Uniform4fARB;
        /*  954 */ PFNGLUNIFORM4FVPROC Uniform4fv;
        /*  955 */ PFNGLUNIFORM4FVARBPROC Uniform4fvARB;
        /*  956 */ PFNGLUNIFORM4IPROC Uniform4i;
        /*  957 */ PFNGLUNIFORM4IARBPROC Uniform4iARB;
        /*  958 */ PFNGLUNIFORM4IVPROC Uniform4iv;
        /*  959 */ PFNGLUNIFORM4IVARBPROC Uniform4ivARB;
        /*  960 */ PFNGLUNIFORMMATRIX2FVPROC UniformMatrix2fv;
        /*  961 */ PFNGLUNIFORMMATRIX2FVARBPROC UniformMatrix2fvARB;
        /*  962 */ PFNGLUNIFORMMATRIX2X3FVPROC UniformMatrix2x3fv;
        /*  963 */ PFNGLUNIFORMMATRIX2X4FVPROC UniformMatrix2x4fv;
        /*  964 */ PFNGLUNIFORMMATRIX3FVPROC UniformMatrix3fv;
        /*  965 */ PFNGLUNIFORMMATRIX3FVARBPROC UniformMatrix3fvARB;
        /*  966 */ PFNGLUNIFORMMATRIX3X2FVPROC UniformMatrix3x2fv;
        /*  967 */ PFNGLUNIFORMMATRIX3X4FVPROC UniformMatrix3x4fv;
        /*  968 */ PFNGLUNIFORMMATRIX4FVPROC UniformMatrix4fv;
        /*  969 */ PFNGLUNIFORMMATRIX4FVARBPROC UniformMatrix4fvARB;
        /*  970 */ PFNGLUNIFORMMATRIX4X2FVPROC UniformMatrix4x2fv;
        /*  971 */ PFNGLUNIFORMMATRIX4X3FVPROC UniformMatrix4x3fv;
        /*  972 */ PFNGLUNMAPBUFFERPROC UnmapBuffer;
        /*  973 */ PFNGLUNMAPBUFFERARBPROC UnmapBufferARB;
        /*  974 */ PFNGLUNMAPNAMEDBUFFEREXTPROC UnmapNamedBufferEXT;
        /*  975 */ PFNGLUSEPROGRAMPROC UseProgram;
        /*  976 */ PFNGLUSEPROGRAMOBJECTARBPROC UseProgramObjectARB;
        /*  977 */ PFNGLVALIDATEPROGRAMPROC ValidateProgram;
        /*  978 */ PFNGLVALIDATEPROGRAMARBPROC ValidateProgramARB;
        /*  979 */ PFNGLVERTEX2DPROC Vertex2d;
        /*  980 */ PFNGLVERTEX2DVPROC Vertex2dv;
        /*  981 */ PFNGLVERTEX2FPROC Vertex2f;
        /*  982 */ PFNGLVERTEX2FVPROC Vertex2fv;
        /*  983 */ PFNGLVERTEX2IPROC Vertex2i;
        /*  984 */ PFNGLVERTEX2IVPROC Vertex2iv;
        /*  985 */ PFNGLVERTEX2SPROC Vertex2s;
        /*  986 */ PFNGLVERTEX2SVPROC Vertex2sv;
        /*  987 */ PFNGLVERTEX3DPROC Vertex3d;
        /*  988 */ PFNGLVERTEX3DVPROC Vertex3dv;
        /*  989 */ PFNGLVERTEX3FPROC Vertex3f;
        /*  990 */ PFNGLVERTEX3FVPROC Vertex3fv;
        /*  991 */ PFNGLVERTEX3IPROC Vertex3i;
        /*  992 */ PFNGLVERTEX3IVPROC Vertex3iv;
        /*  993 */ PFNGLVERTEX3SPROC Vertex3s;
        /*  994 */ PFNGLVERTEX3SVPROC Vertex3sv;
        /*  995 */ PFNGLVERTEX4DPROC Vertex4d;
        /*  996 */ PFNGLVERTEX4DVPROC Vertex4dv;
        /*  997 */ PFNGLVERTEX4FPROC Vertex4f;
        /*  998 */ PFNGLVERTEX4FVPROC Vertex4fv;
        /*  999 */ PFNGLVERTEX4IPROC Vertex4i;
        /* 1000 */ PFNGLVERTEX4IVPROC Vertex4iv;
        /* 1001 */ PFNGLVERTEX4SPROC Vertex4s;
        /* 1002 */ PFNGLVERTEX4SVPROC Vertex4sv;
        /* 1003 */ PFNGLVERTEXARRAYBINDVERTEXBUFFEREXTPROC VertexArrayBindVertexBufferEXT;
        /* 1004 */ PFNGLVERTEXARRAYCOLOROFFSETEXTPROC VertexArrayColorOffsetEXT;
        /* 1005 */ PFNGLVERTEXARRAYEDGEFLAGOFFSETEXTPROC VertexArrayEdgeFlagOffsetEXT;
        /* 1006 */ PFNGLVERTEXARRAYFOGCOORDOFFSETEXTPROC VertexArrayFogCoordOffsetEXT;
        /* 1007 */ PFNGLVERTEXARRAYINDEXOFFSETEXTPROC VertexArrayIndexOffsetEXT;
        /* 1008 */ PFNGLVERTEXARRAYMULTITEXCOORDOFFSETEXTPROC VertexArrayMultiTexCoordOffsetEXT;
        /* 1009 */ PFNGLVERTEXARRAYNORMALOFFSETEXTPROC VertexArrayNormalOffsetEXT;
        /* 1010 */ PFNGLVERTEXARRAYSECONDARYCOLOROFFSETEXTPROC VertexArraySecondaryColorOffsetEXT;
        /* 1011 */ PFNGLVERTEXARRAYTEXCOORDOFFSETEXTPROC VertexArrayTexCoordOffsetEXT;
        /* 1012 */ PFNGLVERTEXARRAYVERTEXATTRIBBINDINGEXTPROC VertexArrayVertexAttribBindingEXT;
        /* 1013 */ PFNGLVERTEXARRAYVERTEXATTRIBDIVISOREXTPROC VertexArrayVertexAttribDivisorEXT;
        /* 1014 */ PFNGLVERTEXARRAYVERTEXATTRIBFORMATEXTPROC VertexArrayVertexAttribFormatEXT;
        /* 1015 */ PFNGLVERTEXARRAYVERTEXATTRIBIFORMATEXTPROC VertexArrayVertexAttribIFormatEXT;
        /* 1016 */ PFNGLVERTEXARRAYVERTEXATTRIBIOFFSETEXTPROC VertexArrayVertexAttribIOffsetEXT;
        /* 1017 */ PFNGLVERTEXARRAYVERTEXATTRIBLFORMATEXTPROC VertexArrayVertexAttribLFormatEXT;
        /* 1018 */ PFNGLVERTEXARRAYVERTEXATTRIBLOFFSETEXTPROC VertexArrayVertexAttribLOffsetEXT;
        /* 1019 */ PFNGLVERTEXARRAYVERTEXATTRIBOFFSETEXTPROC VertexArrayVertexAttribOffsetEXT;
        /* 1020 */ PFNGLVERTEXARRAYVERTEXBINDINGDIVISOREXTPROC VertexArrayVertexBindingDivisorEXT;
        /* 1021 */ PFNGLVERTEXARRAYVERTEXOFFSETEXTPROC VertexArrayVertexOffsetEXT;
        /* 1022 */ PFNGLVERTEXATTRIB1DPROC VertexAttrib1d;
        /* 1023 */ PFNGLVERTEXATTRIB1DARBPROC VertexAttrib1dARB;
        /* 1024 */ PFNGLVERTEXATTRIB1DNVPROC VertexAttrib1dNV;
        /* 1025 */ PFNGLVERTEXATTRIB1DVPROC VertexAttrib1dv;
        /* 1026 */ PFNGLVERTEXATTRIB1DVARBPROC VertexAttrib1dvARB;
        /* 1027 */ PFNGLVERTEXATTRIB1DVNVPROC VertexAttrib1dvNV;
        /* 1028 */ PFNGLVERTEXATTRIB1FPROC VertexAttrib1f;
        /* 1029 */ PFNGLVERTEXATTRIB1FARBPROC VertexAttrib1fARB;
        /* 1030 */ PFNGLVERTEXATTRIB1FNVPROC VertexAttrib1fNV;
        /* 1031 */ PFNGLVERTEXATTRIB1FVPROC VertexAttrib1fv;
        /* 1032 */ PFNGLVERTEXATTRIB1FVARBPROC VertexAttrib1fvARB;
        /* 1033 */ PFNGLVERTEXATTRIB1FVNVPROC VertexAttrib1fvNV;
        /* 1034 */ PFNGLVERTEXATTRIB1SPROC VertexAttrib1s;
        /* 1035 */ PFNGLVERTEXATTRIB1SARBPROC VertexAttrib1sARB;
        /* 1036 */ PFNGLVERTEXATTRIB1SNVPROC VertexAttrib1sNV;
        /* 1037 */ PFNGLVERTEXATTRIB1SVPROC VertexAttrib1sv;
        /* 1038 */ PFNGLVERTEXATTRIB1SVARBPROC VertexAttrib1svARB;
        /* 1039 */ PFNGLVERTEXATTRIB1SVNVPROC VertexAttrib1svNV;
        /* 1040 */ PFNGLVERTEXATTRIB2DPROC VertexAttrib2d;
        /* 1041 */ PFNGLVERTEXATTRIB2DARBPROC VertexAttrib2dARB;
        /* 1042 */ PFNGLVERTEXATTRIB2DNVPROC VertexAttrib2dNV;
        /* 1043 */ PFNGLVERTEXATTRIB2DVPROC VertexAttrib2dv;
        /* 1044 */ PFNGLVERTEXATTRIB2DVARBPROC VertexAttrib2dvARB;
        /* 1045 */ PFNGLVERTEXATTRIB2DVNVPROC VertexAttrib2dvNV;
        /* 1046 */ PFNGLVERTEXATTRIB2FPROC VertexAttrib2f;
        /* 1047 */ PFNGLVERTEXATTRIB2FARBPROC VertexAttrib2fARB;
        /* 1048 */ PFNGLVERTEXATTRIB2FNVPROC VertexAttrib2fNV;
        /* 1049 */ PFNGLVERTEXATTRIB2FVPROC VertexAttrib2fv;
        /* 1050 */ PFNGLVERTEXATTRIB2FVARBPROC VertexAttrib2fvARB;
        /* 1051 */ PFNGLVERTEXATTRIB2FVNVPROC VertexAttrib2fvNV;
        /* 1052 */ PFNGLVERTEXATTRIB2SPROC VertexAttrib2s;
        /* 1053 */ PFNGLVERTEXATTRIB2SARBPROC VertexAttrib2sARB;
        /* 1054 */ PFNGLVERTEXATTRIB2SNVPROC VertexAttrib2sNV;
        /* 1055 */ PFNGLVERTEXATTRIB2SVPROC VertexAttrib2sv;
        /* 1056 */ PFNGLVERTEXATTRIB2SVARBPROC VertexAttrib2svARB;
        /* 1057 */ PFNGLVERTEXATTRIB2SVNVPROC VertexAttrib2svNV;
        /* 1058 */ PFNGLVERTEXATTRIB3DPROC VertexAttrib3d;
        /* 1059 */ PFNGLVERTEXATTRIB3DARBPROC VertexAttrib3dARB;
        /* 1060 */ PFNGLVERTEXATTRIB3DNVPROC VertexAttrib3dNV;
        /* 1061 */ PFNGLVERTEXATTRIB3DVPROC VertexAttrib3dv;
        /* 1062 */ PFNGLVERTEXATTRIB3DVARBPROC VertexAttrib3dvARB;
        /* 1063 */ PFNGLVERTEXATTRIB3DVNVPROC VertexAttrib3dvNV;
        /* 1064 */ PFNGLVERTEXATTRIB3FPROC VertexAttrib3f;
        /* 1065 */ PFNGLVERTEXATTRIB3FARBPROC VertexAttrib3fARB;
        /* 1066 */ PFNGLVERTEXATTRIB3FNVPROC VertexAttrib3fNV;
        /* 1067 */ PFNGLVERTEXATTRIB3FVPROC VertexAttrib3fv;
        /* 1068 */ PFNGLVERTEXATTRIB3FVARBPROC VertexAttrib3fvARB;
        /* 1069 */ PFNGLVERTEXATTRIB3FVNVPROC VertexAttrib3fvNV;
        /* 1070 */ PFNGLVERTEXATTRIB3SPROC VertexAttrib3s;
        /* 1071 */ PFNGLVERTEXATTRIB3SARBPROC VertexAttrib3sARB;
        /* 1072 */ PFNGLVERTEXATTRIB3SNVPROC VertexAttrib3sNV;
        /* 1073 */ PFNGLVERTEXATTRIB3SVPROC VertexAttrib3sv;
        /* 1074 */ PFNGLVERTEXATTRIB3SVARBPROC VertexAttrib3svARB;
        /* 1075 */ PFNGLVERTEXATTRIB3SVNVPROC VertexAttrib3svNV;
        /* 1076 */ PFNGLVERTEXATTRIB4NBVPROC VertexAttrib4Nbv;
        /* 1077 */ PFNGLVERTEXATTRIB4NBVARBPROC VertexAttrib4NbvARB;
        /* 1078 */ PFNGLVERTEXATTRIB4NIVPROC VertexAttrib4Niv;
        /* 1079 */ PFNGLVERTEXATTRIB4NIVARBPROC VertexAttrib4NivARB;
        /* 1080 */ PFNGLVERTEXATTRIB4NSVPROC VertexAttrib4Nsv;
        /* 1081 */ PFNGLVERTEXATTRIB4NSVARBPROC VertexAttrib4NsvARB;
        /* 1082 */ PFNGLVERTEXATTRIB4NUBPROC VertexAttrib4Nub;
        /* 1083 */ PFNGLVERTEXATTRIB4NUBARBPROC VertexAttrib4NubARB;
        /* 1084 */ PFNGLVERTEXATTRIB4NUBVPROC VertexAttrib4Nubv;
        /* 1085 */ PFNGLVERTEXATTRIB4NUBVARBPROC VertexAttrib4NubvARB;
        /* 1086 */ PFNGLVERTEXATTRIB4NUIVPROC VertexAttrib4Nuiv;
        /* 1087 */ PFNGLVERTEXATTRIB4NUIVARBPROC VertexAttrib4NuivARB;
        /* 1088 */ PFNGLVERTEXATTRIB4NUSVPROC VertexAttrib4Nusv;
        /* 1089 */ PFNGLVERTEXATTRIB4NUSVARBPROC VertexAttrib4NusvARB;
        /* 1090 */ PFNGLVERTEXATTRIB4BVPROC VertexAttrib4bv;
        /* 1091 */ PFNGLVERTEXATTRIB4BVARBPROC VertexAttrib4bvARB;
        /* 1092 */ PFNGLVERTEXATTRIB4DPROC VertexAttrib4d;
        /* 1093 */ PFNGLVERTEXATTRIB4DARBPROC VertexAttrib4dARB;
        /* 1094 */ PFNGLVERTEXATTRIB4DNVPROC VertexAttrib4dNV;
        /* 1095 */ PFNGLVERTEXATTRIB4DVPROC VertexAttrib4dv;
        /* 1096 */ PFNGLVERTEXATTRIB4DVARBPROC VertexAttrib4dvARB;
        /* 1097 */ PFNGLVERTEXATTRIB4DVNVPROC VertexAttrib4dvNV;
        /* 1098 */ PFNGLVERTEXATTRIB4FPROC VertexAttrib4f;
        /* 1099 */ PFNGLVERTEXATTRIB4FARBPROC VertexAttrib4fARB;
        /* 1100 */ PFNGLVERTEXATTRIB4FNVPROC VertexAttrib4fNV;
        /* 1101 */ PFNGLVERTEXATTRIB4FVPROC VertexAttrib4fv;
        /* 1102 */ PFNGLVERTEXATTRIB4FVARBPROC VertexAttrib4fvARB;
        /* 1103 */ PFNGLVERTEXATTRIB4FVNVPROC VertexAttrib4fvNV;
        /* 1104 */ PFNGLVERTEXATTRIB4IVPROC VertexAttrib4iv;
        /* 1105 */ PFNGLVERTEXATTRIB4IVARBPROC VertexAttrib4ivARB;
        /* 1106 */ PFNGLVERTEXATTRIB4SPROC VertexAttrib4s;
        /* 1107 */ PFNGLVERTEXATTRIB4SARBPROC VertexAttrib4sARB;
        /* 1108 */ PFNGLVERTEXATTRIB4SNVPROC VertexAttrib4sNV;
        /* 1109 */ PFNGLVERTEXATTRIB4SVPROC VertexAttrib4sv;
        /* 1110 */ PFNGLVERTEXATTRIB4SVARBPROC VertexAttrib4svARB;
        /* 1111 */ PFNGLVERTEXATTRIB4SVNVPROC VertexAttrib4svNV;
        /* 1112 */ PFNGLVERTEXATTRIB4UBNVPROC VertexAttrib4ubNV;
        /* 1113 */ PFNGLVERTEXATTRIB4UBVPROC VertexAttrib4ubv;
        /* 1114 */ PFNGLVERTEXATTRIB4UBVARBPROC VertexAttrib4ubvARB;
        /* 1115 */ PFNGLVERTEXATTRIB4UBVNVPROC VertexAttrib4ubvNV;
        /* 1116 */ PFNGLVERTEXATTRIB4UIVPROC VertexAttrib4uiv;
        /* 1117 */ PFNGLVERTEXATTRIB4UIVARBPROC VertexAttrib4uivARB;
        /* 1118 */ PFNGLVERTEXATTRIB4USVPROC VertexAttrib4usv;
        /* 1119 */ PFNGLVERTEXATTRIB4USVARBPROC VertexAttrib4usvARB;
        /* 1120 */ PFNGLVERTEXATTRIBPOINTERPROC VertexAttribPointer;
        /* 1121 */ PFNGLVERTEXATTRIBPOINTERARBPROC VertexAttribPointerARB;
        /* 1122 */ PFNGLVERTEXATTRIBPOINTERNVPROC VertexAttribPointerNV;
        /* 1123 */ PFNGLVERTEXATTRIBS1DVNVPROC VertexAttribs1dvNV;
        /* 1124 */ PFNGLVERTEXATTRIBS1FVNVPROC VertexAttribs1fvNV;
        /* 1125 */ PFNGLVERTEXATTRIBS1SVNVPROC VertexAttribs1svNV;
        /* 1126 */ PFNGLVERTEXATTRIBS2DVNVPROC VertexAttribs2dvNV;
        /* 1127 */ PFNGLVERTEXATTRIBS2FVNVPROC VertexAttribs2fvNV;
        /* 1128 */ PFNGLVERTEXATTRIBS2SVNVPROC VertexAttribs2svNV;
        /* 1129 */ PFNGLVERTEXATTRIBS3DVNVPROC VertexAttribs3dvNV;
        /* 1130 */ PFNGLVERTEXATTRIBS3FVNVPROC VertexAttribs3fvNV;
        /* 1131 */ PFNGLVERTEXATTRIBS3SVNVPROC VertexAttribs3svNV;
        /* 1132 */ PFNGLVERTEXATTRIBS4DVNVPROC VertexAttribs4dvNV;
        /* 1133 */ PFNGLVERTEXATTRIBS4FVNVPROC VertexAttribs4fvNV;
        /* 1134 */ PFNGLVERTEXATTRIBS4SVNVPROC VertexAttribs4svNV;
        /* 1135 */ PFNGLVERTEXATTRIBS4UBVNVPROC VertexAttribs4ubvNV;
        /* 1136 */ PFNGLVERTEXPOINTERPROC VertexPointer;
        /* 1137 */ PFNGLVERTEXPOINTEREXTPROC VertexPointerEXT;
        /* 1138 */ PFNGLVIEWPORTPROC Viewport;
        /* 1139 */ PFNGLWINDOWPOS2DPROC WindowPos2d;
        /* 1140 */ PFNGLWINDOWPOS2DARBPROC WindowPos2dARB;
        /* 1141 */ PFNGLWINDOWPOS2DMESAPROC WindowPos2dMESA;
        /* 1142 */ PFNGLWINDOWPOS2DVPROC WindowPos2dv;
        /* 1143 */ PFNGLWINDOWPOS2DVARBPROC WindowPos2dvARB;
        /* 1144 */ PFNGLWINDOWPOS2DVMESAPROC WindowPos2dvMESA;
        /* 1145 */ PFNGLWINDOWPOS2FPROC WindowPos2f;
        /* 1146 */ PFNGLWINDOWPOS2FARBPROC WindowPos2fARB;
        /* 1147 */ PFNGLWINDOWPOS2FMESAPROC WindowPos2fMESA;
        /* 1148 */ PFNGLWINDOWPOS2FVPROC WindowPos2fv;
        /* 1149 */ PFNGLWINDOWPOS2FVARBPROC WindowPos2fvARB;
        /* 1150 */ PFNGLWINDOWPOS2FVMESAPROC WindowPos2fvMESA;
        /* 1151 */ PFNGLWINDOWPOS2IPROC WindowPos2i;
        /* 1152 */ PFNGLWINDOWPOS2IARBPROC WindowPos2iARB;
        /* 1153 */ PFNGLWINDOWPOS2IMESAPROC WindowPos2iMESA;
        /* 1154 */ PFNGLWINDOWPOS2IVPROC WindowPos2iv;
        /* 1155 */ PFNGLWINDOWPOS2IVARBPROC WindowPos2ivARB;
        /* 1156 */ PFNGLWINDOWPOS2IVMESAPROC WindowPos2ivMESA;
        /* 1157 */ PFNGLWINDOWPOS2SPROC WindowPos2s;
        /* 1158 */ PFNGLWINDOWPOS2SARBPROC WindowPos2sARB;
        /* 1159 */ PFNGLWINDOWPOS2SMESAPROC WindowPos2sMESA;
        /* 1160 */ PFNGLWINDOWPOS2SVPROC WindowPos2sv;
        /* 1161 */ PFNGLWINDOWPOS2SVARBPROC WindowPos2svARB;
        /* 1162 */ PFNGLWINDOWPOS2SVMESAPROC WindowPos2svMESA;
        /* 1163 */ PFNGLWINDOWPOS3DPROC WindowPos3d;
        /* 1164 */ PFNGLWINDOWPOS3DARBPROC WindowPos3dARB;
        /* 1165 */ PFNGLWINDOWPOS3DMESAPROC WindowPos3dMESA;
        /* 1166 */ PFNGLWINDOWPOS3DVPROC WindowPos3dv;
        /* 1167 */ PFNGLWINDOWPOS3DVARBPROC WindowPos3dvARB;
        /* 1168 */ PFNGLWINDOWPOS3DVMESAPROC WindowPos3dvMESA;
        /* 1169 */ PFNGLWINDOWPOS3FPROC WindowPos3f;
        /* 1170 */ PFNGLWINDOWPOS3FARBPROC WindowPos3fARB;
        /* 1171 */ PFNGLWINDOWPOS3FMESAPROC WindowPos3fMESA;
        /* 1172 */ PFNGLWINDOWPOS3FVPROC WindowPos3fv;
        /* 1173 */ PFNGLWINDOWPOS3FVARBPROC WindowPos3fvARB;
        /* 1174 */ PFNGLWINDOWPOS3FVMESAPROC WindowPos3fvMESA;
        /* 1175 */ PFNGLWINDOWPOS3IPROC WindowPos3i;
        /* 1176 */ PFNGLWINDOWPOS3IARBPROC WindowPos3iARB;
        /* 1177 */ PFNGLWINDOWPOS3IMESAPROC WindowPos3iMESA;
        /* 1178 */ PFNGLWINDOWPOS3IVPROC WindowPos3iv;
        /* 1179 */ PFNGLWINDOWPOS3IVARBPROC WindowPos3ivARB;
        /* 1180 */ PFNGLWINDOWPOS3IVMESAPROC WindowPos3ivMESA;
        /* 1181 */ PFNGLWINDOWPOS3SPROC WindowPos3s;
        /* 1182 */ PFNGLWINDOWPOS3SARBPROC WindowPos3sARB;
        /* 1183 */ PFNGLWINDOWPOS3SMESAPROC WindowPos3sMESA;
        /* 1184 */ PFNGLWINDOWPOS3SVPROC WindowPos3sv;
        /* 1185 */ PFNGLWINDOWPOS3SVARBPROC WindowPos3svARB;
        /* 1186 */ PFNGLWINDOWPOS3SVMESAPROC WindowPos3svMESA;
        /* 1187 */ PFNGLWINDOWPOS4DMESAPROC WindowPos4dMESA;
        /* 1188 */ PFNGLWINDOWPOS4DVMESAPROC WindowPos4dvMESA;
        /* 1189 */ PFNGLWINDOWPOS4FMESAPROC WindowPos4fMESA;
        /* 1190 */ PFNGLWINDOWPOS4FVMESAPROC WindowPos4fvMESA;
        /* 1191 */ PFNGLWINDOWPOS4IMESAPROC WindowPos4iMESA;
        /* 1192 */ PFNGLWINDOWPOS4IVMESAPROC WindowPos4ivMESA;
        /* 1193 */ PFNGLWINDOWPOS4SMESAPROC WindowPos4sMESA;
        /* 1194 */ PFNGLWINDOWPOS4SVMESAPROC WindowPos4svMESA;
        /* 1195 */ PFNGLACTIVESHADERPROGRAMPROC ActiveShaderProgram;
        /* 1196 */ PFNGLACTIVESHADERPROGRAMEXTPROC ActiveShaderProgramEXT;
        /* 1197 */ PFNGLBEGINQUERYEXTPROC BeginQueryEXT;
        /* 1198 */ PFNGLBEGINTRANSFORMFEEDBACKPROC BeginTransformFeedback;
        /* 1199 */ PFNGLBINDBUFFERBASEPROC BindBufferBase;
        /* 1200 */ PFNGLBINDBUFFERRANGEPROC BindBufferRange;
        /* 1201 */ PFNGLBINDFRAMEBUFFERPROC BindFramebuffer;
        /* 1202 */ PFNGLBINDIMAGETEXTUREPROC BindImageTexture;
        /* 1203 */ PFNGLBINDPROGRAMPIPELINEPROC BindProgramPipeline;
        /* 1204 */ PFNGLBINDPROGRAMPIPELINEEXTPROC BindProgramPipelineEXT;
        /* 1205 */ PFNGLBINDRENDERBUFFERPROC BindRenderbuffer;
        /* 1206 */ PFNGLBINDSAMPLERPROC BindSampler;
        /* 1207 */ PFNGLBINDTRANSFORMFEEDBACKPROC BindTransformFeedback;
        /* 1208 */ PFNGLBINDVERTEXARRAYPROC BindVertexArray;
        /* 1209 */ PFNGLBINDVERTEXARRAYOESPROC BindVertexArrayOES;
        /* 1210 */ PFNGLBINDVERTEXBUFFERPROC BindVertexBuffer;
        /* 1211 */ PFNGLBLENDBARRIERPROC BlendBarrier;
        /* 1212 */ PFNGLBLENDBARRIERKHRPROC BlendBarrierKHR;
        /* 1213 */ PFNGLBLENDBARRIERNVPROC BlendBarrierNV;
        /* 1214 */ PFNGLBLENDEQUATIONSEPARATEIPROC BlendEquationSeparatei;
        /* 1215 */ PFNGLBLENDEQUATIONSEPARATEIEXTPROC BlendEquationSeparateiEXT;
        /* 1216 */ PFNGLBLENDEQUATIONSEPARATEIOESPROC BlendEquationSeparateiOES;
        /* 1217 */ PFNGLBLENDEQUATIONIPROC BlendEquationi;
        /* 1218 */ PFNGLBLENDEQUATIONIEXTPROC BlendEquationiEXT;
        /* 1219 */ PFNGLBLENDEQUATIONIOESPROC BlendEquationiOES;
        /* 1220 */ PFNGLBLENDFUNCSEPARATEIPROC BlendFuncSeparatei;
        /* 1221 */ PFNGLBLENDFUNCSEPARATEIEXTPROC BlendFuncSeparateiEXT;
        /* 1222 */ PFNGLBLENDFUNCSEPARATEIOESPROC BlendFuncSeparateiOES;
        /* 1223 */ PFNGLBLENDFUNCIPROC BlendFunci;
        /* 1224 */ PFNGLBLENDFUNCIEXTPROC BlendFunciEXT;
        /* 1225 */ PFNGLBLENDFUNCIOESPROC BlendFunciOES;
        /* 1226 */ PFNGLBLENDPARAMETERINVPROC BlendParameteriNV;
        /* 1227 */ PFNGLBLITFRAMEBUFFERPROC BlitFramebuffer;
        /* 1228 */ PFNGLBLITFRAMEBUFFERNVPROC BlitFramebufferNV;
        /* 1229 */ PFNGLCHECKFRAMEBUFFERSTATUSPROC CheckFramebufferStatus;
        /* 1230 */ PFNGLCLEARBUFFERFIPROC ClearBufferfi;
        /* 1231 */ PFNGLCLEARBUFFERFVPROC ClearBufferfv;
        /* 1232 */ PFNGLCLEARBUFFERIVPROC ClearBufferiv;
        /* 1233 */ PFNGLCLEARBUFFERUIVPROC ClearBufferuiv;
        /* 1234 */ PFNGLCLEARDEPTHFPROC ClearDepthf;
        /* 1235 */ PFNGLCLIENTWAITSYNCPROC ClientWaitSync;
        /* 1236 */ PFNGLCLIENTWAITSYNCAPPLEPROC ClientWaitSyncAPPLE;
        /* 1237 */ PFNGLCOLORMASKIPROC ColorMaski;
        /* 1238 */ PFNGLCOLORMASKIEXTPROC ColorMaskiEXT;
        /* 1239 */ PFNGLCOLORMASKIOESPROC ColorMaskiOES;
        /* 1240 */ PFNGLCOPYBUFFERSUBDATAPROC CopyBufferSubData;
        /* 1241 */ PFNGLCOPYBUFFERSUBDATANVPROC CopyBufferSubDataNV;
        /* 1242 */ PFNGLCOPYIMAGESUBDATAPROC CopyImageSubData;
        /* 1243 */ PFNGLCOPYIMAGESUBDATAEXTPROC CopyImageSubDataEXT;
        /* 1244 */ PFNGLCOPYIMAGESUBDATAOESPROC CopyImageSubDataOES;
        /* 1245 */ PFNGLCREATESHADERPROGRAMVPROC CreateShaderProgramv;
        /* 1246 */ PFNGLCREATESHADERPROGRAMVEXTPROC CreateShaderProgramvEXT;
        /* 1247 */ PFNGLDEBUGMESSAGECALLBACKKHRPROC DebugMessageCallbackKHR;
        /* 1248 */ PFNGLDEBUGMESSAGECONTROLKHRPROC DebugMessageControlKHR;
        /* 1249 */ PFNGLDEBUGMESSAGEINSERTKHRPROC DebugMessageInsertKHR;
        /* 1250 */ PFNGLDELETEFRAMEBUFFERSPROC DeleteFramebuffers;
        /* 1251 */ PFNGLDELETEPROGRAMPIPELINESPROC DeleteProgramPipelines;
        /* 1252 */ PFNGLDELETEPROGRAMPIPELINESEXTPROC DeleteProgramPipelinesEXT;
        /* 1253 */ PFNGLDELETEQUERIESEXTPROC DeleteQueriesEXT;
        /* 1254 */ PFNGLDELETERENDERBUFFERSPROC DeleteRenderbuffers;
        /* 1255 */ PFNGLDELETESAMPLERSPROC DeleteSamplers;
        /* 1256 */ PFNGLDELETESYNCPROC DeleteSync;
        /* 1257 */ PFNGLDELETESYNCAPPLEPROC DeleteSyncAPPLE;
        /* 1258 */ PFNGLDELETETRANSFORMFEEDBACKSPROC DeleteTransformFeedbacks;
        /* 1259 */ PFNGLDELETEVERTEXARRAYSPROC DeleteVertexArrays;
        /* 1260 */ PFNGLDELETEVERTEXARRAYSOESPROC DeleteVertexArraysOES;
        /* 1261 */ PFNGLDEPTHRANGEARRAYFVNVPROC DepthRangeArrayfvNV;
        /* 1262 */ PFNGLDEPTHRANGEARRAYFVOESPROC DepthRangeArrayfvOES;
        /* 1263 */ PFNGLDEPTHRANGEINDEXEDFNVPROC DepthRangeIndexedfNV;
        /* 1264 */ PFNGLDEPTHRANGEINDEXEDFOESPROC DepthRangeIndexedfOES;
        /* 1265 */ PFNGLDEPTHRANGEFPROC DepthRangef;
        /* 1266 */ PFNGLDISABLEIPROC Disablei;
        /* 1267 */ PFNGLDISABLEIEXTPROC DisableiEXT;
        /* 1268 */ PFNGLDISABLEINVPROC DisableiNV;
        /* 1269 */ PFNGLDISABLEIOESPROC DisableiOES;
        /* 1270 */ PFNGLDISPATCHCOMPUTEPROC DispatchCompute;
        /* 1271 */ PFNGLDISPATCHCOMPUTEINDIRECTPROC DispatchComputeIndirect;
        /* 1272 */ PFNGLDRAWARRAYSINDIRECTPROC DrawArraysIndirect;
        /* 1273 */ PFNGLDRAWARRAYSINSTANCEDPROC DrawArraysInstanced;
        /* 1274 */ PFNGLDRAWARRAYSINSTANCEDANGLEPROC DrawArraysInstancedANGLE;
        /* 1275 */ PFNGLDRAWARRAYSINSTANCEDEXTPROC DrawArraysInstancedEXT;
        /* 1276 */ PFNGLDRAWARRAYSINSTANCEDNVPROC DrawArraysInstancedNV;
        /* 1277 */ PFNGLDRAWBUFFERSEXTPROC DrawBuffersEXT;
        /* 1278 */ PFNGLDRAWELEMENTSBASEVERTEXPROC DrawElementsBaseVertex;
        /* 1279 */ PFNGLDRAWELEMENTSBASEVERTEXEXTPROC DrawElementsBaseVertexEXT;
        /* 1280 */ PFNGLDRAWELEMENTSBASEVERTEXOESPROC DrawElementsBaseVertexOES;
        /* 1281 */ PFNGLDRAWELEMENTSINDIRECTPROC DrawElementsIndirect;
        /* 1282 */ PFNGLDRAWELEMENTSINSTANCEDPROC DrawElementsInstanced;
        /* 1283 */ PFNGLDRAWELEMENTSINSTANCEDANGLEPROC DrawElementsInstancedANGLE;
        /* 1284 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXPROC DrawElementsInstancedBaseVertex;
        /* 1285 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXEXTPROC DrawElementsInstancedBaseVertexEXT;
        /* 1286 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXOESPROC DrawElementsInstancedBaseVertexOES;
        /* 1287 */ PFNGLDRAWELEMENTSINSTANCEDEXTPROC DrawElementsInstancedEXT;
        /* 1288 */ PFNGLDRAWELEMENTSINSTANCEDNVPROC DrawElementsInstancedNV;
        /* 1289 */ PFNGLDRAWRANGEELEMENTSBASEVERTEXPROC DrawRangeElementsBaseVertex;
        /* 1290 */ PFNGLDRAWRANGEELEMENTSBASEVERTEXEXTPROC DrawRangeElementsBaseVertexEXT;
        /* 1291 */ PFNGLDRAWRANGEELEMENTSBASEVERTEXOESPROC DrawRangeElementsBaseVertexOES;
        /* 1292 */ PFNGLENABLEIPROC Enablei;
        /* 1293 */ PFNGLENABLEIEXTPROC EnableiEXT;
        /* 1294 */ PFNGLENABLEINVPROC EnableiNV;
        /* 1295 */ PFNGLENABLEIOESPROC EnableiOES;
        /* 1296 */ PFNGLENDQUERYEXTPROC EndQueryEXT;
        /* 1297 */ PFNGLENDTRANSFORMFEEDBACKPROC EndTransformFeedback;
        /* 1298 */ PFNGLFENCESYNCPROC FenceSync;
        /* 1299 */ PFNGLFENCESYNCAPPLEPROC FenceSyncAPPLE;
        /* 1300 */ PFNGLFLUSHMAPPEDBUFFERRANGEPROC FlushMappedBufferRange;
        /* 1301 */ PFNGLFLUSHMAPPEDBUFFERRANGEEXTPROC FlushMappedBufferRangeEXT;
        /* 1302 */ PFNGLFRAMEBUFFERPARAMETERIPROC FramebufferParameteri;
        /* 1303 */ PFNGLFRAMEBUFFERRENDERBUFFERPROC FramebufferRenderbuffer;
        /* 1304 */ PFNGLFRAMEBUFFERTEXTUREPROC FramebufferTexture;
        /* 1305 */ PFNGLFRAMEBUFFERTEXTURE2DPROC FramebufferTexture2D;
        /* 1306 */ PFNGLFRAMEBUFFERTEXTURE2DMULTISAMPLEEXTPROC FramebufferTexture2DMultisampleEXT;
        /* 1307 */ PFNGLFRAMEBUFFERTEXTUREEXTPROC FramebufferTextureEXT;
        /* 1308 */ PFNGLFRAMEBUFFERTEXTURELAYERPROC FramebufferTextureLayer;
        /* 1309 */ PFNGLFRAMEBUFFERTEXTUREOESPROC FramebufferTextureOES;
        /* 1310 */ PFNGLGENFRAMEBUFFERSPROC GenFramebuffers;
        /* 1311 */ PFNGLGENPROGRAMPIPELINESPROC GenProgramPipelines;
        /* 1312 */ PFNGLGENPROGRAMPIPELINESEXTPROC GenProgramPipelinesEXT;
        /* 1313 */ PFNGLGENQUERIESEXTPROC GenQueriesEXT;
        /* 1314 */ PFNGLGENRENDERBUFFERSPROC GenRenderbuffers;
        /* 1315 */ PFNGLGENSAMPLERSPROC GenSamplers;
        /* 1316 */ PFNGLGENTRANSFORMFEEDBACKSPROC GenTransformFeedbacks;
        /* 1317 */ PFNGLGENVERTEXARRAYSPROC GenVertexArrays;
        /* 1318 */ PFNGLGENVERTEXARRAYSOESPROC GenVertexArraysOES;
        /* 1319 */ PFNGLGENERATEMIPMAPPROC GenerateMipmap;
        /* 1320 */ PFNGLGETACTIVEUNIFORMBLOCKNAMEPROC GetActiveUniformBlockName;
        /* 1321 */ PFNGLGETACTIVEUNIFORMBLOCKIVPROC GetActiveUniformBlockiv;
        /* 1322 */ PFNGLGETACTIVEUNIFORMSIVPROC GetActiveUniformsiv;
        /* 1323 */ PFNGLGETBOOLEANI_VPROC GetBooleani_v;
        /* 1324 */ PFNGLGETBUFFERPARAMETERI64VPROC GetBufferParameteri64v;
        /* 1325 */ PFNGLGETBUFFERPOINTERVOESPROC GetBufferPointervOES;
        /* 1326 */ PFNGLGETDEBUGMESSAGELOGKHRPROC GetDebugMessageLogKHR;
        /* 1327 */ PFNGLGETFLOATI_VNVPROC GetFloati_vNV;
        /* 1328 */ PFNGLGETFLOATI_VOESPROC GetFloati_vOES;
        /* 1329 */ PFNGLGETFRAGDATALOCATIONPROC GetFragDataLocation;
        /* 1330 */ PFNGLGETFRAMEBUFFERATTACHMENTPARAMETERIVPROC GetFramebufferAttachmentParameteriv;
        /* 1331 */ PFNGLGETFRAMEBUFFERPARAMETERIVPROC GetFramebufferParameteriv;
        /* 1332 */ PFNGLGETGRAPHICSRESETSTATUSPROC GetGraphicsResetStatus;
        /* 1333 */ PFNGLGETGRAPHICSRESETSTATUSEXTPROC GetGraphicsResetStatusEXT;
        /* 1334 */ PFNGLGETGRAPHICSRESETSTATUSKHRPROC GetGraphicsResetStatusKHR;
        /* 1335 */ PFNGLGETINTEGER64I_VPROC GetInteger64i_v;
        /* 1336 */ PFNGLGETINTEGER64VPROC GetInteger64v;
        /* 1337 */ PFNGLGETINTEGER64VAPPLEPROC GetInteger64vAPPLE;
        /* 1338 */ PFNGLGETINTEGER64VEXTPROC GetInteger64vEXT;
        /* 1339 */ PFNGLGETINTEGERI_VPROC GetIntegeri_v;
        /* 1340 */ PFNGLGETINTERNALFORMATIVPROC GetInternalformativ;
        /* 1341 */ PFNGLGETMULTISAMPLEFVPROC GetMultisamplefv;
        /* 1342 */ PFNGLGETMULTISAMPLEFVANGLEPROC GetMultisamplefvANGLE;
        /* 1343 */ PFNGLGETOBJECTLABELKHRPROC GetObjectLabelKHR;
        /* 1344 */ PFNGLGETOBJECTPTRLABELKHRPROC GetObjectPtrLabelKHR;
        /* 1345 */ PFNGLGETPOINTERVKHRPROC GetPointervKHR;
        /* 1346 */ PFNGLGETPROGRAMBINARYPROC GetProgramBinary;
        /* 1347 */ PFNGLGETPROGRAMBINARYOESPROC GetProgramBinaryOES;
        /* 1348 */ PFNGLGETPROGRAMINTERFACEIVPROC GetProgramInterfaceiv;
        /* 1349 */ PFNGLGETPROGRAMPIPELINEINFOLOGPROC GetProgramPipelineInfoLog;
        /* 1350 */ PFNGLGETPROGRAMPIPELINEINFOLOGEXTPROC GetProgramPipelineInfoLogEXT;
        /* 1351 */ PFNGLGETPROGRAMPIPELINEIVPROC GetProgramPipelineiv;
        /* 1352 */ PFNGLGETPROGRAMPIPELINEIVEXTPROC GetProgramPipelineivEXT;
        /* 1353 */ PFNGLGETPROGRAMRESOURCEINDEXPROC GetProgramResourceIndex;
        /* 1354 */ PFNGLGETPROGRAMRESOURCELOCATIONPROC GetProgramResourceLocation;
        /* 1355 */ PFNGLGETPROGRAMRESOURCENAMEPROC GetProgramResourceName;
        /* 1356 */ PFNGLGETPROGRAMRESOURCEIVPROC GetProgramResourceiv;
        /* 1357 */ PFNGLGETQUERYOBJECTI64VEXTPROC GetQueryObjecti64vEXT;
        /* 1358 */ PFNGLGETQUERYOBJECTIVEXTPROC GetQueryObjectivEXT;
        /* 1359 */ PFNGLGETQUERYOBJECTUI64VEXTPROC GetQueryObjectui64vEXT;
        /* 1360 */ PFNGLGETQUERYOBJECTUIVEXTPROC GetQueryObjectuivEXT;
        /* 1361 */ PFNGLGETQUERYIVEXTPROC GetQueryivEXT;
        /* 1362 */ PFNGLGETRENDERBUFFERPARAMETERIVPROC GetRenderbufferParameteriv;
        /* 1363 */ PFNGLGETSAMPLERPARAMETERIIVPROC GetSamplerParameterIiv;
        /* 1364 */ PFNGLGETSAMPLERPARAMETERIIVEXTPROC GetSamplerParameterIivEXT;
        /* 1365 */ PFNGLGETSAMPLERPARAMETERIIVOESPROC GetSamplerParameterIivOES;
        /* 1366 */ PFNGLGETSAMPLERPARAMETERIUIVPROC GetSamplerParameterIuiv;
        /* 1367 */ PFNGLGETSAMPLERPARAMETERIUIVEXTPROC GetSamplerParameterIuivEXT;
        /* 1368 */ PFNGLGETSAMPLERPARAMETERIUIVOESPROC GetSamplerParameterIuivOES;
        /* 1369 */ PFNGLGETSAMPLERPARAMETERFVPROC GetSamplerParameterfv;
        /* 1370 */ PFNGLGETSAMPLERPARAMETERIVPROC GetSamplerParameteriv;
        /* 1371 */ PFNGLGETSHADERPRECISIONFORMATPROC GetShaderPrecisionFormat;
        /* 1372 */ PFNGLGETSTRINGIPROC GetStringi;
        /* 1373 */ PFNGLGETSYNCIVPROC GetSynciv;
        /* 1374 */ PFNGLGETSYNCIVAPPLEPROC GetSyncivAPPLE;
        /* 1375 */ PFNGLGETTEXLEVELPARAMETERFVANGLEPROC GetTexLevelParameterfvANGLE;
        /* 1376 */ PFNGLGETTEXLEVELPARAMETERIVANGLEPROC GetTexLevelParameterivANGLE;
        /* 1377 */ PFNGLGETTEXPARAMETERIIVPROC GetTexParameterIiv;
        /* 1378 */ PFNGLGETTEXPARAMETERIIVEXTPROC GetTexParameterIivEXT;
        /* 1379 */ PFNGLGETTEXPARAMETERIIVOESPROC GetTexParameterIivOES;
        /* 1380 */ PFNGLGETTEXPARAMETERIUIVPROC GetTexParameterIuiv;
        /* 1381 */ PFNGLGETTEXPARAMETERIUIVEXTPROC GetTexParameterIuivEXT;
        /* 1382 */ PFNGLGETTEXPARAMETERIUIVOESPROC GetTexParameterIuivOES;
        /* 1383 */ PFNGLGETTRANSFORMFEEDBACKVARYINGPROC GetTransformFeedbackVarying;
        /* 1384 */ PFNGLGETUNIFORMBLOCKINDEXPROC GetUniformBlockIndex;
        /* 1385 */ PFNGLGETUNIFORMINDICESPROC GetUniformIndices;
        /* 1386 */ PFNGLGETUNIFORMUIVPROC GetUniformuiv;
        /* 1387 */ PFNGLGETVERTEXATTRIBIIVPROC GetVertexAttribIiv;
        /* 1388 */ PFNGLGETVERTEXATTRIBIUIVPROC GetVertexAttribIuiv;
        /* 1389 */ PFNGLGETNUNIFORMFVPROC GetnUniformfv;
        /* 1390 */ PFNGLGETNUNIFORMFVEXTPROC GetnUniformfvEXT;
        /* 1391 */ PFNGLGETNUNIFORMFVKHRPROC GetnUniformfvKHR;
        /* 1392 */ PFNGLGETNUNIFORMIVPROC GetnUniformiv;
        /* 1393 */ PFNGLGETNUNIFORMIVEXTPROC GetnUniformivEXT;
        /* 1394 */ PFNGLGETNUNIFORMIVKHRPROC GetnUniformivKHR;
        /* 1395 */ PFNGLGETNUNIFORMUIVPROC GetnUniformuiv;
        /* 1396 */ PFNGLGETNUNIFORMUIVKHRPROC GetnUniformuivKHR;
        /* 1397 */ PFNGLINVALIDATEFRAMEBUFFERPROC InvalidateFramebuffer;
        /* 1398 */ PFNGLINVALIDATESUBFRAMEBUFFERPROC InvalidateSubFramebuffer;
        /* 1399 */ PFNGLISENABLEDIPROC IsEnabledi;
        /* 1400 */ PFNGLISENABLEDIEXTPROC IsEnablediEXT;
        /* 1401 */ PFNGLISENABLEDINVPROC IsEnablediNV;
        /* 1402 */ PFNGLISENABLEDIOESPROC IsEnablediOES;
        /* 1403 */ PFNGLISFRAMEBUFFERPROC IsFramebuffer;
        /* 1404 */ PFNGLISPROGRAMPIPELINEPROC IsProgramPipeline;
        /* 1405 */ PFNGLISPROGRAMPIPELINEEXTPROC IsProgramPipelineEXT;
        /* 1406 */ PFNGLISQUERYEXTPROC IsQueryEXT;
        /* 1407 */ PFNGLISRENDERBUFFERPROC IsRenderbuffer;
        /* 1408 */ PFNGLISSAMPLERPROC IsSampler;
        /* 1409 */ PFNGLISSYNCPROC IsSync;
        /* 1410 */ PFNGLISSYNCAPPLEPROC IsSyncAPPLE;
        /* 1411 */ PFNGLISTRANSFORMFEEDBACKPROC IsTransformFeedback;
        /* 1412 */ PFNGLISVERTEXARRAYPROC IsVertexArray;
        /* 1413 */ PFNGLISVERTEXARRAYOESPROC IsVertexArrayOES;
        /* 1414 */ PFNGLMAPBUFFEROESPROC MapBufferOES;
        /* 1415 */ PFNGLMAPBUFFERRANGEPROC MapBufferRange;
        /* 1416 */ PFNGLMAPBUFFERRANGEEXTPROC MapBufferRangeEXT;
        /* 1417 */ PFNGLMEMORYBARRIERPROC MemoryBarrier;
        /* 1418 */ PFNGLMEMORYBARRIERBYREGIONPROC MemoryBarrierByRegion;
        /* 1419 */ PFNGLMINSAMPLESHADINGPROC MinSampleShading;
        /* 1420 */ PFNGLMINSAMPLESHADINGOESPROC MinSampleShadingOES;
        /* 1421 */ PFNGLMULTIDRAWELEMENTSBASEVERTEXEXTPROC MultiDrawElementsBaseVertexEXT;
        /* 1422 */ PFNGLOBJECTLABELKHRPROC ObjectLabelKHR;
        /* 1423 */ PFNGLOBJECTPTRLABELKHRPROC ObjectPtrLabelKHR;
        /* 1424 */ PFNGLPATCHPARAMETERIPROC PatchParameteri;
        /* 1425 */ PFNGLPATCHPARAMETERIEXTPROC PatchParameteriEXT;
        /* 1426 */ PFNGLPATCHPARAMETERIOESPROC PatchParameteriOES;
        /* 1427 */ PFNGLPAUSETRANSFORMFEEDBACKPROC PauseTransformFeedback;
        /* 1428 */ PFNGLPOPDEBUGGROUPKHRPROC PopDebugGroupKHR;
        /* 1429 */ PFNGLPRIMITIVEBOUNDINGBOXPROC PrimitiveBoundingBox;
        /* 1430 */ PFNGLPRIMITIVEBOUNDINGBOXEXTPROC PrimitiveBoundingBoxEXT;
        /* 1431 */ PFNGLPRIMITIVEBOUNDINGBOXOESPROC PrimitiveBoundingBoxOES;
        /* 1432 */ PFNGLPROGRAMBINARYPROC ProgramBinary;
        /* 1433 */ PFNGLPROGRAMBINARYOESPROC ProgramBinaryOES;
        /* 1434 */ PFNGLPROGRAMPARAMETERIPROC ProgramParameteri;
        /* 1435 */ PFNGLPROGRAMPARAMETERIEXTPROC ProgramParameteriEXT;
        /* 1436 */ PFNGLPROGRAMUNIFORM1FPROC ProgramUniform1f;
        /* 1437 */ PFNGLPROGRAMUNIFORM1FVPROC ProgramUniform1fv;
        /* 1438 */ PFNGLPROGRAMUNIFORM1IPROC ProgramUniform1i;
        /* 1439 */ PFNGLPROGRAMUNIFORM1IVPROC ProgramUniform1iv;
        /* 1440 */ PFNGLPROGRAMUNIFORM1UIPROC ProgramUniform1ui;
        /* 1441 */ PFNGLPROGRAMUNIFORM1UIVPROC ProgramUniform1uiv;
        /* 1442 */ PFNGLPROGRAMUNIFORM2FPROC ProgramUniform2f;
        /* 1443 */ PFNGLPROGRAMUNIFORM2FVPROC ProgramUniform2fv;
        /* 1444 */ PFNGLPROGRAMUNIFORM2IPROC ProgramUniform2i;
        /* 1445 */ PFNGLPROGRAMUNIFORM2IVPROC ProgramUniform2iv;
        /* 1446 */ PFNGLPROGRAMUNIFORM2UIPROC ProgramUniform2ui;
        /* 1447 */ PFNGLPROGRAMUNIFORM2UIVPROC ProgramUniform2uiv;
        /* 1448 */ PFNGLPROGRAMUNIFORM3FPROC ProgramUniform3f;
        /* 1449 */ PFNGLPROGRAMUNIFORM3FVPROC ProgramUniform3fv;
        /* 1450 */ PFNGLPROGRAMUNIFORM3IPROC ProgramUniform3i;
        /* 1451 */ PFNGLPROGRAMUNIFORM3IVPROC ProgramUniform3iv;
        /* 1452 */ PFNGLPROGRAMUNIFORM3UIPROC ProgramUniform3ui;
        /* 1453 */ PFNGLPROGRAMUNIFORM3UIVPROC ProgramUniform3uiv;
        /* 1454 */ PFNGLPROGRAMUNIFORM4FPROC ProgramUniform4f;
        /* 1455 */ PFNGLPROGRAMUNIFORM4FVPROC ProgramUniform4fv;
        /* 1456 */ PFNGLPROGRAMUNIFORM4IPROC ProgramUniform4i;
        /* 1457 */ PFNGLPROGRAMUNIFORM4IVPROC ProgramUniform4iv;
        /* 1458 */ PFNGLPROGRAMUNIFORM4UIPROC ProgramUniform4ui;
        /* 1459 */ PFNGLPROGRAMUNIFORM4UIVPROC ProgramUniform4uiv;
        /* 1460 */ PFNGLPROGRAMUNIFORMMATRIX2FVPROC ProgramUniformMatrix2fv;
        /* 1461 */ PFNGLPROGRAMUNIFORMMATRIX2X3FVPROC ProgramUniformMatrix2x3fv;
        /* 1462 */ PFNGLPROGRAMUNIFORMMATRIX2X4FVPROC ProgramUniformMatrix2x4fv;
        /* 1463 */ PFNGLPROGRAMUNIFORMMATRIX3FVPROC ProgramUniformMatrix3fv;
        /* 1464 */ PFNGLPROGRAMUNIFORMMATRIX3X2FVPROC ProgramUniformMatrix3x2fv;
        /* 1465 */ PFNGLPROGRAMUNIFORMMATRIX3X4FVPROC ProgramUniformMatrix3x4fv;
        /* 1466 */ PFNGLPROGRAMUNIFORMMATRIX4FVPROC ProgramUniformMatrix4fv;
        /* 1467 */ PFNGLPROGRAMUNIFORMMATRIX4X2FVPROC ProgramUniformMatrix4x2fv;
        /* 1468 */ PFNGLPROGRAMUNIFORMMATRIX4X3FVPROC ProgramUniformMatrix4x3fv;
        /* 1469 */ PFNGLPUSHDEBUGGROUPKHRPROC PushDebugGroupKHR;
        /* 1470 */ PFNGLQUERYCOUNTEREXTPROC QueryCounterEXT;
        /* 1471 */ PFNGLREADNPIXELSPROC ReadnPixels;
        /* 1472 */ PFNGLREADNPIXELSEXTPROC ReadnPixelsEXT;
        /* 1473 */ PFNGLREADNPIXELSKHRPROC ReadnPixelsKHR;
        /* 1474 */ PFNGLRELEASESHADERCOMPILERPROC ReleaseShaderCompiler;
        /* 1475 */ PFNGLRENDERBUFFERSTORAGEPROC RenderbufferStorage;
        /* 1476 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEPROC RenderbufferStorageMultisample;
        /* 1477 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEEXTPROC RenderbufferStorageMultisampleEXT;
        /* 1478 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLENVPROC RenderbufferStorageMultisampleNV;
        /* 1479 */ PFNGLRESUMETRANSFORMFEEDBACKPROC ResumeTransformFeedback;
        /* 1480 */ PFNGLSAMPLEMASKIPROC SampleMaski;
        /* 1481 */ PFNGLSAMPLEMASKIANGLEPROC SampleMaskiANGLE;
        /* 1482 */ PFNGLSAMPLERPARAMETERIIVPROC SamplerParameterIiv;
        /* 1483 */ PFNGLSAMPLERPARAMETERIIVEXTPROC SamplerParameterIivEXT;
        /* 1484 */ PFNGLSAMPLERPARAMETERIIVOESPROC SamplerParameterIivOES;
        /* 1485 */ PFNGLSAMPLERPARAMETERIUIVPROC SamplerParameterIuiv;
        /* 1486 */ PFNGLSAMPLERPARAMETERIUIVEXTPROC SamplerParameterIuivEXT;
        /* 1487 */ PFNGLSAMPLERPARAMETERIUIVOESPROC SamplerParameterIuivOES;
        /* 1488 */ PFNGLSAMPLERPARAMETERFPROC SamplerParameterf;
        /* 1489 */ PFNGLSAMPLERPARAMETERFVPROC SamplerParameterfv;
        /* 1490 */ PFNGLSAMPLERPARAMETERIPROC SamplerParameteri;
        /* 1491 */ PFNGLSAMPLERPARAMETERIVPROC SamplerParameteriv;
        /* 1492 */ PFNGLSCISSORARRAYVNVPROC ScissorArrayvNV;
        /* 1493 */ PFNGLSCISSORARRAYVOESPROC ScissorArrayvOES;
        /* 1494 */ PFNGLSCISSORINDEXEDNVPROC ScissorIndexedNV;
        /* 1495 */ PFNGLSCISSORINDEXEDOESPROC ScissorIndexedOES;
        /* 1496 */ PFNGLSCISSORINDEXEDVNVPROC ScissorIndexedvNV;
        /* 1497 */ PFNGLSCISSORINDEXEDVOESPROC ScissorIndexedvOES;
        /* 1498 */ PFNGLSHADERBINARYPROC ShaderBinary;
        /* 1499 */ PFNGLTEXBUFFERPROC TexBuffer;
        /* 1500 */ PFNGLTEXBUFFEREXTPROC TexBufferEXT;
        /* 1501 */ PFNGLTEXBUFFEROESPROC TexBufferOES;
        /* 1502 */ PFNGLTEXBUFFERRANGEPROC TexBufferRange;
        /* 1503 */ PFNGLTEXBUFFERRANGEEXTPROC TexBufferRangeEXT;
        /* 1504 */ PFNGLTEXBUFFERRANGEOESPROC TexBufferRangeOES;
        /* 1505 */ PFNGLTEXPARAMETERIIVPROC TexParameterIiv;
        /* 1506 */ PFNGLTEXPARAMETERIIVEXTPROC TexParameterIivEXT;
        /* 1507 */ PFNGLTEXPARAMETERIIVOESPROC TexParameterIivOES;
        /* 1508 */ PFNGLTEXPARAMETERIUIVPROC TexParameterIuiv;
        /* 1509 */ PFNGLTEXPARAMETERIUIVEXTPROC TexParameterIuivEXT;
        /* 1510 */ PFNGLTEXPARAMETERIUIVOESPROC TexParameterIuivOES;
        /* 1511 */ PFNGLTEXSTORAGE2DPROC TexStorage2D;
        /* 1512 */ PFNGLTEXSTORAGE2DMULTISAMPLEPROC TexStorage2DMultisample;
        /* 1513 */ PFNGLTEXSTORAGE2DMULTISAMPLEANGLEPROC TexStorage2DMultisampleANGLE;
        /* 1514 */ PFNGLTEXSTORAGE3DPROC TexStorage3D;
        /* 1515 */ PFNGLTEXSTORAGE3DMULTISAMPLEPROC TexStorage3DMultisample;
        /* 1516 */ PFNGLTEXSTORAGE3DMULTISAMPLEOESPROC TexStorage3DMultisampleOES;
        /* 1517 */ PFNGLTRANSFORMFEEDBACKVARYINGSPROC TransformFeedbackVaryings;
        /* 1518 */ PFNGLUNIFORM1UIPROC Uniform1ui;
        /* 1519 */ PFNGLUNIFORM1UIVPROC Uniform1uiv;
        /* 1520 */ PFNGLUNIFORM2UIPROC Uniform2ui;
        /* 1521 */ PFNGLUNIFORM2UIVPROC Uniform2uiv;
        /* 1522 */ PFNGLUNIFORM3UIPROC Uniform3ui;
        /* 1523 */ PFNGLUNIFORM3UIVPROC Uniform3uiv;
        /* 1524 */ PFNGLUNIFORM4UIPROC Uniform4ui;
        /* 1525 */ PFNGLUNIFORM4UIVPROC Uniform4uiv;
        /* 1526 */ PFNGLUNIFORMBLOCKBINDINGPROC UniformBlockBinding;
        /* 1527 */ PFNGLUNIFORMMATRIX2X3FVNVPROC UniformMatrix2x3fvNV;
        /* 1528 */ PFNGLUNIFORMMATRIX2X4FVNVPROC UniformMatrix2x4fvNV;
        /* 1529 */ PFNGLUNIFORMMATRIX3X2FVNVPROC UniformMatrix3x2fvNV;
        /* 1530 */ PFNGLUNIFORMMATRIX3X4FVNVPROC UniformMatrix3x4fvNV;
        /* 1531 */ PFNGLUNIFORMMATRIX4X2FVNVPROC UniformMatrix4x2fvNV;
        /* 1532 */ PFNGLUNIFORMMATRIX4X3FVNVPROC UniformMatrix4x3fvNV;
        /* 1533 */ PFNGLUNMAPBUFFEROESPROC UnmapBufferOES;
        /* 1534 */ PFNGLUSEPROGRAMSTAGESPROC UseProgramStages;
        /* 1535 */ PFNGLUSEPROGRAMSTAGESEXTPROC UseProgramStagesEXT;
        /* 1536 */ PFNGLVALIDATEPROGRAMPIPELINEPROC ValidateProgramPipeline;
        /* 1537 */ PFNGLVALIDATEPROGRAMPIPELINEEXTPROC ValidateProgramPipelineEXT;
        /* 1538 */ PFNGLVERTEXATTRIBBINDINGPROC VertexAttribBinding;
        /* 1539 */ PFNGLVERTEXATTRIBDIVISORPROC VertexAttribDivisor;
        /* 1540 */ PFNGLVERTEXATTRIBDIVISORANGLEPROC VertexAttribDivisorANGLE;
        /* 1541 */ PFNGLVERTEXATTRIBDIVISOREXTPROC VertexAttribDivisorEXT;
        /* 1542 */ PFNGLVERTEXATTRIBDIVISORNVPROC VertexAttribDivisorNV;
        /* 1543 */ PFNGLVERTEXATTRIBFORMATPROC VertexAttribFormat;
        /* 1544 */ PFNGLVERTEXATTRIBI4IPROC VertexAttribI4i;
        /* 1545 */ PFNGLVERTEXATTRIBI4IVPROC VertexAttribI4iv;
        /* 1546 */ PFNGLVERTEXATTRIBI4UIPROC VertexAttribI4ui;
        /* 1547 */ PFNGLVERTEXATTRIBI4UIVPROC VertexAttribI4uiv;
        /* 1548 */ PFNGLVERTEXATTRIBIFORMATPROC VertexAttribIFormat;
        /* 1549 */ PFNGLVERTEXATTRIBIPOINTERPROC VertexAttribIPointer;
        /* 1550 */ PFNGLVERTEXBINDINGDIVISORPROC VertexBindingDivisor;
        /* 1551 */ PFNGLVIEWPORTARRAYVNVPROC ViewportArrayvNV;
        /* 1552 */ PFNGLVIEWPORTARRAYVOESPROC ViewportArrayvOES;
        /* 1553 */ PFNGLVIEWPORTINDEXEDFNVPROC ViewportIndexedfNV;
        /* 1554 */ PFNGLVIEWPORTINDEXEDFOESPROC ViewportIndexedfOES;
        /* 1555 */ PFNGLVIEWPORTINDEXEDFVNVPROC ViewportIndexedfvNV;
        /* 1556 */ PFNGLVIEWPORTINDEXEDFVOESPROC ViewportIndexedfvOES;
        /* 1557 */ PFNGLWAITSYNCPROC WaitSync;
        /* 1558 */ PFNGLWAITSYNCAPPLEPROC WaitSyncAPPLE;
        };
    };

    void* glad_loader_handle;
} GladGLContext;

GLAD_API_CALL GladGLContext glad_gl_context;

#define GLAD_GL_VERSION_1_0 (glad_gl_context.VERSION_1_0)
#define GLAD_GL_VERSION_1_1 (glad_gl_context.VERSION_1_1)
#define GLAD_GL_VERSION_1_2 (glad_gl_context.VERSION_1_2)
#define GLAD_GL_VERSION_1_3 (glad_gl_context.VERSION_1_3)
#define GLAD_GL_VERSION_1_4 (glad_gl_context.VERSION_1_4)
#define GLAD_GL_VERSION_1_5 (glad_gl_context.VERSION_1_5)
#define GLAD_GL_VERSION_2_0 (glad_gl_context.VERSION_2_0)
#define GLAD_GL_VERSION_2_1 (glad_gl_context.VERSION_2_1)
#define GLAD_GL_ES_VERSION_2_0 (glad_gl_context.ES_VERSION_2_0)
#define GLAD_GL_ES_VERSION_3_0 (glad_gl_context.ES_VERSION_3_0)
#define GLAD_GL_ES_VERSION_3_1 (glad_gl_context.ES_VERSION_3_1)
#define GLAD_GL_ES_VERSION_3_2 (glad_gl_context.ES_VERSION_3_2)
#define GLAD_GL_ANGLE_get_tex_level_parameter (glad_gl_context.ANGLE_get_tex_level_parameter)
